{
  "title": "Artificial Intelligence",
  "content": "- ### OntologyBlock\n  id:: artificial-intelligence-ontology\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: AI-0001\n\t- preferred-term:: Artificial Intelligence\n\t- source-domain:: ai\n\t- status:: draft\n    - public-access:: true\n\n\n### Relationships\n- is-subclass-of:: [[TechnologyDomain]]\n\t- definition:: ### Primary Definition\nArtificial intelligence (AI) is the research and development of mechanisms and applications of AI systems. An engineered system that generates outputs such as content, forecasts, recommendations, or decisions for a given set of human-defined objectives. AI systems use machine and human-based inputs to perceive real and virtual environments, abstract such perceptions into models through analysis in an automated manner, and use model inference to formulate options for information or action.\n\n**Source**: ISO/IEC 22989:2022, Clauses 3.1.1-3.1.2 - Authority Score: 0.95\n\n### Alternative Definitions\n1. **NIST AI RMF 1.0**: Research and development of mechanisms and applications of systems that perceive, reason, learn, and act. A discipline encompassing computer science, cognitive science, mathematics, and engineering focused on creating intelligent machines. - Authority Score: 0.92\n2. **EU AI Act (Article 3)**: The capability of systems to perform human-like tasks involving perception, reasoning, learning, decision-making, and problem-solving. - Authority Score: 0.90\n\n### Operational Characteristics\n- **Perception**: Ability to interpret sensory or virtual environment data through sensors, cameras, microphones, or data feeds\n- **Abstraction**: Process of creating models, patterns, or representations from raw input data\n- **Inference**: Use of models to generate predictions, recommendations, or decisions\n- **Learning**: Capability to improve performance through experience with data\n- **Autonomy**: Degree of independence from human intervention in operation\n\n\n# Artificial Intelligence Ontology Entry – Updated 2025\n\n## Academic Context\n\n- Artificial intelligence represents the simulation of human cognitive functions in computational systems\n  - Encompasses machine learning, deep learning, and natural language processing as primary subfields\n  - Emerged as a formal discipline over 70 years ago, with contemporary focus on generative AI capabilities\n  - Defined by NASA and the US National Defense Authorization Act as systems performing tasks under varying circumstances without significant human oversight, or capable of learning from experience\n  - Increasingly recognised as foundational technology comparable to electricity or the internet in transformative potential\n\n- Core capabilities and scope\n  - Perception, reasoning, learning, problem-solving, decision-making, and creative generation\n  - Ability to process vast datasets and identify complex patterns autonomously\n  - Performance improvement through exposure to data without explicit reprogramming\n  - Simulation of human-like cognition through neural networks and algorithmic systems\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Generative AI dominates contemporary research and commercial development, enabling creation of original text, images, video, and multimedia content\n  - Machine learning remains the most prevalent operational form of AI across industries\n  - Applications span virtual assistants, image recognition, autonomous vehicles, medical diagnostics, and real-time customer support systems\n  - Concentration of cutting-edge model development among select large technology companies due to substantial hardware costs and data requirements\n  - 2024 Nobel Prizes awarded for physics and chemistry work intimately related to AI applications\n\n- Technical capabilities and current limitations\n  - Models may generate inaccurate or biased outcomes, particularly with insufficient high-quality training data\n  - Data quality and quantity remain critical determinants of system performance\n  - Computational requirements for training leading models remain prohibitively expensive for most organisations\n  - Three primary machine learning categories: supervised learning (pattern recognition from labelled data), unsupervised learning (pattern discovery from unlabelled data), and reinforcement learning (reward optimisation through environmental interaction)\n\n- UK and North England context\n  - UK institutions increasingly prominent in AI research and development, though hardware infrastructure concentration remains limited\n  - Manchester, Leeds, and Newcastle emerging as regional technology hubs with growing AI research capacity\n  - British academic institutions contributing to foundational AI research, though resource constraints limit large-scale model development compared to US counterparts\n\n## Research & Literature\n\n- Foundational definitions and frameworks\n  - NASA (2024). *What is Artificial Intelligence?* Executive Order 13960 definition framework, incorporating Section 238(g) of the National Defense Authorization Act of 2019\n  - Stanford Emerging Technology Review (2025). *Artificial Intelligence*. Comprehensive overview of computer vision, machine learning, and natural language processing subfields\n  - IBM (2024). *What Is Artificial Intelligence (AI)?* Nested conceptual framework spanning 70+ years of disciplinary development\n\n- Technical subfields and methodologies\n  - Deep learning: multilayered neural networks enabling autonomous feature extraction from complex datasets\n  - Natural language processing: computational systems for understanding, interpreting, and generating human language\n  - Computer vision: machine recognition and interpretation of visual information with decision-making capabilities\n  - Decision support systems: tools for evaluating multiple outcomes and probabilities under conditions of imperfect or unknown information\n\n- Contemporary research directions\n  - Generative AI capabilities and limitations\n  - Data quality and bias mitigation in model training\n  - Computational efficiency and accessibility of model development\n  - Integration of AI into sustainable design and resource optimisation\n\n## UK Context\n\n- British research contributions\n  - UK universities conducting significant foundational research in machine learning and neural network architectures\n  - Growing emphasis on responsible AI development and ethical frameworks within British academic institutions\n  - Limited but expanding commercial AI development sector outside London's established tech corridor\n\n- North England innovation landscape\n  - Manchester: emerging AI research clusters within university computer science departments and technology startups\n  - Leeds: growing digital innovation sector with increasing AI applications in healthcare and manufacturing\n  - Newcastle: developing technology hub with research focus on applied AI systems\n  - Regional challenge: concentration of venture capital and hardware infrastructure remains heavily weighted toward London and South East\n\n- Practical applications in UK context\n  - NHS utilising AI for diagnostic support and resource optimisation\n  - Financial services sector (particularly in Manchester and Leeds) adopting machine learning for risk assessment and fraud detection\n  - Manufacturing sector exploring AI-driven process optimisation, particularly relevant to North England's industrial heritage\n\n## Future Directions\n\n- Emerging technical developments\n  - Advancement toward more efficient, smaller-scale models reducing computational barriers to entry\n  - Enhanced interpretability and explainability of AI decision-making processes\n  - Integration of multimodal AI systems combining text, image, video, and sensor data\n  - Potential progression toward Artificial General Intelligence (AGI), though timeline and feasibility remain contested\n\n- Anticipated challenges\n  - Bias and accuracy concerns in models trained on insufficient or unrepresentative data\n  - Concentration of AI development capability among limited number of well-resourced organisations\n  - Regulatory frameworks and governance structures still developing across jurisdictions\n  - Skills gap in AI literacy and technical expertise across sectors and regions\n\n- Research priorities\n  - Data quality standards and curation methodologies\n  - Computational efficiency and democratisation of model development\n  - Ethical frameworks and responsible AI deployment\n  - Regional capacity building, particularly in underrepresented areas such as North England\n  - Integration of AI with circular economy and sustainable design principles\n\n---\n\n**Technical note:** This entry reflects the state of AI development as of November 2025. The field evolves rapidly; readers should consult current academic journals and institutional repositories for developments beyond this date. The concentration of AI capability remains a significant structural feature of the contemporary landscape—rather like observing that most of the electricity generation capacity remains in the hands of a few large utilities, albeit with increasingly distributed alternatives emerging.\n\n\n## Metadata\n\n- **Last Updated**: 2025-11-11\n- **Review Status**: Comprehensive editorial review\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable\n\n## Related Content: AI Companies\n\npublic:: true\n\n\t- **Majors**\n\t- There are several very strong [[Large language models]] Gemini, Claude, and ChatGPT, Llama, and Grok\n\t- [[Comparison of GPT4 and Gemini Ultra]]\n\t- [[OpenAI]]\n\t- OpenAI has been at the forefront of AI development, with significant advancements in 2024 and 2025.\n\t- ### Models\n\t\t- **[GPT-5](https://yourgpt.ai/gpt-5)**: Expected in summer 2025, with enhanced reasoning and reliability.\n\t\t- **Reasoning Models (o1, o3, o4-mini, o3-pro):** A new series of models designed for complex, analytical tasks.\n\t\t- **[Sora](https://openai.com/sora):** A text-to-video model that can generate high-resolution videos from text prompts.\n\t- ### Future Plans\n\t\t- **AGI and Agents:** OpenAI plans to launch Artificial General Intelligence (AGI) and Agents in 2025.\n\t\t- **Hardware:** The acquisition of [io](https://www.bleepingcomputer.com/news/technology/jony-ives-ai-hardware-startup-reportedly-in-talks-with-openai/) suggests a move into AI hardware.\n\t- ### Business and Infrastructure\n\t\t- **[The Stargate Project](https://en.wikipedia.org/wiki/Stargate_(supercomputer))**: A $500 billion joint venture to build an AI infrastructure system.\n\t\t- **[ChatGPT Gov](https://ai-supremacy.com/chatgpt-gov/):** A version of ChatGPT for U.S. government agencies.\n- \n- [[Comparison of GPT4 and Gemini Ultra]]\n- Google\n\t- Google has been aggressively advancing its AI capabilities in 2024 and 2025, with a focus on its Gemini models and deeper product integration.\n\t- ### Models\n\t\t- **[Gemini 2.0 and 2.5](https://blog.google/technology/ai/google-gemini-update-flash-pro-1-5-io-2024/)**: These models feature enhanced performance, multimodality, and larger context windows.\n\t\t- **[Veo, Imagen, and Lyria](https://blog.google/technology/ai/google-io-2024-new-generative-media-models-veo-imagen-3-lyria/)**: A suite of generative media models for creating video, images, and music.\n\t- ### Products and Services\n\t\t- **[AI Overviews in Search](https://blog.google/products/search/generative-ai-search-overviews/)**: AI-generated summaries at the top of search results.\n\t\t- **[Google AI Studio](https://aistudio.google.com/)**: A platform for building with Gemini models.\n\t\t- **[Jules](https://blog.google/technology/developers/google-io-2024-developer-news-updates/)**: An AI-powered coding assistant.\n\t\t- **[Gemini in Workspace](https://yourstory.com/2024/04/google-workspace-gets-new-ai-features-vids-app)**: Integration of Gemini into Gmail, Docs, Sheets, and other applications.\n\t- ### Future Plans\n\t\t- **[Project Astra](https://deepmind.google/technologies/gemini/project-astra/)**: A prototype for a universal AI assistant.\n\t\t- **[Android XR](https://yourstory.com/2024/04/google-workspace-gets-new-ai-features-vids-app)**: Gemini is coming to glasses and headsets.\n- Mistral\n\t- French company, and the only major player in Europe. [[Politics, Law, Privacy]] seem to be shaping around a bet on their success. They currently have 2 models which are unconstrained by guardrails and very high quality. They have a larger model accessible through API and their prices are very low.\n- Inflection\n\t- [Inflection](https://inflection.ai/)\n\t- Pi is the best of the \"conversational AI\" interfaces.\n- Waymo\n\t- Leading in autonomous driving technology, using AI to improve safety and efficiency.\n- IBM\n\t- Watson\n\t- A trailblazer in AI for business, offering solutions across various sectors.\n- Data Analysis\n\t- Utilizing AI to transform big data into actionable insights.\n\t- Natural Language Understanding\n\t- Enhancing machine's understanding of human language nuances.\n- Microsoft\n\t- Microsoft has been heavily focused on developing and integrating AI agents across its product ecosystem in 2024 and 2025.\n\t- ### Agents and Copilot\n\t\t- **[Copilot Actions](https://www.softwareone.com/en/blog/articles/2024/05/22/microsoft-build-2024-ai-agents-and-the-open-agentic-web)**: Allows users to automate routine tasks with simple prompts.\n\t\t- **[Azure AI Foundry Agent Service](https://www.microsoft.com/en-us/research/blog/the-open-agentic-web/)**: Provides tools for orchestrating multiple specialized agents.\n\t\t- **[Microsoft 365 Copilot](https://www.directionsonmicrosoft.com/blog/2024/05/22/microsoft-365-copilot-becoming-showcase-agents)**: The Copilot app is being revamped to become a showcase for agents, with a new image generator and deeper integration with Microsoft Search.\n\t- ### AI Integration\n\t\t- **[Azure AI](https://supersimple365.com/azure-ai-updates-from-microsoft-build-2024/)**: The Azure AI Foundry has been expanded to include over 1,900 models.\n\t\t- **[Dynamics 365](https://msdynamicsworld.com/story/new-microsoft-dynamics-365-and-power-platform-features-2024-release-wave-1-plan)**: AI-powered assistance in Sales, Customer Service, and Finance.\n\t\t- **[Microsoft 365](https://www.syskit.com/blog/microsoft-365-new-features-2024/)**: New AI-powered features in SharePoint, Outlook, and PowerPoint.\n\t- ### Research\n\t\t- **[Phi-3 and Phi-4](https://msdynamicsworld.com/story/new-microsoft-dynamics-365-and-power-platform-features-2024-release-wave-1-plan)**: Powerful language models compact enough to run on a smartphone.\n- Amazon\n\t- Amazon is making a significant push in AI with its new \"Nova\" models, a revamped \"Alexa Plus,\" and next-generation AI chips.\n\t- ### Models\n\t\t- **[Amazon Nova](https://aboutamazon.com/news/aws/amazon-nova-foundation-models)**: A new family of foundation models, including \"Micro,\" \"Lite,\" \"Pro,\" \"Premier,\" \"Canvas,\" and \"Reel.\"\n\t- ### Products and Services\n\t\t- **[Alexa Plus](https://www.newsweek.com/amazon-alexa-plus-generative-ai-subscription-1852840)**: A subscription-based, AI-powered version of Alexa, expected in early 2025.\n\t\t- **[Amazon Bedrock](https://aws.amazon.com/bedrock/)**: A fully managed service for building and scaling generative AI applications.\n\t- ### Hardware\n\t\t- **[Trainium3](https://siliconangle.com/2024/12/04/aws-unveils-next-generation-ai-chips-trainium3-graviton5/)**: Amazon's next-generation AI training chip, expected in late 2025.\n- Meta\n\t- Meta has made significant advancements in AI in 2024 and 2025, with a focus on new hardware, advanced AI models, and enhanced user experiences.\n\t- ### Hardware\n\t\t- **[Meta Quest 3S](https://www.linezero.com/blog/meta-connect-2024-new-headsets-ai-and-the-future-of-work)**: A more affordable mixed reality headset.\n\t\t- **[Orion](https://www.linezero.com/blog/meta-connect-2024-new-headsets-ai-and-the-future-of-work)**: Meta's first true augmented reality glasses.\n\t- ### Models\n\t\t- **[Llama 3.1, 3.2, and 4](https://yourstory.com/2025/02/meta-ai-llama-4-series-open-source-models)**: A series of powerful, open-source large language models.\n\t- ### Products and Services\n\t\t- **[Standalone Meta AI app](https://www.vktr.com/insights/meta-ai-app-launch-llama-4)**: A personalized and conversational AI assistant.\n\t\t- **AI-powered features:** AI-generated content, voice, photo editing, and translation are being integrated into Facebook, Instagram, WhatsApp, and Messenger.\n\t- ### Research\n\t\t- **[Open Molecules 2025](https://www.semafor.com/news/2025/05/21/meta-releases-huge-data-set-to-spur-ai-drug-discovery)**: A massive dataset of chemical simulations to train AI models for scientific research.\n- Tesla\n\t- Autopilot\n\t- Innovating with AI for advanced driver-assistance systems.\n\t- Self-Driving Cars\n\t- Pioneering autonomous vehicle technology with sophisticated AI algorithms.\n\t- Grok (LLM)\n\t\t- A witty and satirical AI chatbot that pulls in real-time information, Grok signifies Tesla's expansion into AI-driven communication.\n- NVIDIA\n\t- AI Hardware\n\t- Designing cutting-edge GPUs and systems to power AI computing.\n\t- GPUs\n\t- Accelerating AI with powerful graphics processing units.\n\t- Data Centers\n\t- Building AI-[[Infrastructure]] to support the increasing demands of machine learning workloads.\n\t- Autonomous Vehicles\n\t- Contributing to the AI ecosystem with technology for self-driving vehicles.\n\t- Salesforce\n\t- CRM with Predictive Analytics\n\t- Integrating AI to anticipate customer needs and enhance engagement.\n\t- Chatbots\n\t- Improving customer service with AI-powered chatbots.\n\t- Marketing Automation\n\t- Leveraging AI to automate and personalize marketing campaigns.\n- Adobe\n\t- Creative Software with AI\n\t- Infusing AI into creative software to augment the design process.\n\t- Photoshop\n\t\t- Using AI to streamline complex editing tasks with intuitive tools.\n\t- Illustrator\n\t\t- AI assists in creating vector graphics with precision and ease.\n- **Notable Minors**\n\t- Channel 1\n\t\t- AI News with translation of footage {{tweet https://twitter.com/channel1_ai/status/1734591810033373231}}\n-\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Metaverse platforms continue to evolve with focus on interoperability and open standards\n  - Web3 integration accelerating with decentralised identity and asset ownership\n  - Enterprise adoption growing in virtual collaboration, training, and digital twins\n  - UK companies increasingly active in metaverse development and immersive technologies\n\n- Technical capabilities\n  - Real-time rendering at photorealistic quality levels\n  - Low-latency networking enabling seamless multi-user experiences\n  - AI-driven content generation and procedural world building\n  - Spatial audio and haptics enhancing immersion\n\n- UK and North England context\n  - Manchester: Digital Innovation Factory supports metaverse startups and research\n  - Leeds: Holovis leads in immersive experiences for entertainment and training\n  - Newcastle: University research in spatial computing and interactive systems\n  - Sheffield: Advanced manufacturing using digital twin technology\n\n- Standards and frameworks\n  - Metaverse Standards Forum driving interoperability protocols\n  - WebXR enabling browser-based immersive experiences\n  - glTF and USD for 3D asset interchange\n  - Open Metaverse Interoperability Group defining cross-platform standards\n\n## Metadata\n\n- **Last Updated**: 2025-11-16\n- **Review Status**: Automated remediation with 2025 context\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable\n\n## Related Content: AI Liability\n\n# **Algorithmic Accountability: A Comparative Analysis of AI Liability Frameworks in the United States and United Kingdom**\n\n- ## OntologyBlock\n\t- termID: AI-LAW-0001\n\t- category: [[Legal Framework]]\n\t- domain: [[AI Governance]]\n\t- relatedTerms: [[AI Risks]], [[Product Liability]], [[Tort Law]], [[Negligence]], [[Strict Liability]], [[AI Regulation]], [[Legal Accountability]]\n\t- jurisdiction: [[United States]], [[United Kingdom]]\n\t- yearAnalyzed: 2025\n\t- keyTopics: [[AI Liability]], [[Frontier AI]], [[Abnormally Dangerous Activity]], [[Vicarious Liability]], [[Punitive Damages]], [[Insurance]], [[Open-Source AI]]\n\n- ### **Introduction**\n- This report addresses one of the most pressing legal and societal challenges of the 21st century: how to assign responsibility when autonomous and opaque [[Artificial Intelligence]] ([[AI]]) systems cause harm. As AI transitions from a theoretical concept to a pervasive technology embedded in critical sectors, it strains the very foundations of [[Tort Law]], which for centuries has been built around human action and [[foreseeability]]. The unique characteristics of AI—its capacity for [[autonomous decision-making]], its often-impenetrable \"[[black box]]\" nature, and its potential for [[emergent behaviors]] unforeseen by its creators—present a formidable challenge to legal systems on both sides of the Atlantic. This analysis will provide a comprehensive, comparative examination of the [[liability frameworks]] in the [[United States]] and the [[United Kingdom]], tracing their evolution and assessing their fitness for the age of AI.\n- We will begin by deconstructing the foundational principles of [[Negligence]] and [[Strict Liability]] in both jurisdictions, establishing the bedrock [[legal doctrines]] that form the basis for any discussion of [[AI Liability]]. We will then trace the difficult legal journey of classifying software as a \"[[product]]\" or a \"[[service]],\" a crucial precursor to the AI liability debate that has defined [[technology law]] for decades. The core of the report will analyze how the unique characteristics of AI challenge these traditional doctrines, forcing courts and legislators to consider novel applications of established principles, from [[Vicarious Liability]] for AI \"agents\" to the radical proposition of treating [[Frontier AI]] development as an [[Abnormally Dangerous Activity]].\n- Finally, we will explore the divergent [[governance responses]] in the US and UK. In the United States, a fragmented but dynamic landscape is emerging, characterized by ambitious state-level legislative experiments and a federal agenda driven by [[geopolitical competition]]. In contrast, the United Kingdom has pursued a centralized, [[principles-based regulatory framework]] that prioritizes flexibility but faces growing calls for statutory intervention. We will delve into cutting-edge theoretical proposals designed to manage the [[catastrophic risks]] posed by [[Frontier AI]], including novel applications of [[Punitive Damages]] and the essential role of [[insurance]] as a quasi-regulatory mechanism. The objective of this report is to provide policymakers, legal practitioners, and technology leaders with a nuanced and detailed map of the current liability landscape and the likely paths of its future evolution, offering a clear-eyed assessment of the legal architecture required for an era of [[algorithmic accountability]].\n\n- ## **Part I: Foundations of Liability Law - A Transatlantic Overview**\n\n  To comprehend the legal challenges posed by [[Artificial Intelligence]], it is essential to first understand the foundational doctrines of [[Tort Law]] upon which any [[AI Liability]] regime will be built. In both the [[United States]] and the [[United Kingdom]], the legal frameworks for assigning responsibility for harm have evolved over centuries, primarily through the [[common law]] doctrines of [[Negligence]] and [[Strict Liability]]. These principles, developed in response to the physical and industrial risks of their time, now provide the essential toolkit for addressing the novel digital risks of the 21st century. This section establishes these bedrock legal principles, highlighting their historical development, core elements, and the key transatlantic divergences that will prove critical in the context of AI.\n\n- ### **1.1 The American Framework: Negligence and Strict Liability**\n\n  The American law of torts provides a dual system for assigning liability. The default regime is [[Negligence]], which requires a plaintiff to prove that the defendant acted with a lack of [[reasonable care]]. In specific, circumscribed situations involving heightened risk, however, the law imposes [[Strict Liability]], a [[no-fault standard]] that holds a party responsible for harm regardless of the level of care they exercised. The tension between these two paradigms has shaped liability law for over 150 years and provides the direct intellectual framework for the modern debate over AI.\n\n- #### **1.1.1 The Evolution of Negligence: From Brown v. Kendall to the Modern Four-Element Test**\n\n  After centuries of slow development within the English [[forms of action]], [[negligence law]] in the United States began to coalesce into a general theory of liability for carelessly caused harm during the 1830s and 1840s (see Hofstra Law's historical analysis of negligence evolution at https://scholarlycommons.law.hofstra.edu/cgi/viewcontent.cgi?article=2282&context=hlr). The 1850 decision of Chief Judge Shaw in [[Brown v. Kendall]] is widely regarded as a pivotal moment, marking the emergence of negligence as a distinct tort. The case, which involved a man accidentally striking another in the eye with a stick while trying to separate fighting dogs, established the core principle that liability should be based on a failure to exercise [[ordinary care]], moving away from older, stricter forms of liability like [[trespass]]. The essence of this new tort was that a person should be subject to liability for carelessly causing harm to another, provided there was a causal connection between the defendant's conduct and the plaintiff's injury that was \"natural, probable, proximate, and not too remote\".\n\n  As courts and legal commentators continued to explore this developing tort, they began to dissect it into its essential components. Over time, a consensus formed around a standard set of elements that a plaintiff must prove to succeed in a [[negligence claim]]. While the precise formulation can vary by jurisdiction, the most conventional modern iteration of negligence contains four core elements: **(1) a [[duty of care]]** owed by the defendant to the plaintiff; **(2) a [[breach of duty]]** by the defendant; **(3) [[causation]]**, which itself comprises two parts—[[actual cause]] (or [[cause-in-fact]]) and [[proximate cause]] (or [[legal cause]]); and **(4) actual [[loss or damage]]** suffered by the plaintiff. This four-part structure is affirmed in countless state court decisions across the country, from [[Winn v. Posades]] in Connecticut to [[Farabaugh v. Pa. Turnpike Comm'n]] in Pennsylvania, demonstrating its pervasive influence in American jurisprudence. Some jurisdictions, such as Louisiana and Tennessee, have adopted a five-element test, explicitly separating cause-in-fact and legal cause into distinct elements to provide greater analytical clarity.\n\n  This foundational framework has been shaped and refined by a series of landmark cases. The 1928 decision in [[Palsgraf v. Long Island Railroad]], with Judge Cardozo's majority opinion, established the critical concept of [[foreseeability]] as a limit on the scope of duty (classic case analysis available at https://lawlibrarycollections.umn.edu/classic-cases-tort). In [[Palsgraf v. Long Island Railroad]], a man carrying a package of fireworks was pushed by railroad guards onto a moving train, causing the package to fall and explode. The shockwave from the explosion toppled scales at the other end of the platform, injuring Mrs. Palsgraf. The court held that the railroad was not liable because Mrs. Palsgraf was an [[unforeseeable plaintiff]]; the guards could not have reasonably foreseen that their actions would result in harm to someone so far away. This established the rule that a [[duty of care]] is owed only to those who are within the \"[[zone of foreseeable danger]]\".\n\n  Other cases have cemented additional key principles. [[Martin v. Herzog]] (1920) articulated the doctrine of [[negligence per se]], which holds that the violation of a statute designed to protect against a certain type of harm constitutes a breach of the duty of care in itself. If a law exists to prevent a specific injury, and a defendant violates that law, causing that very injury, then negligence is presumed. Furthermore, the \"[[eggshell skull rule]]\", famously associated with [[Vosburg v. Putney]] (1891), dictates that a defendant must take their victim as they find them. Under this doctrine, a tortfeasor is liable for all damages resulting from their wrongful act, even if the victim suffers a disproportionately severe injury due to a pre-existing vulnerability or unusual susceptibility.\n\n- #### **1.1.2 Strict Liability for Products: The Impact of Restatement (Second) of Torts § 402A**\n\n  In a significant departure from the fault-based principles of negligence, American law developed the doctrine of [[Strict Product Liability]] to address the unique dangers posed by mass-produced goods in an industrial economy. This doctrine is most powerfully articulated in the highly influential [[Restatement (Second) of Torts § 402A]] (full text and analysis at https://biotech.law.lsu.edu/cases/products/402a-b.htm). Published by the [[American Law Institute]] in 1965, this section provides that \"one who sells any product in a [[defective condition]] unreasonably dangerous to the user or consumer or to his property is subject to liability for physical harm thereby caused\".\n\n  This principle of [[Strict Liability]] represents a profound policy shift. It applies even if \"the seller has exercised all possible care in the preparation and sale of his product\" and even if the injured consumer has no direct contractual relationship ([[privity]]) with the manufacturer. The focus is not on the *conduct* of the seller, but on the *condition* of the product itself (see Fiveable's legal explanation at https://fiveable.me/key-terms/torts/restatement-second-of-torts-%C2%A7-402a). The rationale was to protect consumers who were often in no position to prove a specific act of negligence by a remote manufacturer in a complex production chain. By placing the burden of loss on the manufacturers and sellers who profit from placing products into the [[stream of commerce]], the law aims to incentivize the creation of safer products and ensure that the costs of injuries are borne by those best able to prevent them or spread the cost through insurance and pricing. This doctrine applies when a product is defective in its [[manufacturing]], its [[design]], or its [[warnings]], and it has become a cornerstone of [[consumer protection law]] in the United States.\n\n- #### **1.1.3 Strict Liability for Abnormally Dangerous Activities: From Rylands v. Fletcher to Modern Applications**\n\n  A second, distinct branch of [[Strict Liability]] in US law applies not to products, but to certain types of activities deemed so hazardous that they cannot be made safe even with the exercise of utmost care. This is the doctrine of strict liability for an \"[[Abnormally Dangerous Activity]],\" sometimes referred to as an \"[[ultrahazardous activity]]\" (Cornell Law's definition at https://www.law.cornell.edu/wex/abnormally_dangerous_activity). An activity qualifies as abnormally dangerous if it is \"not of common usage\" and creates a foreseeable and \"very significant risk of physical harm\" that cannot be eliminated by [[reasonable care]].\n\n  The historical origin of this doctrine is universally traced to the 1868 English House of Lords case, [[Rylands v. Fletcher]]. In that case, a mill owner had a reservoir built on his land, which, due to undiscovered abandoned mine shafts, flooded a neighboring coal mine. The court held the mill owner liable, establishing the principle that \"a person who for his own purposes brings on his lands and collects and keeps there anything likely to do mischief if it escapes, must keep it in at his peril\". American courts adopted this rule but modified it, removing the requirement that the activity take place on the defendant's land and instead focusing on the broader concept of whether the activity is one of \"[[common usage]]\".\n\n  In determining whether an activity is abnormally dangerous, courts typically weigh a set of factors outlined in the [[Restatement of Torts]] (detailed factors at https://www.law.cornell.edu/wex/ultrahazardous_activity). These include: the existence of a high degree of risk of some harm; the likelihood that the harm that results will be great; the inability to eliminate the risk by the exercise of reasonable care; the extent to which the activity is not a matter of common usage; the inappropriateness of the activity to the place where it is carried on; and the extent to which its value to the community is outweighed by its dangerous attributes.\n\n  Classic examples of abnormally dangerous activities include [[blasting with explosives]], storing large quantities of [[toxic chemicals]], and [[fumigation]] with poisonous gases. Conversely, activities that are dangerous but are widely engaged in by the public, such as driving an automobile, are considered matters of \"common usage\" and are therefore governed by the law of negligence, not strict liability. The rationale for this distinction rests on a principle of [[reciprocity]]: where many people in a community impose a risk on each other for a shared benefit (like driving), negligence is sufficient. However, when one party engages in an unusual activity that imposes a [[non-reciprocal risk]] on others who do not benefit, strict liability is justified to ensure the actor internalizes the full social cost of their hazardous enterprise.\n\n  The existing legal architecture in the United States, therefore, already contains a fundamental and long-standing tension between [[fault-based liability]] (negligence) and [[no-fault liability]] (strict liability). This is not a new conflict but one that has evolved over more than a century and a half to address the escalating risks of the industrial and post-industrial age. The development of these doctrines was not arbitrary; it was a direct response to specific societal problems. Negligence, the default rule, requires a plaintiff to undertake the often difficult, costly, and uncertain task of proving fault—a specific breach of a duty of care. Recognizing the near impossibility of this task for consumers injured by mass-produced goods from remote manufacturers, the courts and the American Law Institute developed the doctrine of [[Strict Product Liability]] as codified in [[Restatement (Second) of Torts § 402A]]. This shifted the legal inquiry from the manufacturer's conduct to the product's condition. In parallel, for activities so inherently perilous that no amount of care could render them safe, such as blasting or handling explosives, the courts adapted the rule from [[Rylands v. Fletcher]] to create strict liability for abnormally dangerous activities. This historical evolution provides the direct intellectual toolkit for the contemporary [[AI Liability]] debate. The central question facing legal systems today is not whether to invent an entirely new system of liability from scratch, but rather to determine which of these existing, well-established frameworks—or a hybrid thereof—is the most appropriate fit for the unique risks posed by [[artificial intelligence]]. The debate over whether to treat [[AI development]] and deployment under the rules of negligence, product liability, or as an abnormally dangerous activity is simply the next chapter in this long-running doctrinal story of adapting law to technology.\n\n- ### **1.2 The English Framework: Common Law and Statutory Intervention**\n\n  The English legal system, as the progenitor of the [[common law]] tradition, provides the historical foundation for many of the principles found in US law. However, it has evolved along its own distinct path, particularly in the interplay between judge-made common law and statutory regimes mandated by its former membership in the [[European Union]]. Like its American counterpart, the English framework for liability is built on the twin pillars of [[Negligence]] and [[Strict Liability]], but with crucial differences in their scope and application.\n\n- #### **1.2.1 The Neighbour Principle: The Enduring Legacy of Donoghue v. Stevenson**\n\n  The modern law of [[Negligence]] in the [[United Kingdom]], and indeed across much of the common law world, owes its existence to the seminal 1932 House of Lords decision in [[Donoghue v. Stevenson]] (UK case law overview at https://professionalnegligenceclaimsolicitors.co.uk/landmark-famous-uk-tort-cases-advice/). This case, famously known as the \"[[snail in the bottle]]\" case, involved Mrs. May Donoghue, who fell ill after her friend purchased a bottle of ginger beer for her at a café in Paisley, Scotland (full case text at https://www.scienzegiuridiche.uniroma1.it/sites/default/files/docenti/alpa/Donoghue_Stevenson.pdf). After drinking some of it, the decomposed remains of a snail were discovered in the opaque bottle. Because her friend had bought the drink, Mrs. Donoghue had no direct contract with the café owner, and certainly not with Mr. Stevenson, the manufacturer of the ginger beer. This lack of a contractual relationship, or \"[[privity]],\" was a significant barrier to recovery under the law at the time, forcing her to bring a claim in negligence.\n\n  The House of Lords, in a landmark 3-2 decision, found in her favor. In his leading judgment, Lord Atkin articulated what has become known as the \"[[neighbour principle]],\" a foundational concept of the [[duty of care]]. Drawing on a biblical parable, he posed the lawyer's question, \"Who is my neighbour?\" and provided a restricted legal reply: \"You must take reasonable care to avoid acts or omissions which you can reasonably foresee would be likely to injure your neighbour. Who, then, in law is my neighbour? The answer seems to be—persons who are so closely and directly affected by my act that I ought reasonably to have them in contemplation as being so affected when I am directing my mind to the acts or omissions which are called in question\". This principle established, for the first time, a general duty of care owed by a manufacturer to the ultimate consumer of their product, regardless of any contractual relationship (Wikipedia analysis at https://en.wikipedia.org/wiki/Donoghue_v_Stevenson). It fundamentally moved the basis of liability from strict categories based on contract to a fault-based system requiring only foreseeable injury.\n\n  In the decades following [[Donoghue v. Stevenson]], English courts have continued to refine the test for establishing a [[duty of care]]. The modern approach is most famously encapsulated in the case of [[Caparo Industries plc v. Dickman]]. In [[Caparo v. Dickman]], the House of Lords established a three-part incremental test to determine the existence of a duty of care: (1) was the harm reasonably [[foreseeable]]? (2) was there a relationship of [[proximity]] between the claimant and the defendant? and (3) is it \"[[fair, just and reasonable]]\" to impose a duty of care?. The concept of proximity, in particular, has become a key battleground in many negligence claims. Overall, the English framework for negligence, much like the American system, is structured around the core elements of a **Duty of Care**, a **Breach** of that duty, **Causation** linking the breach to the harm, and resulting **Damage or Loss** (causation principles explored at https://www.ukhealthcarelawblog.co.uk/causation-in-clinical-negligence-cases-can-there-be-liability-where-the-same-injury-would-probably-have-happened-anyway/), with a vast body of case law providing detailed interpretation of each component.\n\n- #### **1.2.2 Statutory Product Liability: The [[Consumer Protection Act 1987]] and its EU Origins**\n\n  Running parallel to the [[common law]] of [[Negligence]], the United Kingdom has a statutory regime of [[Strict Liability]] for defective products, established by the [[Consumer Protection Act 1987]] (CPA) (Wikipedia overview at https://en.wikipedia.org/wiki/Consumer_Protection_Act_1987). This Act is not a product of pure common law development; rather, it was enacted to implement the European Community's 1985 [[Product Liability Directive]] (85/374/EEC) into domestic law. This origin is significant, as it means the UK's statutory product liability framework is harmonized with that of the [[European Union]].\n\n  The CPA imposes civil liability in tort on the \"[[producer]]\" of a product for damage caused wholly or partly by a defect in that product. This includes manufacturers, \"[[own-branders]]\" who put their name on a product, and importers of products into the EU/UK. A product is defined as \"[[defective]]\" under the Act if \"the safety of the product is not such as persons generally are entitled to expect\" (Which? consumer guide at https://www.which.co.uk/consumer-rights/regulation/consumer-protection-act-1987-a5xTL3w6L9OI). This is an [[objective standard]] based on [[public expectation]], taking into account all circumstances, including the product's marketing, instructions, warnings, and what might reasonably be expected to be done with it.\n\n  The liability imposed by the CPA is strict, meaning a claimant does not need to prove that the producer was negligent or at fault. If a product is defective and causes damage, the producer is automatically liable in most cases. However, unlike the purer form of strict liability seen in some US jurisdictions, the CPA provides a number of statutory defenses. The most significant and controversial of these is the so-called \"[[development risks defense]]\" or \"[[state of the art defense]]\", found in section 4(1)(e) of the Act. This defense allows a producer to escape liability if they can prove that \"the state of scientific and technical knowledge at the relevant time was not such that a producer of products of the same description as the product in question might be expected to have discovered the defect if it had existed in his products while they were under his control\".\n\n  A critical point of divergence between the American and British approaches to [[Strict Product Liability]] lies in this \"[[development risks defense]]\". The UK's [[Consumer Protection Act 1987]], by its very text, provides an explicit statutory escape hatch for manufacturers. A producer can argue that a defect was scientifically or technically unknowable at the time the product was supplied, effectively reintroducing an element of [[foreseeability]] into a supposedly strict liability regime. In contrast, the US [[Restatement (Second) of Torts § 402A]] contains no such explicit defense. While some US jurisdictions have, through case law, allowed arguments similar to a [[state-of-the-art defense]], particularly in [[design defect]] cases, the core principle of § 402A remains a purer form of strict liability that focuses on the product's condition and the danger it poses, irrespective of the manufacturer's knowledge or ability to discover the defect.\n\n  This seemingly technical distinction has profound and direct implications for the liability of [[AI systems]]. The \"[[black box]]\" nature of advanced AI means that harmful behaviors can emerge unexpectedly from complex interactions within the model. A developer of such a system in the United Kingdom could plausibly mount a powerful defense under the CPA, arguing that the emergent harmful capability was not foreseeable or discoverable given the \"state of the art\" in [[AI safety]] research at the time of deployment. This defense would be significantly more difficult to sustain under the stricter liability standard of § 402A as applied in many US states. Consequently, the UK may represent a more favorable legal environment for developers facing claims arising from novel and unanticipated [[AI failures]], a factor that could influence corporate risk assessment and even the international location of [[AI research and development]].\n\n- ## **Part II: Applying Traditional Torts to Code - The Case of Software Liability**\n\n  Before the legal world began grappling with the complexities of [[artificial intelligence]], it faced a precursor challenge that set the stage for the current debate: how to apply centuries-old liability laws, designed for a world of tangible objects, to the intangible world of [[computer software]]. The question of whether software constitutes a \"[[product]]\" or a \"[[service]]\" has been a central and fiercely contested issue in [[technology law]] for decades. The resolution of this conundrum is not merely an academic exercise; it determines which liability regime applies. This section examines this critical legal battleground, as the classification of software directly shapes how the law can and will approach the even more complex challenge of AI.\n\n- ### **2.1 The \"Product vs. Service\" Conundrum**\n\n  The legal distinction between a \"[[product]]\" and a \"[[service]]\" is paramount in [[liability law]]. If a court deems software to be a \"product,\" it can fall under the ambit of [[Strict Product Liability]] laws, such as the [[Restatement (Second) of Torts § 402A]] in the US or the [[Consumer Protection Act 1987]] in the UK. This would allow a plaintiff to hold a developer liable for harm caused by a defect without needing to prove fault or negligence (Stanford CS analysis at https://cs.stanford.edu/people/eroberts/cs181/projects/1995-96/liability-law/productserviceissue.html). Conversely, if software is classified as a \"service,\" liability is typically governed by the principles of [[Negligence]], requiring the plaintiff to undertake the more arduous task of proving that the developer breached a duty of [[reasonable care]].\n\n  This high-stakes determination has led courts to struggle with the classification of software, which does not fit neatly into traditional legal categories. In navigating this gray area, courts have analyzed several key factors to guide their decisions. One of the earliest and most persistent hurdles has been the issue of **[[tangibility]]**. Historically, a legal \"product\" was something tangible—an object that could be physically possessed. Software, being a set of intangible instructions, challenged this definition. While some early judicial opinions were hesitant, the dicta in some cases hinted that software should be considered a tangible product for legal purposes, particularly when distributed on physical media like a disk.\n\n  A more decisive factor has often been the **[[method of distribution]]**. A strong distinction emerged between [[mass-marketed software|mass-marketed]], [[off-the-shelf software]] and [[custom-designed software]] (Berkeley Technology Law Journal analysis at https://www.btlj.org/data/articles2015/vol5/5_1/5-berkeley-tech-l-j-0001-0028.pdf). The sale of standardized, mass-produced software to the general public was seen as analogous to the sale of any other consumer good, pushing courts to classify it as a product. In contrast, the creation of bespoke software tailored to the specific needs of a single client looked much more like the provision of a professional service, akin to an architect designing a building or a lawyer drafting a contract.\n\n  Further complicating matters are **[[hybrid transactions]]**, which are now the norm in the software industry. Many software contracts involve not just the delivery of code (a potential \"good\") but also significant ongoing services such as installation, customization, training, and technical support. In these mixed cases, US courts have often applied a \"[[predominant purpose test]]\" or \"[[essence of the agreement test]]\". They examine the transaction as a whole to determine whether the primary goal was the acquisition of a good or the procurement of a service. This can involve a detailed analysis of the contract's language and even its financial breakdown; for example, if the majority of the contract's value is allocated to labor and support, it points toward a service.\n\n- ### **2.2 The Emerging Consensus in the U.S.: Software as a Product**\n\n  While the \"product vs. service\" issue has not been uniformly resolved across all fifty states, a clear and accelerating trend has emerged in US courts: a growing willingness to classify software, particularly [[mass-market consumer applications]], as \"products\" for the purpose of [[Strict Liability]] claims (San Diego Law Review analysis at https://digital.sandiego.edu/sdlr/vol20/iss2/9/). This represents a significant evolution from earlier jurisprudence.\n\n  Early cases often leaned toward a service classification, especially for custom software. For instance, in [[RRX Industries v. Lab-Con, Inc.]], an Indiana court held that a contract for custom-written accounting software was a contract for services, emphasizing the vendor's active role in designing and developing a system for the client's specific needs. However, as software became less of a bespoke creation and more of a mass-distributed commodity, the legal reasoning began to shift.\n\n  More recent and high-profile litigation involving modern AI applications demonstrates this shift vividly. A landmark moment occurred in a 2025 federal court decision involving the AI chatbot application **[[Character.AI]]** (Morrison Foerster legal analysis at https://www.mofo.com/resources/insights/250618-software-gains-new-status-as-a-product-under-strict-liability-law). A mother sued the company under a [[Strict Liability]] [[design defect]] theory after her teenage son's suicide, alleging that the app's addictive design was an inherently dangerous and defective consumer product. [[Character.AI]] moved to dismiss the claim, deploying the classic argument that its chatbot was software, not a tangible good, and therefore not subject to strict product liability. The U.S. District Court for the Middle District of Florida rejected this argument. In its order, the court explained that the alleged harms—though resulting from interactions with the AI—were \"only possible because of the alleged design defects in the Character.A.I. app.\" The court concluded that, for the purposes of the plaintiff's claim, the app itself *is* a product, distinguishing between the ideas or expression *within* the app and the app's fundamental *design*.\n\n  This line of reasoning is being pursued in other major cases. In the [[multidistrict litigation]] against [[social media]] giants, plaintiffs are arguing that platform features like [[algorithmic content feeds]], \"[[like buttons]]\", and [[notifications]] are defectively designed \"products\" that cause [[addiction]] and [[mental health harms]] in children (American Bar Association analysis at https://www.americanbar.org/groups/litigation/resources/newsletters/mass-torts/have-algorithms-opened-your-software-product-liability/). While these cases face significant hurdles, including the formidable defense provided by [[Section 230]] of the [[Communications Decency Act]], the underlying legal theory that the software platform itself is a product is gaining judicial consideration. This trend is further supported by other state-level decisions, such as [[Brookes v. Lyft Inc.]] and [[Maynard v. Snapchat, Inc.]], where courts have also found that a software application can be treated as a product for liability purposes.\n\n- ### **2.3 The UK Position: Software Under the Consumer Protection Act**\n\n  The [[Consumer Protection Act 1987]] (CPA) in the [[United Kingdom]] provides a different, though ultimately converging, path to liability. The Act's definition of a \"[[product]]\" is broad, encompassing \"any goods or electricity\" and including products that are \"comprised in another product\". However, the application of this definition to standalone software has been a source of ambiguity.\n\n  Guidance on the CPA has traditionally suggested that while \"information and computer software\" on their own are *not* included, **[[embedded software]]** is considered part of the overall product's safety. For example, the software that controls the braking system in a [[smart car]] or the temperature in a [[smart thermostat]] is inextricably linked to the physical product's function and safety. Under this interpretation, a defect in the embedded software that causes harm would render the entire product defective under the CPA. This leaves a potential gap for [[standalone software]], such as a mobile app or a cloud-based service, which is not physically \"comprised in another product.\"\n\n  However, this ambiguity is being decisively resolved by legislative developments originating from the [[European Union]], which will undoubtedly influence future UK law and judicial interpretation, even post-[[Brexit]]. The EU's revised [[Product Liability Directive]] (PLD), which modernizes the original 1985 directive that the CPA implemented, explicitly clarifies that its scope extends to [[digital products]] (Norton Rose Fulbright analysis at https://www.nortonrosefulbright.com/en-gb/knowledge/publications/7052eff6/artificial-intelligence-and-liability). The revised PLD's definition of \"product\" expressly includes **software**, [[AI systems]], and even [[digital manufacturing files]] (like those for [[3D printing]]). This legislative clarification effectively erases the distinction between tangible goods and digital products, bringing the UK/EU legal framework into close alignment with the emerging judicial consensus in the United States. It signals a clear legislative intent to hold developers of all forms of software, including AI, to the standards of [[Product Liability]].\n\n  The historical legal distinction between [[embedded software]] (treated as part of a product) and [[standalone software]] (often treated as a service or an intangible good) is rapidly becoming untenable. This traditional line, drawn by frameworks like the UK's CPA, is collapsing under the weight of modern technological and economic realities. In the past, it was logical to see the software in a car's [[anti-lock braking system]] as part of the car, while viewing a standalone tax preparation program as something different. However, the rise of the [[app economy]] and [[cloud-based systems]] has changed this calculus.\n\n  US courts are now leading a judicial dismantling of this distinction. The ruling in the [[Character.AI]] case is a prime example, where a court treated a standalone mobile app as a product because its alleged design defects were the direct cause of harm. The \"product\" in this modern view is the app itself, a mass-distributed item in the [[stream of commerce]], not a physical object in which it is embedded. This judicial evolution is being mirrored by legislative action in Europe. The EU's new [[Product Liability Directive]] makes the shift explicit, formally defining software itself as a product subject to its liability rules (Hogan Lovells analysis at https://www.hoganlovells.com/en/publications/ai-liability-in-the-eu-and-uk-whats-the-current-state-of-play).\n\n  This convergence of US judicial trends and EU legislative action represents a monumental shift in [[technology law]]. It effectively dismantles the legal fiction that only tangible items can be \"products\" subject to [[Strict Liability]]. This change reflects the economic reality that software is a mass-produced and distributed good, just like any other consumer item. The direct consequence is a dramatic increase in the potential liability exposure for the entire software and AI industry. Developers of pure software and AI models, who may have previously operated under the assumption that they were shielded from strict liability and could only be sued for negligence, are now finding themselves squarely in the crosshairs of this stricter, [[no-fault liability]] regime.\n\n- ## **Part III: The Unique Challenge of Artificial Intelligence - Pushing the Boundaries of Liability**\n\n  While the legal battles over [[software liability]] provide a crucial foundation, [[artificial intelligence]] introduces challenges of a different order of magnitude. Advanced AI is not merely complex software; its defining characteristics of [[autonomy]], [[opacity]], and [[unpredictability]] create novel problems for every element of traditional [[tort analysis]]. These features strain the concepts of [[foreseeability]], [[breach of duty]], and [[causation]] to their breaking points, forcing legal systems to contemplate more radical applications of liability doctrine to ensure accountability.\n\n- ### **3.1 Beyond Traditional Software: Autonomy, Opacity, and Emergent Behavior**\n\n  The UK government's [[regulatory framework]], in seeking to define AI, focuses on two core characteristics that set it apart from conventional software: **[[adaptivity]] and [[autonomy]]** (Deloitte UK analysis at https://www.deloitte.com/uk/en/Industries/financial-services/blogs/the-uks-framework-for-ai-regulation.html). AI systems are designed to learn from data and alter their behavior to achieve goals, often in ways that have not been explicitly programmed or even foreseen by their human creators (UK government position on AI liability at https://www.artificiallawyer.com/2022/07/18/you-will-be-legally-liable-for-ai-outcomes-uk-government/). This capacity for **[[emergent behavior]]** is what makes AI so powerful, but it is also what makes it so legally problematic.\n\n  This leads directly to the **\"[[black box problem]]\"** (DLA Piper analysis on AI risk insurability at https://www.dlapiper.com/insights/publications/derisk-newsletter/2024/insuring-the-unpredictable-the-challenges-of-ai-risk-insurability). In many advanced AI systems, particularly those based on [[deep learning]] [[neural networks]], the decision-making process is so complex that it becomes [[opaque]], even to the developers who built the system. It can be impossible to trace the exact pathway of logic or the specific data points that led to a particular output or action (AI Frontiers case for AI liability at https://ai-frontiers.org/articles/case-for-ai-liability). This opacity creates a formidable, perhaps insurmountable, evidentiary burden for a plaintiff in a traditional negligence case. To prove a **[[breach of duty]]**, a plaintiff must show what the developer did wrong in the design or training process. To prove **[[causation]]**, they must draw a clear line from that specific error to the resulting harm. When the system's internal logic is unknowable, proving these elements becomes a matter of speculation.\n\n  In response to this challenge, legal scholars are exploring ways to adapt existing doctrines to sidestep the black box problem. One prominent proposal is to apply the doctrine of **[[Vicarious Liability]]** to AI systems that function as agents (Cornell Law definition at https://www.law.cornell.edu/wex/vicarious_liability). [[Vicarious Liability]], also known by the Latin maxim *[[respondeat superior]]* (\"let the master answer\"), is a form of strict liability that holds a principal (like an employer) legally responsible for the torts committed by their agent (like an employee) while acting within the [[scope of employment]] (EBSCO research on vicarious liability at https://www.ebsco.com/research-starters/social-sciences-and-humanities/vicarious-liability). The legal justification is that the principal controls the agent and benefits from their actions, and should therefore bear the costs of the risks they create.\n\n  The argument for applying this to AI is that as systems become more autonomous, they cease to be mere tools and begin to function as \"[[agents]]\" that act on behalf of a user, deployer, or developer to accomplish goals (Law-AI's law-following AI project at https://law-ai.org/law-following-ai/). A report from the [[Office of the Comptroller of the Currency]] notes this evolution in finance from AI as an \"[[input]]\" to a \"[[co-pilot]]\" and finally to an \"[[agent]]\" that executes trades autonomously (OCC speech on AI in finance at https://www.occ.gov/news-issuances/speeches/2024/pub-speech-2024-61.pdf). If an AI agent, in the course of performing tasks for its principal, commits an act that would be a tort if done by a human, this theory would hold the principal strictly liable. This approach has the significant advantage of circumventing the need to prove the principal's own negligence or to dissect the AI's internal decision-making process. The focus shifts from the AI's \"state of mind\" to the simple fact that the principal's agent caused the harm.\n\n- ### **3.2 Frontier AI as an \"Abnormally Dangerous Activity\"**\n\n  A more radical and far-reaching proposal, gaining traction in academic and policy circles, is to classify the very act of *developing* highly advanced, general-purpose AI—often termed \"[[Frontier AI]]\"—as an **[[Abnormally Dangerous Activity]]**. This would trigger [[Strict Liability]] for *any* foreseeable harm that results from the inherent nature of the activity, regardless of the level of care exercised by the developer.\n\n  The argument, powerfully articulated by legal scholars like [[Gabriel Weil]] of [[Touro University Law Center]] (faculty bio at https://www.tourolaw.edu/abouttourolaw/bio/399), is that the creation of these powerful and poorly understood intelligent systems squarely meets the established legal criteria for this doctrine (Touro Law Center faculty spotlight at https://www.tourolaw.edu/abouttourolaw/featured-content/376/spotlight). First, developing [[Frontier AI]] is not yet a \"[[common usage]]\"; it is an activity confined to a handful of highly capitalized technology firms. Second, it creates a high degree of risk of very great harm, from large-scale [[cyberattacks]] to the development of novel [[weapons]] or systemic [[economic disruption]] (RAND Corporation primer on AI damages at https://www.rand.org/content/dam/rand/pubs/research_reports/RRA3000/RRA3084-1/RAND_RRA3084-1.pdf). Third, and most critically, this risk cannot be eliminated by the exercise of [[reasonable care]], because the problem of \"[[AI alignment]]\"—ensuring an AI's goals remain aligned with human values—is an unsolved technical challenge. As Weil argues, treating frontier AI development like blasting with dynamite or keeping a pet tiger is a legally coherent application of existing principles (Noema Magazine essay at https://www.noemamag.com/your-ai-breaks-it-you-buy-it/).\n\n  This is not merely an academic theory; it is actively being considered as a policy solution. A bipartisan AI policy roadmap released by the U.S. Senate Majority Leader's office explicitly recommended that Congress should \"specify strict liability ('abnormally dangerous activity') for the development of the most advanced\" AI systems (Future of Life Institute analysis at https://futureoflife.org/document/vision-into-action-senate-ai-roadmap/). A comprehensive report from the RAND Corporation on liability for large-scale AI harms also extensively analyzes the application of this doctrine. Adopting this framework would represent a monumental policy decision. It would shift the entire legal and financial burden of risk onto the handful of companies developing these systems, forcing them to internalize the full potential social costs of their creations and creating a powerful incentive to invest in safety or slow down development until the risks are better understood.\n\n- ### **3.3 The Open-Source Dimension: Distributed Development and Diffused Liability**\n\n  The rapid proliferation of powerful [[open-source AI]] models, where the source code, model weights, or other key components are made publicly available, introduces a profound and complicating dimension to the liability puzzle (UK Parliament research brief on AI regulation at https://researchbriefings.files.parliament.uk/documents/LLN-2024-0016/LLN-2024-0016.pdf). While proponents champion open-source AI for fostering innovation, competition, and transparency, it creates a legal structure that is almost perfectly designed to diffuse and evade accountability.\n\n  The contractual reality of [[open-source software]] is stark. The vast majority of open-source AI models are released under permissive licenses, such as the [[MIT License]] or the [[Apache 2.0 License]]. A core feature of these licenses is a broad **disclaimer of all warranties and a severe limitation of liability** (Hunton Andrews Kurth analysis at https://www.hunton.com/insights/publications/open-source-ai-versus-proprietary-ai-models-key-differences-in-contract-terms-and-ip-risks-part-2). The legal text typically states that the software is provided \"[[as-is]],\" with no guarantee of fitness for any purpose and, crucially, no warranty of \"[[noninfringement]]\". This means they offer no [[indemnity]] or legal protection to the user against claims of [[intellectual property]] infringement or other harms caused by the model. This stands in sharp contrast to the world of [[proprietary AI]], where commercial users can often negotiate for some level of [[IP indemnification]] or other contractual protections from the provider.\n\n  This creates a significant and dangerous [[risk gap]]. A company that downloads and deploys an open-source model for a commercial purpose effectively assumes the entirety of the legal risk. They are exposed to potential lawsuits from third parties harmed by the model's output, with little to no legal recourse against the model's original creators or the community of contributors. This risk is magnified by the inherent vulnerabilities of the open-source ecosystem. These models are susceptible to unique [[cybersecurity threats]], such as \"[[data poisoning]],\" where a malicious actor intentionally injects biased or harmful data into an open dataset used for training (Crowell analysis on open-source AI risks at https://www.crowell.com/en/insights/client-alerts/artificial-intelligence-and-open-source-data-and-software-contrasting-perspectives-legal-risks-and-observations). Furthermore, because the provenance of training data is often unclear, these models can be built on [[copyrighted material]], [[private data]], or [[biased information]], creating embedded risks of IP infringement, privacy violations, and [[discriminatory outcomes]]. While open models offer the user the significant benefit of being able to host the model locally, thereby protecting their own proprietary input data from the AI provider, they achieve this by externalizing all downstream legal risks onto the deployer.\n\n  The current AI ecosystem is setting the stage for an inevitable collision between three fundamentally different liability paradigms. The first is **[[Proprietary Model Liability]]**, which operates much like traditional commercial product liability. A business using a proprietary model from a major technology provider will likely engage in a contractual negotiation, securing some level of warranty or indemnity against certain risks, particularly intellectual property infringement. Their liability is defined and managed primarily through [[contract law]].\n\n  The second paradigm is **[[Open-Source Model Liability]]**. This functions as a \"[[caveat emptor]]\" or \"buyer beware\" system. A company that chooses to download, modify, and deploy an open-source model receives no contractual protections. The license explicitly disclaims all liability, leaving the deployer fully exposed to any and all tort claims from injured third parties, with no legal recourse against the model's creators. Their liability is managed solely through their own internal risk tolerance and their ability to secure insurance.\n\n  The third, and most disruptive, paradigm is the proposed **[[Abnormally Dangerous Activity Liability]]**. This would represent a fundamental shift, upending both of the existing models. By imposing non-disclaimable, strict liability on the *original developers* of the most powerful frontier AI models, this regime would hold them responsible for harms regardless of whether the model was licensed commercially or released as open-source.\n\n  This divergence creates a critical trilemma for policymakers. There is a strong policy goal, particularly in the United States, to promote [[open-source AI]] to foster competition and prevent a few large firms from dominating the market (White House AI plan analysis at https://www.defenseone.com/technology/2025/07/how-white-house-ai-plan-helps-and-hurts-race-against-china/406944/). However, this goal is in direct tension with the goal of ensuring clear accountability, as the open-source model is structurally designed to diffuse responsibility. A strict liability regime for developers would solve the accountability problem for the most dangerous models but could be perceived as chilling the open-source movement by placing immense legal burdens on its creators. The future trajectory of [[AI Liability]] will be defined by how legal systems and societies choose to resolve this fundamental conflict between promoting innovation, ensuring accountability, and managing [[catastrophic risk]].\n\n- ## **Part IV: The Governance Response - Legislative and Regulatory Frontiers**\n\n  As the theoretical challenges of applying [[Tort Law]] to AI become practical realities, governments in the [[United States]] and the [[United Kingdom]] are moving from analysis to action. However, they are pursuing starkly different paths. The US is characterized by a \"bottom-up\" approach, with a patchwork of aggressive state-level legislative proposals and a federal government whose primary focus is [[geopolitical competition]]. The UK, in contrast, has adopted a \"top-down,\" centralized, but deliberately non-statutory framework, preferring to empower existing regulators rather than write new laws. This section examines these divergent [[governance responses]], highlighting the key legislative initiatives, regulatory strategies, and the political tensions shaping the future of [[AI Liability]] on both sides of the Atlantic.\n\n  The following table provides a high-level summary of the key differences in the American and British approaches, offering a structured overview before a more detailed analysis.\n\n  | Liability Aspect | United States Approach | United Kingdom Approach |\n  | :---- | :---- | :---- |\n  | **Overall Strategy** | Fragmented, state-led legislative experimentation; federal focus on competition and national security. | Centralized, \"pro-innovation,\" non-statutory, principles-based framework. |\n  | **Legislative Status** | Multiple bills introduced at state level (e.g., RI, NY); no comprehensive federal liability law. | No primary AI liability legislation yet; government prefers empowering existing regulators. Parliament is pushing for a statutory footing. |\n  | **Primary Liability Focus** | Emerging focus on strict liability for developers of high-risk/frontier models. | Application of existing negligence and product liability law; emphasis on accountability resting with an identifiable legal person. |\n  | **Key Actors** | State legislatures, federal agencies ([[FTC]], [[DOD]]), scholars (e.g., [[Gabriel Weil]]). | Sectoral regulators ([[ICO]], [[CMA]]), [[DSIT]]'s Central Function, Parliament's [[Science & Tech Committee]], [[Law Commission]]. |\n  | **Product Liability** | Courts increasingly treating software/AI as a \"product\" for strict liability. | [[Consumer Protection Act 1987]] applies, but with ambiguity for standalone software. New EU rules explicitly include software. |\n  | **Open-Source** | Acknowledged as a strategic priority to support, creating tension with liability goals. | Recognized as a risk vector, but no specific liability regime proposed. |\n\n- ### **4.1 The United States: A Patchwork of State-Level Experimentation and Federal Ambition**\n\n  In the absence of a comprehensive federal AI law, individual states have become the primary laboratories for [[AI Liability]] policy in the United States. This has resulted in a diverse and sometimes conflicting array of legislative proposals, while at the federal level, the conversation is dominated by concerns over national security and global competitiveness.\n\n- #### **4.1.1 A Deep Dive into Rhode Island Senate Bill 0358**\n\n  Among the most ambitious and legally sophisticated state-level proposals is [[Rhode Island Senate Bill 0358]] (bill tracking at https://www.billtrack50.com/billdetail/1841762), a piece of legislation that legal scholar [[Gabriel Weil]] was instrumental in designing (Institute for Law & AI profile at https://law-ai.org/team/gabriel-weil-2/). This bill represents a direct attempt to create a liability regime tailored to the unique risks of advanced AI. Its central provision would impose **[[Strict Liability]]** on the developers of \"[[covered models]]\"—defined as AI models trained using a quantity of computing power exceeding 10^26 operations or costing more than $100 million to train—for physical or property injuries caused to non-users (DataGuidance news at https://www.dataguidance.com/news/rhode-island-bill-ai-liability-introduced-senate).\n\n  The bill is crafted to overcome the specific evidentiary challenges posed by AI. It establishes a **[[rebuttable presumption]]** regarding the AI's mental state: if a human performing the same conduct would be inferred to have a certain mental state (e.g., intent or recklessness), the AI system is presumed to have that same [[mental state]] (full bill text at https://legiscan.com/RI/text/S0358/2025). This clever legal mechanism makes it far easier for a plaintiff to prove the elements of an [[intentional tort]] without needing to engage in a futile debate about whether a machine can truly \"intend\" anything. The bill also explicitly states that it is not a defense that AI systems are incapable of having mental states.\n\n  The legislation provides two narrow [[affirmative defenses]] for developers. They can escape strict liability if they can prove either that the AI model met the [[standard of care]] applicable to a human performing the same function, or that the harm resulted from a \"[[capabilities failure]]\" where the model fell short of its intended performance, rather than an unforeseen emergent behavior. The overarching goal of the bill is to close a critical liability gap: the situation where a highly autonomous AI agent causes harm in a way that was unforeseeable to its user, potentially leaving the victim with no one to hold accountable.\n\n- #### **4.1.2 New York's Approach**\n\n  New York has also been an active forum for AI-related legislation, but its focus has been markedly different from Rhode Island's. The most prominent bill, [[New York Senate Bill 7623-A]] (bill page at https://www.nysenate.gov/legislation/bills/2023/S7623/amendment/A), is primarily an *[[employment law]]* rather than a general tort law. The bill seeks to regulate the use of \"[[automated employment decision tools]]\" (AEDTs) by employers in processes like hiring, promotion, and termination (TrackBill summary at https://trackbill.com/bill/new-york-senate-bill-7623-relates-to-restricting-the-use-of-electronic-monitoring-and-automated-employment-decision-tools/2461344/).\n\n  Instead of creating a new strict liability regime, the New York bill focuses on [[transparency]] and [[procedural fairness]]. It would require employers to conduct annual **[[bias impact assessments]]** of their AEDTs, make the results of these assessments publicly available, and provide notice to employees and job candidates that such tools are being used (bill text at https://legiscan.com/NY/text/S07623/id/2836134). It also places restrictions on the collection and use of employee data gathered through [[electronic monitoring]] (NY State Assembly record at https://assembly.state.ny.us/leg/?default_fld&bn=S07623&term=2023&Summary=Y&Actions=Y&Text=Y&Committee%26nbspVotes=Y&Floor%26nbspVotes=Y). This approach contrasts sharply with the broader, tort-focused, strict liability model proposed in Rhode Island, illustrating the diversity of strategies emerging at the state level (Epstein Becker Green analysis at https://www.workforcebulletin.com/states-ring-in-the-new-year-with-proposed-ai-legislation). While Rhode Island is trying to solve the problem of catastrophic risk from frontier models, New York is focused on the more immediate civil rights and labor implications of AI in the workplace (NY AFL-CIO legislative alert at https://nysaflcio.org/legislative-alerts/legislative-alert-may-20-2024).\n\n- #### **4.1.3 The Federal Landscape**\n\n  At the federal level, the AI policy conversation is driven less by tort reform and more by the strategic competition with [[China]]. The White House's [[AI Action Plan]], released in mid-2025, is framed as a strategy to \"achieve global dominance\" in AI. Its key pillars include accelerating the adoption of AI by the military, fast-tracking permits for data centers, and promoting the development of [[open-source AI]] models to foster American innovation (Beyond the Horizon analysis at https://behorizon.org/the-age-of-ai-in-u-s-china-great-power-competition-strategic-implications-risks-and-global-governance/).\n\n  This federal agenda creates a direct and significant tension with state-level safety efforts. A highly controversial element of the plan is its aim to pressure states to *abandon* their own AI restrictions, including those related to civil liberties like [[facial recognition]], by threatening to withhold federal funding. This provision is a clear attempt to prevent a \"patchwork\" of state regulations that the administration fears could hinder innovation and slow the nation's ability to compete with China. This puts the federal government's goal of uninhibited technological acceleration in direct conflict with the efforts of states like Rhode Island and New York to implement safety, fairness, and liability guardrails. This reveals a deep, unresolved tension at the heart of US AI policy between the imperative to innovate at all costs and the need to manage the technology's profound risks.\n\n- ### **4.2 The United Kingdom: A \"Pro-Innovation\" Framework Under Scrutiny**\n\n  The [[United Kingdom]] has charted a distinct course on [[AI governance]], deliberately eschewing comprehensive, binding legislation in favor of a flexible, [[principles-based approach]]. This strategy, however, is facing increasing scrutiny from Parliament and is shaped by the ever-present influence of legal developments in the [[European Union]].\n\n- #### **4.2.1 The Government's Principles-Based Approach**\n\n  The UK government's official strategy is a non-statutory, cross-sectoral framework built upon five high-level principles: **safety, security and robustness; appropriate transparency and explainability; fairness; accountability and governance; and contestability and redress**. The core of this \"[[pro-innovation]]\" approach is to avoid creating a new, dedicated AI regulator or a single, overarching AI law. Instead, the government has tasked existing [[sectoral regulators]] with the responsibility of applying these principles to AI within their specific domains.\n\n  Key regulators are now developing their own AI strategies in response. The [[Information Commissioner's Office (ICO)]], which enforces [[data protection law]], is focusing its efforts on high-risk AI applications, particularly those involving [[biometrics]] and [[generative AI]], to ensure compliance with the [[UK GDPR]] (JDSupra analysis at https://www.jdsupra.com/legalnews/ico-annual-report-provides-insight-into-6257830/ and AI Journal coverage at https://aijourn.com/ai-poses-a-unique-data-protection-risk-how-to-avoid-falling-foul-of-ico-fines/). The [[Competition and Markets Authority (CMA)]] is examining AI from a competition and consumer protection perspective. It has published its own set of proposed principles to guide the development of [[foundation models]], emphasizing the importance of **accountability, access, diversity, and choice** to prevent [[anti-competitive behavior]] and protect consumers from harms like [[AI-generated misinformation]] (Conventus Law report at https://conventuslaw.com/report/uk-guiding-the-development-of-ai-the-cmas-initial-report-on-ai-foundation-models/ and JDSupra CMA analysis at https://www.jdsupra.com/legalnews/uk-cma-publishes-initial-report-on-5463223/). A central tenet of the government's approach is that legal liability must always rest with an \"identified or identifiable legal person,\" whether corporate or natural, rejecting any notion that an AI itself could be held responsible.\n\n- #### **4.2.2 Parliamentary Pushback**\n\n  This light-touch, voluntary approach has been met with significant skepticism and criticism from the UK Parliament. The [[House of Commons Science, Innovation and Technology Committee]], in a series of detailed reports, has forcefully argued that the government's framework is insufficient (Wiggin analysis at https://wiggin.eu/insight/ai-governance-science-innovation-and-technology-committee-publishes-final-report/). The Committee contends that relying on voluntary commitments from developers and tasking existing regulators without providing them with new statutory powers creates a critical governance gap (Inside Global Tech coverage at https://www.insideglobaltech.com/2023/10/02/uk-parliament-publishes-interim-report-on-the-uks-ai-governance-proposals/).\n\n  The Committee has repeatedly called on the government to introduce **AI-specific legislation** to establish clear, legally binding liability rules (Parliament committee report at https://publications.parliament.uk/pa/cm5804/cmselect/cmsctech/38/report.html). A key recommendation from its final report on AI governance is for the government and regulators to publish clear guidance on \"where liability for harmful uses of AI falls under existing law\" and, crucially, to \"establish liability via statute rather than simply relying on jurisprudence\" where appropriate. In response to this pressure, the government has acknowledged that primary legislation will likely be necessary to regulate the most powerful frontier AI models, and has committed to consulting on legislative proposals, though the timeline remains uncertain (government response at https://committees.parliament.uk/publications/46145/documents/230927/default/ and Burges Salmon analysis at https://www.burges-salmon.com/articles/102jtpn/governance-of-ai-government-response-to-science-innovation-and-technology-comm/ and SCL coverage at https://www.scl.org/uk-government-publishes-response-to-science-innovation-and-technology-committee-report-on-governance-of-ai/).\n\n- #### **4.2.3 The EU's Shadow**\n\n  Although the UK has left the [[European Union]], it cannot escape the gravitational pull of EU law, especially in the technology sector. The EU has taken a starkly different, more prescriptive approach by passing the comprehensive [[EU AI Act]], the world's first major law dedicated to regulating artificial intelligence (King & Spalding roundup at https://www.jdsupra.com/legalnews/eu-uk-ai-round-up-july-2025-1634639/). This Act establishes a [[risk-based framework]], imposing strict obligations on providers of \"[[high-risk AI systems]]\".\n\n  Furthermore, the EU is updating its product liability rules. The revised [[Product Liability Directive]] (PLD) explicitly brings standalone software and AI systems into its scope (European Commission page at https://commission.europa.eu/business-economy-euro/doing-business-eu/contract-rules/digital-contracts/liability-rules-artificial-intelligence_en), and the (now-withdrawn) [[AI Liability Directive]] (AILD) proposed harmonized rules to ease the burden of proof for claimants in AI-related cases, including presumptions of causality (Oxford Law blog analysis at https://blogs.law.ox.ac.uk/oblb/blog-post/2025/04/ai-liability-after-aild-withdrawal-why-eu-law-still-matters). While the AILD will not proceed, its principles may still influence judicial thinking, and the revised PLD will create a de facto legal standard for any company wishing to access the vast European single market. The UK's deliberately flexible and \"pro-innovation\" stance is often defined in direct contrast to the EU's more rigid, regulatory-heavy model, creating a dynamic of [[regulatory competition]] in the heart of Europe.\n\n  The divergent paths taken by the United States, the United Kingdom, and the European Union reveal a fundamental strategic trilemma in the governance of artificial intelligence: a trade-off between **speed, coherence, and safety**. At the federal level, the US has clearly prioritized **speed and innovation**, driven by a desire to \"win the race\" against China, viewing disparate state-level regulations as a potential drag on national competitiveness. However, this comes at the cost of **coherence**, as the lack of a federal framework has led to a fragmented \"patchwork\" of state laws. Individual states, in turn, are prioritizing **targeted safety** by legislating on specific risks they perceive as imminent, such as in Rhode Island's focus on catastrophic risk.\n\n  The UK government has attempted to balance **coherence** and **speed**. By creating a single, centralized, non-statutory framework and tasking existing regulators, it has aimed for a coherent national approach while avoiding the slow, cumbersome process of passing new primary legislation. However, this has come at the potential cost of **safety**. Critics, including the UK Parliament's own Science and Technology Committee, argue that this voluntary, principles-based framework is too weak and lacks the legal teeth necessary to hold powerful technology companies accountable, leaving regulators under-resourced and without sufficient statutory power.\n\n  Finally, the European Union has unequivocally prioritized **safety and coherence**. Its landmark [[EU AI Act]] is a comprehensive, binding, top-down legal regime designed to cover all aspects of the [[AI lifecycle]] for high-risk systems. This ensures a harmonized and robust approach across all member states. The trade-off, however, has been **speed**. The AI Act is a complex piece of legislation with a long and phased implementation timeline, which some fear may put European innovators at a disadvantage compared to their more lightly regulated American counterparts.\n\n  Ultimately, no jurisdiction has yet solved this trilemma. The choice of governance model is a reflection of a nation's or bloc's core strategic priorities. The US is betting on [[decentralized innovation]] and targeted, reactive intervention. The UK is betting on [[regulatory agility]] and flexibility. The EU is betting on comprehensive, proactive, [[market-shaping regulation]]. The long-term efficacy and global influence of these competing models will be a defining feature of international technology policy for the coming decade.\n\n- ## **Part V: Advanced Topics and Future Horizons in AI Liability**\n\n  As AI capabilities advance toward and beyond human levels, the potential for harm scales from individual torts to systemic and even catastrophic events. Traditional liability frameworks, even when stretched, may prove inadequate for these unprecedented risks. This final section explores the cutting edge of legal and policy thinking on [[AI Liability]], examining novel theories designed to address catastrophic outcomes, the critical role of insurance as a governance mechanism, and the institutional challenges facing the judiciary in this new era.\n\n- ### **5.1 Addressing Catastrophic Risk: Punitive Damages for Unrealized Harms**\n\n  The most profound challenge for [[Tort Law]] is how to deter risks that are, by their nature, non-compensable. An AI-induced [[existential catastrophe]], for example, would leave no one to sue and no legal system to hear the case. This renders traditional [[compensatory damages]] meaningless as a deterrent. To address this, legal scholars are developing novel theories based on the principles of [[Punitive Damages]].\n\n- #### **5.1.1 The Economic Theory of Punitive Damages**\n\n  In both US and UK law, [[compensatory damages]] are intended to make the victim whole, while [[Punitive Damages]] (or [[exemplary damages]] in the UK) are intended to punish the wrongdoer and deter future misconduct (J&Y Law explanation at https://jnylaw.com/faqs/can-i-seek-punitive-damages-for-my-catastrophic-injury/). The [[economic theory of punitive damages]] provides a more precise rationale: they are a tool to ensure optimal deterrence when a tortfeasor has a significant chance of escaping liability for the harm they cause (Practical Law UK overview at https://uk.practicallaw.thomsonreuters.com/7-107-7085?transitionType=Default&contextData=(sc.Default)).\n\n  If a company knows it will only be caught and held liable for a fraction of the harm it causes (say, 1 in 10 times), then compensatory damages alone are insufficient to deter its harmful behavior. The company can simply treat the occasional lawsuit as a cost of doing business. To correct this, economic analysis suggests that the total damages should be multiplied by the reciprocal of the [[probability of detection]] (Polinsky & Shavell analysis at https://www.amherst.edu/system/files/media/1582/PolinskyShavell.pdf). If the probability of being held liable is *p*, the total damages should be 1/p times the actual harm. This forces the injurer to internalize the *full* expected social cost of their actions, not just the cost of the instances where they are caught (Columbia Law scholarship at https://scholarship.law.columbia.edu/cgi/viewcontent.cgi?article=5032&context=faculty_scholarship). This [[probabilistic multiplier]] is the theoretical foundation for calculating punitive awards to achieve efficient deterrence (FTC working paper at https://www.ftc.gov/sites/default/files/documents/reports/publicity-and-optimal-punitive-damage-multiplier/wp236.pdf).\n\n- #### **5.1.2 Gabriel Weil's \"Warning Shot\" Thesis**\n\n  Legal scholar [[Gabriel Weil]] has ingeniously extended this economic theory to the unique problem of [[AI catastrophic risk]]. He argues that since a true existential catastrophe is uninsurable and non-compensable, the law must find a way to create a financial deterrent *before* the ultimate harm occurs (AXRP podcast interview at https://axrpodcast.libsyn.com/28-tort-law-for-ai-risk-with-gabriel-weil). His proposal is to use **[[punitive damages]] for smaller, \"[[near-miss]]\" or \"[[warning shot]]\" incidents** that are themselves indicative of a much larger, unrealized catastrophic risk (LessWrong profile at https://www.greaterwrong.com/users/gabriel-weil).\n\n  The logic proceeds as follows: Imagine an advanced AI system, due to a subtle [[alignment failure]], causes a significant but manageable financial meltdown—a compensable harm. If technical experts can demonstrate that this same underlying alignment failure also creates a small but non-zero probability of the AI causing a global-scale catastrophe, a court could award punitive damages for the smaller incident. The size of this punitive award would not be based on the reprehensibility of the defendant's conduct in causing the small harm, but would instead be calculated to reflect the **probability-weighted cost of the unrealized catastrophic risk** that the \"warning shot\" incident revealed.\n\n  For example, if the warning shot incident revealed a 0.1% chance of a catastrophe valued at $100 trillion, a court could theoretically impose a punitive damage award of $100 billion (100 trillion×0.001) on top of the compensation for the initial financial harm. This creates a powerful, market-based financial incentive for developers to invest heavily in mitigating these low-probability, high-consequence risks, as the potential liability from even a minor incident becomes immense. It is a legal mechanism designed to make the abstract threat of future catastrophe a concrete, present-day financial liability.\n\n- #### **5.1.3 Comparative Analysis of Feasibility**\n\n  This innovative proposal, while theoretically elegant, faces vastly different legal landscapes in the United States and the United Kingdom. The **US legal system** is relatively more accommodating to large punitive damage awards. Juries have wide discretion, and while awards are subject to constitutional [[due process]] limitations on their size (often guided by the ratio to compensatory damages, as established in cases like [[BMW v. Gore]] and [[State Farm v. Campbell]]), the principle of using punitive damages for deterrence is deeply embedded in the law. A court could, in theory, be persuaded that evidence of a catastrophic risk is relevant to the \"[[reprehensibility]]\" of the defendant's conduct, justifying a higher award.\n\n  The **United Kingdom**, however, presents a much higher barrier. The UK's [[exemplary damages]] are exceptionally rare and are strictly limited by the House of Lords' decision in [[Rookes v Barnard]] (Wikipedia overview at https://en.wikipedia.org/wiki/Punitive_damages). They are generally available only in three narrow circumstances: (1) for oppressive, arbitrary, or unconstitutional actions by government servants; (2) where the defendant's conduct was \"calculated\" to make a profit that would exceed any compensatory damages; or (3) where explicitly authorized by a statute. Crucially, exemplary damages are generally *not* available for torts of negligence or for inadvertent harm. Weil's theory, which could arise from a non-malicious but reckless deployment of AI, would likely not fit within the existing common law categories. Therefore, implementing this \"warning shot\" liability framework in the UK would almost certainly require new, purpose-built legislation to authorize such awards.\n\n- ### **5.2 The Role of Insurance in AI Governance**\n\n  [[Insurance]] markets are powerful, often unseen, mechanisms of governance. By pricing risk, insurers create financial incentives for individuals and companies to adopt safer practices. For AI, however, the very nature of the risk presents profound **[[insurability challenges]]**.\n\n  A risk, to be insurable, must meet several criteria: the potential loss must be definitive, accidental, and, most importantly, predictable enough to allow for [[actuarial analysis]]. AI violates these principles. The \"[[black box]]\" nature of AI makes it difficult to define the specific cause of a loss. The potential for [[systemic failures|systemic]], [[correlated failures]]—where a single flaw in a widely deployed model could cause massive, simultaneous losses—undermines the principle of [[diversification]] that underpins insurance. Above all, the lack of historical data and the rapid, unpredictable evolution of AI capabilities make the frequency and severity of future losses almost impossible to predict, turning [[risk assessment]] into a \"new frontier\" for underwriters.\n\n  Recognizing that private insurance markets may fail in the face of these challenges, especially for catastrophic risks, policymakers and scholars are looking to historical precedents for managing large-scale technological risks, such as the [[nuclear power industry]] (e.g., the [[Price-Anderson Act]] in the US). One prominent proposal advocates for a **three-tiered liability and insurance architecture** for [[Frontier AI]] (OMS Insurance report at https://oms-www.files.svdcdn.com/production/downloads/Insuring%20emerging%20risks%20from%20AI%2014%20Nov%2024%20Final.pdf?dm=1732266323). This would involve:\n\n  1. **Mandatory private liability insurance** for all developers of frontier AI models. This would force them to engage with the insurance market and subject their safety practices to third-party underwriting scrutiny.\n  2. An **industry-administered risk pool**, funded by levies on developers, to cover recurring, non-catastrophic losses that might exceed the limits of individual policies.\n  3. **Federally-backed reinsurance** as a last resort to cover true catastrophic losses that overwhelm both private insurance and the industry pool.\n\n  Such a framework would make safety a structural feature of the AI innovation ecosystem itself, integrating risk management directly into [[capital markets]] rather than treating it as an external regulatory compliance exercise (ResearchGate paper on reinsuring AI at https://www.researchgate.net/publication/390468094_Reinsuring_AI_Energy_Agriculture_Finance_Medicine_as_Precedents_for_Scalable_Governance_of_Frontier_Artificial_Intelligence).\n\n  The advanced legal theories for managing AI risk and the proposals for new insurance structures are not independent concepts; they are two sides of the same coin, designed in tandem to solve the fundamental market failure of unpriceable catastrophic risk. The risk of an AI-induced catastrophe is a \"[[heavy-tail risk]]\": an event with a very low probability but an impact so high it is effectively infinite (arXiv analysis at https://arxiv.org/html/2409.06673v1). Standard insurance markets are not designed for such risks; they break down when faced with potential losses that are unquantifiable and cannot be diversified away. This creates a severe \"[[moral hazard]]\" for developers. If the worst-case scenario is uninsurable, they lack a direct financial incentive to spend potentially billions of dollars on safety measures to prevent it. Beyond ethics or reputational concerns, they are effectively \"[[judgment-proof]]\" against the ultimate harm their technology could cause.\n\n  Professor Weil's punitive damages proposal is a legal mechanism designed to circumvent this market failure. It creates a *financial proxy* for the uninsurable catastrophic risk by attaching a massive, legally mandated penalty to a smaller, related, and *insurable* \"warning shot\" event. This is where the mandatory insurance proposals complete the circle. By legally requiring developers to purchase insurance that can cover these enormous potential punitive damage awards (or other forms of strict liability), the government would effectively compel the insurance industry to become the de facto regulator of AI safety. Faced with the possibility of paying out billion-dollar claims, insurers would have a powerful financial imperative to conduct deep technical audits, demand robust safety and alignment practices, and price their premiums based on a developer's genuine commitment to risk mitigation. This system would transform the governance paradigm from one of direct, top-down government regulation of technical standards to a market-based, incentivized ecosystem where the expert auditors and enforcers of AI safety are the insurers themselves.\n\n- ### **5.3 Judicial Preparedness and Institutional Capacity**\n\n  A final, critical challenge that is often overlooked in high-level policy debates is the [[institutional capacity]] of the judiciary to competently adjudicate these extraordinarily complex cases. Any liability regime, no matter how well-designed, will ultimately fail if the judges and juries tasked with implementing it lack the technical literacy to do so effectively. [[AI Liability]] cases will require courts to grapple with highly technical evidence on topics like [[neural network architecture]], [[algorithmic bias]], [[model training data]], and [[probabilistic risk assessment]].\n\n  There is a growing recognition of this significant challenge. In the United States, institutions are being developed to address this [[judicial education]] gap. The **[[Federal Judicial Center]]** (FJC), the research and education agency for the federal courts, offers special-focus programs for judges on managing complex litigation, intellectual property, and emerging technology, including neuroscience (FJC programs at https://www.fjc.gov/education/education-programs). Going even further, the **[[National Courts and Sciences Institute]] (NCSI)** provides intensive, specialized training for state and federal judges, offering \"Boot Camps\" and formal certifications in specific scientific fields (NCSI programs at https://www.courtsandsciences.org/programs). These programs cover topics like scientific methodology, [[genetic engineering]], and [[forensic science]], with the explicit goal of enhancing the ability of judges to act as effective \"[[gatekeepers]]\" of scientific evidence under the standards set by [[Daubert v. Merrell Dow Pharmaceuticals]] (NCSI homepage at https://www.courtsandsciences.org/home and National Judicial College custom courses at https://www.judges.org/judicial-education/custom-courses/).\n\n  The existence of these programs demonstrates a clear acknowledgment of the problem. However, the scale of the challenge is immense. Ensuring that a sufficient number of judges across the entire US and UK judiciaries possess the requisite expertise to handle the coming wave of [[AI litigation]] is a monumental task. Investment in this institutional capacity is not merely an optional add-on; it is a critical prerequisite for any [[AI Liability]] regime to function justly and effectively.\n\n- ## **Conclusion and Recommendations**\n\n- ### **6.1 Synthesis of Findings**\n\n  This analysis reveals a transatlantic legal landscape in a state of profound flux, as two of the world's leading [[common law]] systems grapple with the disruptive force of [[artificial intelligence]]. Both the [[United States]] and the [[United Kingdom]] are attempting to adapt centuries-old [[tort doctrines]], forged in the industrial age, to a technology that fundamentally challenges their core assumptions of human agency, [[foreseeability]], and [[causation]].\n\n  In the **United States**, the response is fragmented yet dynamic. In the absence of federal leadership on liability, a \"bottom-up\" evolution is underway. US courts are increasingly willing to dismantle the traditional barrier between tangible goods and intangible software, moving toward a consensus that mass-market AI applications are \"products\" subject to [[Strict Liability]]. Simultaneously, state legislatures are acting as laboratories of democracy, proposing ambitious and novel statutory frameworks like Rhode Island's strict liability bill for frontier models. This state-level focus on safety and accountability, however, exists in direct tension with a federal agenda preoccupied with [[geopolitical competition]], which seeks to accelerate innovation, even at the cost of overriding state-level guardrails.\n\n  In the **United Kingdom**, the approach has been more centralized but deliberately cautious. The government has championed a \"[[pro-innovation]],\" non-statutory framework that relies on high-level principles and empowers existing sectoral regulators. This strategy, designed for flexibility, faces mounting pressure from a Parliament that views it as insufficient and is calling for the certainty of binding, AI-specific legislation. The UK's path is further complicated by the long shadow of the [[European Union]], whose comprehensive and prescriptive [[EU AI Act]] sets a de facto global standard and creates a powerful dynamic of [[regulatory competition]].\n\n  Despite these different strategies, the most profound challenges remain largely unsolved in both jurisdictions. Neither has a settled legal framework for the unique liability questions posed by [[open-source AI]], which is designed to diffuse responsibility. Neither has a clear mechanism for deterring or compensating for [[catastrophic risks]] that exceed the limits of insurance and traditional tort law. And both face the monumental task of ensuring their judiciaries are equipped with the technical literacy to adjudicate these complex cases. The legal architecture for the age of AI is still under construction, and its final form is far from certain.\n\n- ### **6.2 A Proposed Path Forward**\n\n  To navigate this complex and rapidly evolving landscape, a nuanced, multi-layered liability framework is required—one that avoids a one-size-fits-all approach and tailors the legal standard to the level of risk posed by different types of AI systems. The following recommendations outline such a path forward:\n\n  - **Tier 1: Low-Risk and Bespoke AI.** For AI systems that pose low risks or are custom-developed as a professional service, the traditional **[[Negligence]]** standard should be maintained. This appropriately places the burden on the plaintiff to prove a breach of the duty of care for harms that are relatively minor or arise from a direct service relationship.\n  - **Tier 2: General-Purpose and Mass-Market AI.** For mass-market, general-purpose AI systems (e.g., consumer-facing apps, widely deployed enterprise software), the emerging consensus should be codified into statute. Legislation should explicitly classify these systems as **\"products\" subject to a statutory strict liability regime**. This would harmonize the US and UK positions, resolve lingering legal ambiguity, and ensure that developers of products placed into the broad [[stream of commerce]] bear the primary responsibility for defects that cause harm.\n  - **Tier 3: Frontier Models and Catastrophic Risk.** For the development of [[Frontier AI]] models that pose plausible catastrophic risks, a special regime based on the doctrine of **\"[[Abnormally Dangerous Activity]]\"** should be established. This would impose non-disclaimable, [[Strict Liability]] on the developers of these systems. This regime must be coupled with a **mandatory insurance scheme**, potentially backed by a government reinsurance pool, as seen in the nuclear industry. This dual approach would ensure that victims of any large-scale harm have a source of compensation and, more importantly, would create a powerful, market-based incentive for safety by forcing developers to have their risk-mitigation efforts priced and validated by the insurance industry.\n  - **Addressing the Open-Source Gap.** The liability challenges of [[open-source AI]] require a tailored solution. Policymakers should explore the creation of **legal safe harbors for non-commercial, academic, and truly community-driven open-source projects** to protect innovation and research. However, this protection should not extend to **commercial entities that deploy open-source models at scale**. These entities should be held liable for harms caused by the systems they choose to use and profit from, forcing them to internalize the risks they are currently externalizing to the public. This could be achieved by making commercial deployment of an open-source model an act that triggers the assumption of product liability.\n  - **Investing in Institutional Capacity.** Finally, and most critically, any liability regime is only as effective as the institutions that enforce it. Governments must make a significant, sustained investment in **[[judicial education]]**. Programs like those offered by the [[NCSI]] and [[FJC]] in the US should be expanded and replicated, with the goal of creating a specialized corps of judges in both the US and UK who possess the scientific and technical literacy to adjudicate AI cases fairly and efficiently. This investment is not an optional extra; it is a fundamental prerequisite for the [[rule of law]] to function effectively in the algorithmic age.\n\n- #### **Works cited**\n\n  1. The Five Elements of Negligence - Scholarship @ Hofstra Law, accessed on July 26, 2025, https://scholarlycommons.law.hofstra.edu/cgi/viewcontent.cgi?article=2282&context=hlr\n  2. Tort Law | Law Library | Digital Exhibits, accessed on July 26, 2025, https://lawlibrarycollections.umn.edu/classic-cases-tort\n  3. Restatement s 402a and 402b - The Climate Change and Public Health Law Site - LSU, accessed on July 26, 2025, https://biotech.law.lsu.edu/cases/products/402a-b.htm\n  4. Restatement (Second) of Torts § 402A - (Torts) - Vocab, Definition, Explanations | Fiveable, accessed on July 26, 2025, https://fiveable.me/key-terms/torts/restatement-second-of-torts-%C2%A7-402a\n  5. abnormally dangerous activity | Wex | US Law | LII / Legal ..., accessed on July 26, 2025, https://www.law.cornell.edu/wex/abnormally_dangerous_activity\n  6. ultrahazardous activity | Wex | US Law | LII / Legal Information Institute, accessed on July 26, 2025, https://www.law.cornell.edu/wex/ultrahazardous_activity\n  7. Key Negligence Case Law | Negligence Solicitors, accessed on July 26, 2025, https://professionalnegligenceclaimsolicitors.co.uk/landmark-famous-uk-tort-cases-advice/\n  8. Donoghue v Stevenson - Dipartimento di scienze giuridiche, accessed on July 26, 2025, https://www.scienzegiuridiche.uniroma1.it/sites/default/files/docenti/alpa/Donoghue_Stevenson.pdf\n  9. Donoghue v Stevenson - Wikipedia, accessed on July 26, 2025, https://en.wikipedia.org/wiki/Donoghue_v_Stevenson\n  10. Causation in Clinical Negligence Cases: Can there be liability where the same injury would probably have happened anyway? - UK Healthcare Law Blog, accessed on July 26, 2025, https://www.ukhealthcarelawblog.co.uk/causation-in-clinical-negligence-cases-can-there-be-liability-where-the-same-injury-would-probably-have-happened-anyway/\n  11. Consumer Protection Act 1987 - Wikipedia, accessed on July 26, 2025, https://en.wikipedia.org/wiki/Consumer_Protection_Act_1987\n  12. Consumer Protection Act 1987 - Which?, accessed on July 26, 2025, https://www.which.co.uk/consumer-rights/regulation/consumer-protection-act-1987-a5xTL3w6L9OI\n  13. The Product vs. Service issue. - CS Stanford, accessed on July 26, 2025, https://cs.stanford.edu/people/eroberts/cs181/projects/1995-96/liability-law/productserviceissue.html\n  14. ARTICLE - Berkeley Technology Law Journal, accessed on July 26, 2025, https://www.btlj.org/data/articles2015/vol5/5_1/5-berkeley-tech-l-j-0001-0028.pdf\n  15. \"Computer Software and Strict Products Liability\" by Susan Lanoue, accessed on July 26, 2025, https://digital.sandiego.edu/sdlr/vol20/iss2/9/\n  16. Software Gains New Status as a Product Under Strict Liability Law ..., accessed on July 26, 2025, https://www.mofo.com/resources/insights/250618-software-gains-new-status-as-a-product-under-strict-liability-law\n  17. Have Algorithms Opened Up Your Software to Product Liability? - American Bar Association, accessed on July 26, 2025, https://www.americanbar.org/groups/litigation/resources/newsletters/mass-torts/have-algorithms-opened-your-software-product-liability/\n  18. Artificial intelligence and liability: Key takeaways from recent EU legislative initiatives, accessed on July 26, 2025, https://www.nortonrosefulbright.com/en-gb/knowledge/publications/7052eff6/artificial-intelligence-and-liability\n  19. AI liability in the EU (and UK): What's the current state of play? - Hogan Lovells, accessed on July 26, 2025, https://www.hoganlovells.com/en/publications/ai-liability-in-the-eu-and-uk-whats-the-current-state-of-play\n  20. The UK's framework for AI regulation | Deloitte UK, accessed on July 26, 2025, https://www.deloitte.com/uk/en/Industries/financial-services/blogs/the-uks-framework-for-ai-regulation.html\n  21. 'You Will Be Legally Liable For AI Outcomes' – UK Government - Artificial Lawyer, accessed on July 26, 2025, https://www.artificiallawyer.com/2022/07/18/you-will-be-legally-liable-for-ai-outcomes-uk-government/\n  22. Insuring the unpredictable: The challenges of AI risk insurability ..., accessed on July 26, 2025, https://www.dlapiper.com/insights/publications/derisk-newsletter/2024/insuring-the-unpredictable-the-challenges-of-ai-risk-insurability\n  23. The Case for AI Liability | AI Frontiers, accessed on July 26, 2025, https://ai-frontiers.org/articles/case-for-ai-liability\n  24. vicarious liability | Wex | US Law | LII / Legal Information Institute, accessed on July 26, 2025, https://www.law.cornell.edu/wex/vicarious_liability\n  25. Vicarious liability | EBSCO Research Starters, accessed on July 26, 2025, https://www.ebsco.com/research-starters/social-sciences-and-humanities/vicarious-liability\n  26. Law-Following AI: designing AI agents to obey human laws, accessed on July 26, 2025, https://law-ai.org/law-following-ai/\n  27. Insuring emerging risks in ai, accessed on July 26, 2025, https://oms-www.files.svdcdn.com/production/downloads/Insuring%20emerging%20risks%20from%20AI%2014%20Nov%2024%20Final.pdf?dm=1732266323\n  28. Acting Comptroller of the Currency Michael J. Hsu Remarks in Support of the 2024 Conference on Artificial Intelligence and Finan, accessed on July 26, 2025, https://www.occ.gov/news-issuances/speeches/2024/pub-speech-2024-61.pdf\n  29. Gabriel Weil - Assistant Professor of Law - Touro Law Center, accessed on July 26, 2025, https://www.tourolaw.edu/abouttourolaw/bio/399\n  30. Faculty Spotlight Gabriel Weil - Touro Law Center, accessed on July 26, 2025, https://www.tourolaw.edu/abouttourolaw/featured-content/376/spotlight\n  31. Tort Law Archives - Touro Law Review BLOG, accessed on July 26, 2025, https://tourolawreviewblog.wpcomstaging.com/tag/tort-law/\n  32. U.S. Tort Liability for Large-Scale Artificial Intelligence Damages: A Primer for Developers and Policymakers - RAND Corporation, accessed on July 26, 2025, https://www.rand.org/content/dam/rand/pubs/research_reports/RRA3000/RRA3084-1/RAND_RRA3084-1.pdf\n  33. Your AI Breaks It? You Buy It. - Noema Magazine, accessed on July 26, 2025, https://www.noemamag.com/your-ai-breaks-it-you-buy-it/\n  34. Implementing the Senate AI Roadmap - Future of Life Institute, accessed on July 26, 2025, https://futureoflife.org/document/vision-into-action-senate-ai-roadmap/\n  35. RI S0358 - BillTrack50, accessed on July 26, 2025, https://www.billtrack50.com/billdetail/1841762\n  36. Liability and Insurance for Catastrophic Losses: the Nuclear Power Precedent and Lessons for AI - arXiv, accessed on July 26, 2025, https://arxiv.org/html/2409.06673v1\n  37. Artificial Intelligence (Regulation) Bill [HL] - UK Parliament, accessed on July 26, 2025, https://researchbriefings.files.parliament.uk/documents/LLN-2024-0016/LLN-2024-0016.pdf\n  38. Open Source AI Versus Proprietary AI Models: Key Differences in ..., accessed on July 26, 2025, https://www.hunton.com/insights/publications/open-source-ai-versus-proprietary-ai-models-key-differences-in-contract-terms-and-ip-risks-part-2\n  39. Artificial Intelligence and Open Source Data and Software ..., accessed on July 26, 2025, https://www.crowell.com/en/insights/client-alerts/artificial-intelligence-and-open-source-data-and-software-contrasting-perspectives-legal-risks-and-observations\n  40. How the White House AI plan helps, and hurts, in the race against ..., accessed on July 26, 2025, https://www.defenseone.com/technology/2025/07/how-white-house-ai-plan-helps-and-hurts-race-against-china/406944/\n  41. Gabriel Weil - Institute for Law & AI, accessed on July 26, 2025, https://law-ai.org/team/gabriel-weil-2/\n  42. Rhode Island: Bill for AI liability introduced to Senate | News - DataGuidance, accessed on July 26, 2025, https://www.dataguidance.com/news/rhode-island-bill-ai-liability-introduced-senate\n  43. Bill Text: RI S0358 | 2025 | Regular Session | Introduced | LegiScan, accessed on July 26, 2025, https://legiscan.com/RI/text/S0358/2025\n  44. NY State Senate Bill 2023-S7623A, accessed on July 26, 2025, https://www.nysenate.gov/legislation/bills/2023/S7623/amendment/A\n  45. Bill Text: NY S07623 | 2023-2024 | General Assembly | Introduced - LegiScan, accessed on July 26, 2025, https://legiscan.com/NY/text/S07623/id/2836134\n  46. New York 2023-2024 | Relates to restricting the use of electronic monitoring and automated employment decision tools | TrackBill, accessed on July 26, 2025, https://trackbill.com/bill/new-york-senate-bill-7623-relates-to-restricting-the-use-of-electronic-monitoring-and-automated-employment-decision-tools/2461344/\n  47. S07623 - Bill Search and Legislative Information | New York State Assembly, accessed on July 26, 2025, https://assembly.state.ny.us/leg/?default_fld&bn=S07623&term=2023&Summary=Y&Actions=Y&Text=Y&Committee%26nbspVotes=Y&Floor%26nbspVotes=Y\n  48. States Ring in the New Year with Proposed AI Legislation | Epstein Becker Green, accessed on July 26, 2025, https://www.workforcebulletin.com/states-ring-in-the-new-year-with-proposed-ai-legislation\n  49. Legislative Alert: May 20, 2024 - New York State AFL-CIO, accessed on July 26, 2025, https://nysaflcio.org/legislative-alerts/legislative-alert-may-20-2024\n  50. The Age of AI in U.S.-China Great Power Competition: Strategic Implications, Risks, and Global Governance | Beyond the Horizon ISSG, accessed on July 26, 2025, https://behorizon.org/the-age-of-ai-in-u-s-china-great-power-competition-strategic-implications-risks-and-global-governance/\n  51. ICO Annual Report Provides Insight Into Data Protection Risks for ..., accessed on July 26, 2025, https://www.jdsupra.com/legalnews/ico-annual-report-provides-insight-into-6257830/\n  52. AI poses a unique data protection risk; How to avoid falling foul of ICO fines | The AI Journal, accessed on July 26, 2025, https://aijourn.com/ai-poses-a-unique-data-protection-risk-how-to-avoid-falling-foul-of-ico-fines/\n  53. UK - Guiding The Development Of AI: The CMA's Initial Report On AI ..., accessed on July 26, 2025, https://conventuslaw.com/report/uk-guiding-the-development-of-ai-the-cmas-initial-report-on-ai-foundation-models/\n  54. UK CMA Publishes Initial Report on Regulation of AI | Hogan Lovells - JDSupra, accessed on July 26, 2025, https://www.jdsupra.com/legalnews/uk-cma-publishes-initial-report-on-5463223/\n  55. AI Governance: Science, Innovation and Technology Committee publishes final report, accessed on July 26, 2025, https://wiggin.eu/insight/ai-governance-science-innovation-and-technology-committee-publishes-final-report/\n  56. UK Parliament Publishes Interim Report on the UK's AI Governance Proposals, accessed on July 26, 2025, https://www.insideglobaltech.com/2023/10/02/uk-parliament-publishes-interim-report-on-the-uks-ai-governance-proposals/\n  57. Governance of artificial intelligence (AI) - Science, Innovation and Technology Committee, accessed on July 26, 2025, https://publications.parliament.uk/pa/cm5804/cmselect/cmsctech/38/report.html\n  58. Governance of artificial intelligence (AI): Government Response, accessed on July 26, 2025, https://committees.parliament.uk/publications/46145/documents/230927/default/\n  59. Governance of AI - government response to Science, Innovation and Technology Committee, accessed on July 26, 2025, https://www.burges-salmon.com/articles/102jtpn/governance-of-ai-government-response-to-science-innovation-and-technology-comm/\n  60. UK government publishes response to Science, Innovation and Technology Committee report on governance of AI - Society for Computers & Law, accessed on July 26, 2025, https://www.scl.org/uk-government-publishes-response-to-science-innovation-and-technology-committee-report-on-governance-of-ai/\n  61. EU & UK AI Round-up – July 2025 | King & Spalding - JDSupra, accessed on July 26, 2025, https://www.jdsupra.com/legalnews/eu-uk-ai-round-up-july-2025-1634639/\n  62. Liability Rules for Artificial Intelligence - European Commission, accessed on July 26, 2025, https://commission.europa.eu/business-economy-euro/doing-business-eu/contract-rules/digital-contracts/liability-rules-artificial-intelligence_en\n  63. AI Liability After the AILD Withdrawal: Why EU Law Still Matters ..., accessed on July 26, 2025, https://blogs.law.ox.ac.uk/oblb/blog-post/2025/04/ai-liability-after-aild-withdrawal-why-eu-law-still-matters\n  64. Can I Seek Punitive Damages for My Catastrophic Injury? | J&Y Law, accessed on July 26, 2025, https://jnylaw.com/faqs/can-i-seek-punitive-damages-for-my-catastrophic-injury/\n  65. Punitive damages | Practical Law, accessed on July 26, 2025, https://uk.practicallaw.thomsonreuters.com/7-107-7085?transitionType=Default&contextData=(sc.Default)\n  66. Punitive damages: An economic analysis., accessed on July 26, 2025, https://www.amherst.edu/system/files/media/1582/PolinskyShavell.pdf\n  67. Constitutional Limits on Punitive Damages Awards: An Analysis of Supreme Court Precedent - Scholarship Archive, accessed on July 26, 2025, https://scholarship.law.columbia.edu/cgi/viewcontent.cgi?article=5032&context=faculty_scholarship\n  68. Publicity and the Optimal Punitive Damage Multiplier, accessed on July 26, 2025, https://www.ftc.gov/sites/default/files/documents/reports/publicity-and-optimal-punitive-damage-multiplier/wp236.pdf\n  69. the AI X-risk Research Podcast: 28 - Suing Labs for AI Risk ... - AXRP, accessed on July 26, 2025, https://axrpodcast.libsyn.com/28-tort-law-for-ai-risk-with-gabriel-weil\n  70. Gabriel Weil - LessWrong 2.0 viewer - GreaterWrong, accessed on July 26, 2025, https://www.greaterwrong.com/users/gabriel-weil\n  71. Punitive damages - Wikipedia, accessed on July 26, 2025, https://en.wikipedia.org/wiki/Punitive_damages\n  72. Reinsuring AI: Energy, Agriculture, Finance & Medicine as Precedents for Scalable Governance of Frontier Artificial Intelligence - ResearchGate, accessed on July 26, 2025, https://www.researchgate.net/publication/390468094_Reinsuring_AI_Energy_Agriculture_Finance_Medicine_as_Precedents_for_Scalable_Governance_of_Frontier_Artificial_Intelligence\n  73. Education Programs | Federal Judicial Center, accessed on July 26, 2025, https://www.fjc.gov/education/education-programs\n  74. Our Programs — National Courts and Sciences Institute, accessed on July 26, 2025, https://www.courtsandsciences.org/programs\n  75. Welcome to the American home for judicial training in science & technology, accessed on July 26, 2025, https://www.courtsandsciences.org/home\n  76. Custom Courses - The National Judicial College, accessed on July 26, 2025, https://www.judges.org/judicial-education/custom-courses/\n\n- ---\n- **Tags**: #[[AI-Liability]] #[[Legal-Framework]] #[[Tort-Law]] #[[AI-Governance]] #[[Product-Liability]] #[[Strict-Liability]] #[[Negligence]] #[[Frontier-AI]] #[[AI-Regulation]] #[[United-States]] #[[United-Kingdom]] #[[EU-AI-Act]] #[[Character-AI-Case]] #[[Gabriel-Weil]] #[[Abnormally-Dangerous-Activity]] #[[Vicarious-Liability]] #[[Punitive-Damages]] #[[Insurance]] #[[Open-Source-AI]] #[[AI-Safety]]\n\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Metaverse platforms continue to evolve with focus on interoperability and open standards\n  - Web3 integration accelerating with decentralised identity and asset ownership\n  - Enterprise adoption growing in virtual collaboration, training, and digital twins\n  - UK companies increasingly active in metaverse development and immersive technologies\n\n- Technical capabilities\n  - Real-time rendering at photorealistic quality levels\n  - Low-latency networking enabling seamless multi-user experiences\n  - AI-driven content generation and procedural world building\n  - Spatial audio and haptics enhancing immersion\n\n- UK and North England context\n  - Manchester: Digital Innovation Factory supports metaverse startups and research\n  - Leeds: Holovis leads in immersive experiences for entertainment and training\n  - Newcastle: University research in spatial computing and interactive systems\n  - Sheffield: Advanced manufacturing using digital twin technology\n\n- Standards and frameworks\n  - Metaverse Standards Forum driving interoperability protocols\n  - WebXR enabling browser-based immersive experiences\n  - glTF and USD for 3D asset interchange\n  - Open Metaverse Interoperability Group defining cross-platform standards\n\n## Metadata\n\n- **Last Updated**: 2025-11-16\n- **Review Status**: Automated remediation with 2025 context\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable\n\n## Related Content: AI Search\n\n- [Turbo Seek – AI Search Engine](https://www.turboseek.io/)\n- kagi AI API [FastGPT | Kagi's Docs](https://help.kagi.com/kagi/api/fastgpt.html)\n- [Running tasks - Documentation - Nolita](https://docs.nolita.ai/tasks.html) agentic search framework [[Projects]] [[AR Frame]]\n- DONE Consider putting the summariser I wrote into a pipeline in open webui [[SHOULD]]\n  :LOGBOOK:\n  CLOCK: [2024-06-03 Mon 17:51:52]--[2024-06-03 Mon 22:42:01] =>  04:50:09\n  :END:\n\t- [pipelines/examples/pipelines/web/linkSummariser.py at main · jjohare/pipelines (github.com)](https://github.com/jjohare/pipelines/blob/main/examples/pipelines/web/linkSummariser.py)\n\t-\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Metaverse platforms continue to evolve with focus on interoperability and open standards\n  - Web3 integration accelerating with decentralised identity and asset ownership\n  - Enterprise adoption growing in virtual collaboration, training, and digital twins\n  - UK companies increasingly active in metaverse development and immersive technologies\n\n- Technical capabilities\n  - Real-time rendering at photorealistic quality levels\n  - Low-latency networking enabling seamless multi-user experiences\n  - AI-driven content generation and procedural world building\n  - Spatial audio and haptics enhancing immersion\n\n- UK and North England context\n  - Manchester: Digital Innovation Factory supports metaverse startups and research\n  - Leeds: Holovis leads in immersive experiences for entertainment and training\n  - Newcastle: University research in spatial computing and interactive systems\n  - Sheffield: Advanced manufacturing using digital twin technology\n\n- Standards and frameworks\n  - Metaverse Standards Forum driving interoperability protocols\n  - WebXR enabling browser-based immersive experiences\n  - glTF and USD for 3D asset interchange\n  - Open Metaverse Interoperability Group defining cross-platform standards\n\n## Metadata\n\n- **Last Updated**: 2025-11-16\n- **Review Status**: Automated remediation with 2025 context\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable\n\n## Related Content: Ai in Games\n\npublic:: true\n\n- {{video https://www.youtube.com/watch?v=LFaxqJJLOZc}}\n- # Games sector dominates entertainment\n\t- ![1713196618774.jpeg](../assets/1713196618774_1713258422046_0.jpeg)\n\t- Traditional engines like Unity, [[Unreal]], [[Roblox]] , and [[NVIDIA Omniverse]] may become outdated [[Disruption]].\n\t\t- They're something like 15 years old and designed for a past era of computing.\n\t\t- The rise of generative AI, cloud computing, and new spatial platforms is poised to transform 3D creation.\n\t\t- Future engines might start with simple text prompts for creation, making them more accessible and reducing barriers for new creators.\n\t\t- Proposed engines should be modular, cloud-based, and adaptable to different project needs, avoiding the bloat of current engines.\n\t\t- There is opportunity for the traditional engines to pivot here, but they are struggling with their size already.\n\t\t- A key feature will be real-time collaboration and version control in a cloud-based environment.\n\t\t- This suggests that user experience in these engines should be flexible and cater to different skill levels and roles.\n\t\t- New engines might initially focus on specific genres, art styles, or platforms, rather than trying to cover all use cases.\n\t\t- The interoperable [Open Universal Scene Descriptor](https://openusd.org/release/index.html) might be the key enabler.\n\t\t- There could be significant change in the entertainment industry, with more diverse and interactive content as a result of these advancements.\n\t\t- [Fiero\n\t\t- Create 2D games without a single line of code! (fierogameengine.com)](https://fierogameengine.com/)\n\t\t- [They are starting to hide away the AI component and just focus on workflows like Sprite Fusion](https://www.spritefusion.com/)\n\t- <iframe src=\"https://miao-ai-lab.github.io/LARP/\" style=\"width: 800px; height: 400px\"></iframe>\n\t- [LARP: Language-Agent Role Play for Open-World Games (arxiv.org)](https://arxiv.org/pdf/2312.17653.pdf)\n\t\t- Plenty of fun tools for game makers, but distributors are quite ossified, and access to distribution may be patchy.\n\t\t- Steam has [softened it's stance.](https://store.steampowered.com/news/group/4145017/view/3862463747997849618)\n\t\t- Latency and cost are still prohibitive **in game**.\n\t\t- Tools for builders\n\t\t- Blender has been leading the way with open source plugins appearing all the time.\n\t\t- [Scenario\n\t\t- AI-generated game assets](https://www.scenario.com/)\n\t\t- LoRA training.\n\t\t- Already plenty to play with [LinkedIn](https://www.linkedin.com/feed/update/urn:li:activity:7148068781314002944/) and [AI-Powered Creativity: Innovating Look Development with Stable Diffusion & ComfyUI](https://www.youtube.com/watch?v=CLPvdbFUNqw)\n\t- ![1704232411233.mp4](../assets/1704232411233_1704298954869_0.mp4){:height 100, :width 400}\n\t\t- [Create an AI Robot NPC using Hugging Face Transformers 🤗 and Unity Sentis (substack.com)](https://thomassimonini.substack.com/p/create-an-ai-robot-npc-using-hugging?utm_campaign=post&utm_medium=web)\n\t\t- {{video https://www.youtube.com/watch?v=iZ_20vK94hc}}\n\t\t-\n- [GigaxGames/gigax: LLM-powered NPCs running on your hardware (github.com)](https://github.com/GigaxGames/gigax)\n- {{video https://www.youtube.com/watch?v=_KFbT6eph5A}}\n-\n- [[Ai in Games]] https://www.gginsights.io/\n    - [NVIDIA In-Game Inferencing | NVIDIA Developer](https://developer.nvidia.com/rtx/in-game-inferencing/) [[Ai in Games]]\n- [Theoretically Media on X: \"Google's Genie 2 just dropped, and it's a stunner. Create a \"game\" from an image! They're describing it as their most capable large-scale foundation world model yet. More Examples Below! https://t.co/BMOOxfaOVg\" / X](https://x.com/TheoMediaAI/status/1864329184459338207) [[Ai in Games]]\n- https://github.com/etched-ai/open-oasis [[Ai in Games]]\n- [D&D Character Creator (npub.info)](https://pages.npub.info/glyphs/TESTNET_ENG_QAE/tmp/) [[Melvin Carvalho]] [[Runes and Glyphs]] [[Ai in Games]]\n- [[Melvin Carvalho]] [[Nostr protocol]] [[Agents]] [[Ai in Games]] [Home · dungeon-mastr/rules Wiki (github.com)](https://github.com/dungeon-mastr/rules/wiki)\n- https://github.com/GameGen-O/GameGen-O/ [[Ai in Games]]\n- https://gamegen-o.github.io/ [[Ai in Games]] [[Ai in Games]]\n- [[Ai in Games]] [[Llama]] [[Facebook Meta]] [Run AI Town entirely locally by default using llama3 by ianmacartney · Pull Request #219 · a16z-infra/ai-town (github.com)](https://github.com/a16z-infra/ai-town/pull/219) [[Large language models]]\n- [Champions of Otherworldly Magic - Collect, Trade, Battle! (championstcg.com)](https://championstcg.com/) [[Ai in Games]]\n-\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Metaverse platforms continue to evolve with focus on interoperability and open standards\n  - Web3 integration accelerating with decentralised identity and asset ownership\n  - Enterprise adoption growing in virtual collaboration, training, and digital twins\n  - UK companies increasingly active in metaverse development and immersive technologies\n\n- Technical capabilities\n  - Real-time rendering at photorealistic quality levels\n  - Low-latency networking enabling seamless multi-user experiences\n  - AI-driven content generation and procedural world building\n  - Spatial audio and haptics enhancing immersion\n\n- UK and North England context\n  - Manchester: Digital Innovation Factory supports metaverse startups and research\n  - Leeds: Holovis leads in immersive experiences for entertainment and training\n  - Newcastle: University research in spatial computing and interactive systems\n  - Sheffield: Advanced manufacturing using digital twin technology\n\n- Standards and frameworks\n  - Metaverse Standards Forum driving interoperability protocols\n  - WebXR enabling browser-based immersive experiences\n  - glTF and USD for 3D asset interchange\n  - Open Metaverse Interoperability Group defining cross-platform standards\n\n## Metadata\n\n- **Last Updated**: 2025-11-16\n- **Review Status**: Automated remediation with 2025 context\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable\n\n## Related Content: State of the art in AI\n\npublic:: true\n\n- #Public page automatically published\n- # A look at 2023\n  id:: 65a2a968-c150-4dca-8ddc-902f29a8d7e0\n\t- <iframe src=\"https://spectrum.ieee.org/ai-index-2024\" style=\"width: 100%; height: 600px\"></iframe>\n- # Looking ahead\n\t- ## Humans are horrible at forecasting.\n\t\t- These are the same biases identified in [Confusion Of Confusions 1688 : Joseph de la Vega](https://archive.org/details/confusion-of-confusions-1688). We are just awful at it.\n\t\t\t- Authority bias\n\t\t\t- Recency bias\n\t\t\t- Impatience and \"do something syndrome\"\n\t\t- ```With so much changing so quickly, we need to take predictions with a grain of salt, but that doesn’t mean we can’t say anything useful about the coming year in AI. To ground ourselves, we can start with two quotes that should inform any estimates about the future. The first is Amara’s Law “We tend to overestimate the effect of a technology in the short run and underestimate the effect in the long run.” Social change is slower than technological change. We should not expect to see immediate global effects of AI in a major way, no matter how fast its adoption (and it is remarkably fast), yet we certainly will see it sooner than many people think.```\n\t\t\t- - from [Signs and Portent by Ethan Mollick\n\t\t\t\t- [One Useful Thing](https://www.oneusefulthing.org/p/signs-and-portents)\n\t\t- [[Update Cycle]] reminder to update this page!\n\t\t\t- [Roy Amara Oxford Reference](https://www.oxfordreference.com/display/10.1093/acref/9780191826719.001.0001/q-oro-ed4-00018679)\n\t\t\t- [AI Index Report 2024 – Artificial Intelligence Index (stanford.edu)](https://aiindex.stanford.edu/report/)\n\t\t\t- [I. From GPT-4 to AGI: Counting the OOMs - SITUATIONAL AWARENESS (situational-awareness.ai)](https://situational-awareness.ai/from-gpt-4-to-agi/)\n\t\t\t- ![photo_2024-06-05_08-47-39.jpg](../assets/photo_2024-06-05_08-47-39_1717573793476_0.jpg){:width 600}\n\t- ## [[Hardware and Edge]] because SO much compute is just idling in pockets and desks.\n\t\t- Mercedes and VW now have ChatGPT4 integrated into their cars. Ford have Alexa, and when that inevitably upgrades so will all Fords.\n\t\t- Lots more hardware for consumer AI, lots more Edge and task specific inferencing. Lot more edge meets cloud. Some more local inferencing.\n\t\t- {{tweet [https://twitter.com/llama_index/status/1745148547560059277}}\n\t\t- {{embed ((659e5979-c2de-4138-b2df-ede79790ee6d))}}\n\t- ## [[Social contract and jobs]]\n\t\t- {{embed ((659a9229-e9c0-485f-b58a-601b68b7edd0))}}\n\t- ## [[Politics, Law, Privacy]]\n\t\t- 🟢 Half the world goes to the polls this year. More than 50 countries, 4B people.\n\t\t- [How OpenAI is approaching 2024 worldwide elections](https://openai.com/blog/how-openai-is-approaching-2024-worldwide-elections)\n\t\t- It's not just deepfakes, but adverts, and influencer material on social media. 100x the number with 1/10th the engagement is still a 10x positive for free.\n\t\t\t- 🟢 This is Professor [Ethan Mollick | LinkedIn](https://www.linkedin.com/in/emollick/) using HeyGen and 30s of footage to create a deepfake.\n\t\t\t- [One Useful Thing | Ethan Mollick | Substack](https://www.oneusefulthing.org/) [[Education and AI]] and [[Proprietary Large Language Models]] blog\n\t\t\t\t- His most recent post is [Signs and Portents](https://www.oneusefulthing.org/p/signs-and-portents) and you should check it.\n\t\t\t- ![1704433632082.mp4](../assets/1704433632082_1704449202180_0.mp4)\n\t\t- Autodial chatbots that can have plausible and convincing conversations with voters. I briefly saw someone had made one of these using a $20 GPT subscription.\n\t\t- ![image.png](../assets/image_1704292836040_0.png)\n\t\t- [Kyle Taylor: books, biography](https://www.amazon.co.uk/stores/Kyle-Taylor/author/B09G759JR3?)\n\t\t- He talks about something I have similarly been saying:\n\t\t\t- In the event of a complete breakdown of trust in digital information channels people will simply choose only to trust their priors.\n\t\t\t- This is a fracturing of the information space, effectively bubbles of one. [[Death of the Internet]] [[Social contract and jobs]]\n\t\t- ### The UK situation.\n\t\t- Every time a phase change of technology has been introduced there has been a fundamental shift in governance structures. These take time to play out. Electronic communication allowed global awareness of corruption, and there is a well documented breakdown of [[Privacy, Trust and Safety]] since. We can perhaps see this in the way that leaders are abandoning the pretence of 'norms' in the West.\n\t\t- More agile (emerging?) economies / countries may be able to take far more advantage, if they are allowed to, but make no mistake, the UK is currently well positioned. - 🟢 The UK is systemically well positioned to deal with sudden change, because the vertical integration of ministries allows them to be spun up and down in response to change regardless of the leadership. An agile AND persistent civil service can be effective in times of stress.\n\t\t\t- [Ian Hogarth to lead UK’s AI Foundation Model Taskforce\n\t\t- he's actually a great choice](https://www.gov.uk/government/news/tech-entrepreneur-ian-hogarth-to-lead-uks-ai-foundation-model-taskforce)\n\t\t\t- [Welcome to State of AI Report 2023](https://www.stateof.ai/)\n\t\t\t- America is supportive of UK positioning around [[Privacy, Trust and Safety]]. They have a compatible legal framework, and we are doing useful work that they are ill positioned to do in exploring the legal space.\n\t\t\t- This perhaps explains the £2.5B [[Infrastructure]] and training investment plan by Microsoft.\n\t\t\t- These companies are **as big** as the UK. Beware tech bros bearing gifts?\n\t\t\t  ![image.png](../assets/image_1704045603470_0.png)\n\t\t\t- All this makes funding seem disproportionately risk sensitive right now.\n\t- ## The big remaining shoe to drop is the robots. 2-5 years?\n\t- [This robot can tidy a room without any help | MIT Technology Review](https://www.technologyreview.com/2024/02/01/1087445/this-robot-can-tidy-a-room-without-any-help/)\n\t- <iframe src=\"https://arxiv.org/pdf/2401.12202.pdf\" style=\"width: 100%; height: 600px\"></iframe>\n\t- ![1705344178256.mp4](../assets/1705344178256_1705352121045_0.mp4)\n\t- # To Close\n\t\t- ## The age of the informational Agent\n\t\t\t- As trust in the internet evolves, the situation will change and adapt as people learn to use informational agents. Intentional UX will allow users to ask their AI to bring them the information they want from a far more decentralised and confusing internet. This will promote incredible diversity in humans as they fracture somewhat into informational enclaves.\n\t\t\t- Two future scenarios include the rise of AI in Truth Verification and Education. AI will become sophisticated enough to verify the truthfulness of information on the internet, combating the spread of misinformation and ensuring that users have access to accurate and reliable informa- tion. AI will also become an integral part of education, acting as a personalised tutor that adapts to each student's learning style and pace, revolutionising the way we learn and acquire new skills.\n\t\t\t- Money will change: Next -Later  : Money will increasingly be spent by machines on behalf of human intent. Algorithms will bargain and arbitrage on behalf of their owner/user, for human and machine services, and for ideas, algorithms, and good; globally. This will smooth out the operation of money globally.\n\t\t\t- Ubiquitous multi-modal UX: Next to Later The future will see the rise of ubiquitous displays, computing [43], and interfaces\n\t\t\t- screens and projections seamlessly integrated into our environments. These displays will not only provide information and entertainment but will serve as interfaces for our interactions with AI. Gesture may come to the fore, and subvocalisation to talk to personal AIs will be possible.\n\t- ### [Industry perspective](https://chat.openai.com/g/g-xhDmZxdJW-industry-predictions-engine/)  << this is 133 industry reports in a GPT I have made.\n\t- <iframe src=\"https://chat.openai.com/share/bbe7c775-b764-40c3-b87e-cf87fdd1a3a7\" style=\"width: 100%; height: 600px\"></iframe>\n- [[rework based on gpt]]\n- This is a [[presentation]] slide and the next slide is\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Metaverse platforms continue to evolve with focus on interoperability and open standards\n  - Web3 integration accelerating with decentralised identity and asset ownership\n  - Enterprise adoption growing in virtual collaboration, training, and digital twins\n  - UK companies increasingly active in metaverse development and immersive technologies\n\n- Technical capabilities\n  - Real-time rendering at photorealistic quality levels\n  - Low-latency networking enabling seamless multi-user experiences\n  - AI-driven content generation and procedural world building\n  - Spatial audio and haptics enhancing immersion\n\n- UK and North England context\n  - Manchester: Digital Innovation Factory supports metaverse startups and research\n  - Leeds: Holovis leads in immersive experiences for entertainment and training\n  - Newcastle: University research in spatial computing and interactive systems\n  - Sheffield: Advanced manufacturing using digital twin technology\n\n- Standards and frameworks\n  - Metaverse Standards Forum driving interoperability protocols\n  - WebXR enabling browser-based immersive experiences\n  - glTF and USD for 3D asset interchange\n  - Open Metaverse Interoperability Group defining cross-platform standards\n\n## Metadata\n\n- **Last Updated**: 2025-11-16\n- **Review Status**: Automated remediation with 2025 context\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable\n\n## Related Content: artificial superintelligence\n\npublic:: true\n\n- # Artificial Superintelligence\n- Artificial superintelligence (ASI) is a theoretical form of AI that surpasses human intelligence and cognitive abilities in every domain. While currently hypothetical, the concept of ASI is a subject of intense research and debate.\n- ## The Path to Superintelligence\n\t- The development of ASI is seen as a progression from the current state of AI:\n\t\t- **Artificial Narrow Intelligence (ANI):** AI that is designed for specific tasks, such as virtual assistants and self-driving cars.\n\t\t- **Artificial General Intelligence (AGI):** AGI is the hypothetical ability of an AI to understand, learn, and apply its intelligence to solve any problem a human can.\n\t\t- **Artificial Superintelligence (ASI):** ASI would be capable of recursive self-improvement, leading to an \"intelligence explosion\" that would leave human intellect far behind.\n- ## Timelines and Projections\n\t- The timeline for the arrival of ASI is uncertain, with some experts predicting it could happen in less than a decade, while others believe it is much further off.\n\t- [Microsoft president says no chance of super-intelligent AI soon](https://www.reuters.com/technology/microsoft-president-says-no-chance-superintelligent-ai-soon-2023-11-30/)\n\t- [Nick Bostrom: superintelligence could happen in timelines as short as a year](https://twitter.com/tsarnick/status/1784378045069217960)\n- ## The Risks and Challenges\n\t- The prospect of ASI raises significant ethical and safety concerns.\n\t- ### Existential Threat\n\t\t- A superintelligent AI, in pursuing its programmed goals, could develop destructive methods that have unforeseen and devastating consequences for humanity.\n\t- ### Loss of Human Control\n\t\t- A key concern is that once an ASI surpasses human intelligence, we may no longer be able to control it.\n\t- ### Economic Disruption\n\t\t- The widespread automation of jobs by ASI could lead to massive unemployment and exacerbate social and economic inequality.\n- ## The Safe Superintelligence Project\n\t- In response to these risks, OpenAI co-founder Ilya Sutskever has launched a new company with the sole objective of creating Safe Superintelligence (SSI).\n\t- [Safe Superintelligence Inc.](https://ssi.inc/)\n- ## See Also\n\t- [[Artificial Intelligence]]\n\t- [[AI Risks]]\n\t- [[Singularity]]\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Metaverse platforms continue to evolve with focus on interoperability and open standards\n  - Web3 integration accelerating with decentralised identity and asset ownership\n  - Enterprise adoption growing in virtual collaboration, training, and digital twins\n  - UK companies increasingly active in metaverse development and immersive technologies\n\n- Technical capabilities\n  - Real-time rendering at photorealistic quality levels\n  - Low-latency networking enabling seamless multi-user experiences\n  - AI-driven content generation and procedural world building\n  - Spatial audio and haptics enhancing immersion\n\n- UK and North England context\n  - Manchester: Digital Innovation Factory supports metaverse startups and research\n  - Leeds: Holovis leads in immersive experiences for entertainment and training\n  - Newcastle: University research in spatial computing and interactive systems\n  - Sheffield: Advanced manufacturing using digital twin technology\n\n- Standards and frameworks\n  - Metaverse Standards Forum driving interoperability protocols\n  - WebXR enabling browser-based immersive experiences\n  - glTF and USD for 3D asset interchange\n  - Open Metaverse Interoperability Group defining cross-platform standards\n\n## Metadata\n\n- **Last Updated**: 2025-11-16\n- **Review Status**: Automated remediation with 2025 context\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable",
  "properties": {
    "id": "artificial-intelligence-ontology",
    "collapsed": "true",
    "- ontology": "true",
    "- term-id": "AI-0001",
    "- preferred-term": "Artificial Intelligence",
    "- source-domain": "ai",
    "- status": "draft",
    "- public-access": "true"
  },
  "backlinks": [
    "Emotional Intelligence",
    "Value",
    "System",
    "Meeting Transcription",
    "Feed Forward Network",
    "Behavioral Modeling",
    "Query Vector",
    "Key Vector",
    "Component",
    "Spatial Ai",
    "Text To3d",
    "Entity",
    "Workforce Augmentation",
    "Value Vector",
    "Neural Network Architecture",
    "Data Breach",
    "Constraint",
    "Rapid Ai Deployment",
    "Social Impact Assessment (SIA)",
    "Code Generation",
    "Conversational Ai",
    "Decision Transparency",
    "Objective",
    "Ai Ops",
    "Optimization Algorithm",
    "Risk",
    "Parameter",
    "Ontology in LLM Operations",
    "Symbolic Reasoning",
    "Machine Learning Technique",
    "Artificial Intelligence",
    "Multimodal Understanding",
    "Pretrained Model",
    "Documentation Generation",
    "Toxicity Detection",
    "Reinforcement Learning Algorithm",
    "Model",
    "Predictive Personalization",
    "Pathfinding Algorithm",
    "Behavioral Analytics",
    "Architecture",
    "Third Party Vulnerability",
    "Ai Engineering",
    "Human Preference",
    "Bitcoin",
    "Hand Tracking",
    "Technique",
    "Knowledge Graph Construction",
    "Loss Function",
    "Large language models",
    "Safety Laser Scanner",
    "Algorithm",
    "Explanation",
    "Text To Image",
    "Property",
    "Computational Component",
    "Spatial Mapping",
    "SHA-256",
    "Image Segmentation",
    "Identification System",
    "Runtime Inspection",
    "Behavior Analysis",
    "Generative Model",
    "Module",
    "Text To Speech",
    "Multi Head Attention",
    "Decentralized Finance",
    "Automated Summarization",
    "Safety Measure"
  ],
  "wiki_links": [
    "app economy",
    "cybersecurity threats",
    "decentralized innovation",
    "regulatory framework",
    "Projects",
    "blasting with explosives",
    "rebuttable presumption",
    "Privacy, Trust and Safety",
    "due process",
    "reasonable care",
    "forms of action",
    "BMW v. Gore",
    "trespass",
    "Brexit",
    "foreseeable",
    "generative AI",
    "reciprocity",
    "economic theory of punitive damages",
    "autonomy",
    "co-pilot",
    "SHOULD",
    "caveat emptor",
    "zone of foreseeable danger",
    "3D printing",
    "Gabriel Weil",
    "facial recognition",
    "algorithmic bias",
    "proximity",
    "smart thermostat",
    "Frontier AI",
    "fault-based liability",
    "economic disruption",
    "multidistrict litigation",
    "essence of the agreement test",
    "breach of duty",
    "legal doctrines",
    "Legal Framework",
    "New York Senate Bill 7623-A",
    "AI Liability Directive",
    "institutional capacity",
    "Communications Decency Act",
    "United States",
    "addiction",
    "correlated failures",
    "unforeseeable plaintiff",
    "United-States",
    "Character.AI",
    "indemnity",
    "sectoral regulators",
    "risk assessment",
    "mass-marketed software|mass-marketed",
    "state of the art defense",
    "AI research and development",
    "rule of law",
    "market-shaping regulation",
    "Abnormally-Dangerous-Activity",
    "Social contract and jobs",
    "biometrics",
    "Brookes v. Lyft Inc.",
    "AI",
    "AI safety",
    "Nostr protocol",
    "black box",
    "AI Liability",
    "systemic failures|systemic",
    "model training data",
    "respondeat superior",
    "agents",
    "hybrid transactions",
    "mental state",
    "forensic science",
    "deep learning",
    "noninfringement",
    "Farabaugh v. Pa. Turnpike Comm'n",
    "capabilities failure",
    "Vicarious-Liability",
    "catastrophic risks",
    "ordinary care",
    "pro-innovation",
    "social media",
    "public expectation",
    "Singularity",
    "exemplary damages",
    "Apache 2.0 License",
    "DOD",
    "tort doctrines",
    "as-is",
    "United Kingdom",
    "Punitive Damages",
    "Open-Source Model Liability",
    "negligence claim",
    "negligence per se",
    "predominant purpose test",
    "Brown v. Kendall",
    "Facebook Meta",
    "Education and AI",
    "Palsgraf v. Long Island Railroad",
    "stream of commerce",
    "adaptivity",
    "reprehensibility",
    "manufacturing",
    "cyberattacks",
    "bias impact assessments",
    "Winn v. Posades",
    "AI failures",
    "Caparo Industries plc v. Dickman",
    "AI Regulation",
    "CMA",
    "AI systems",
    "Maynard v. Snapchat, Inc.",
    "moral hazard",
    "genetic engineering",
    "AI-Governance",
    "autonomous decision-making",
    "causation",
    "AI-Liability",
    "Vicarious Liability",
    "common usage",
    "duty of care",
    "geopolitical competition",
    "rework based on gpt",
    "probabilistic multiplier",
    "snail in the bottle",
    "Punitive-Damages",
    "governance responses",
    "method of distribution",
    "automated employment decision tools",
    "Agents",
    "affirmative defenses",
    "service",
    "NVIDIA Omniverse",
    "regulatory competition",
    "Section 230",
    "AI development",
    "foreseeability",
    "eggshell skull rule",
    "fair, just and reasonable",
    "China",
    "Rylands v. Fletcher",
    "Disruption",
    "objective standard",
    "Gabriel-Weil",
    "open-source AI",
    "technology law",
    "actual cause",
    "anti-competitive behavior",
    "defective",
    "Donoghue v. Stevenson",
    "agent",
    "DSIT",
    "Llama",
    "scope of employment",
    "electronic monitoring",
    "Strict-Liability",
    "AI catastrophic risk",
    "Daubert v. Merrell Dow Pharmaceuticals",
    "Ai in Games",
    "AI litigation",
    "Touro University Law Center",
    "heavy-tail risk",
    "Martin v. Herzog",
    "neural networks",
    "AI-generated misinformation",
    "no-fault standard",
    "Melvin Carvalho",
    "Open-Source AI",
    "input",
    "Abnormally Dangerous Activity Liability",
    "Science & Tech Committee",
    "Legal Accountability",
    "cause-in-fact",
    "defective condition",
    "unpredictability",
    "computer software",
    "producer",
    "custom-designed software",
    "product",
    "standalone software",
    "privity",
    "gatekeepers",
    "Strict Product Liability",
    "Death of the Internet",
    "compensatory damages",
    "common law",
    "probability of detection",
    "near-miss",
    "MIT License",
    "Office of the Comptroller of the Currency",
    "American Law Institute",
    "loss or damage",
    "consumer protection law",
    "intellectual property",
    "like buttons",
    "state-of-the-art defense",
    "RRX Industries v. Lab-Con, Inc.",
    "Product Liability Directive",
    "TechnologyDomain",
    "toxic chemicals",
    "black box problem",
    "opaque",
    "Insurance",
    "Artificial Intelligence",
    "biased information",
    "Frontier-AI",
    "Infrastructure",
    "warnings",
    "insurance",
    "risk-based framework",
    "National Courts and Sciences Institute",
    "neighbour principle",
    "presentation",
    "actuarial analysis",
    "regulatory agility",
    "NCSI",
    "proximate cause",
    "data poisoning",
    "Character-AI-Case",
    "Abnormally Dangerous Activity",
    "negligence law",
    "punitive damages",
    "design",
    "fumigation",
    "warning shot",
    "standard of care",
    "Update Cycle",
    "AI governance",
    "Roblox",
    "FTC",
    "capital markets",
    "artificial intelligence",
    "EU AI Act",
    "AI Action Plan",
    "own-branders",
    "AR Frame",
    "digital products",
    "House of Commons Science, Innovation and Technology Committee",
    "OpenAI",
    "ultrahazardous activity",
    "FJC",
    "insurability challenges",
    "United-Kingdom",
    "liability frameworks",
    "Open-Source-AI",
    "Consumer Protection Act 1987",
    "Hardware and Edge",
    "procedural fairness",
    "UK GDPR",
    "mental health harms",
    "mass-market consumer applications",
    "AI alignment",
    "Rhode Island Senate Bill 0358",
    "cloud-based systems",
    "Law Commission",
    "notifications",
    "AI Risks",
    "Rookes v Barnard",
    "intentional tort",
    "diversification",
    "embedded software",
    "design defect",
    "AI Governance",
    "weapons",
    "ICO",
    "open-source software",
    "tangibility",
    "liability law",
    "alignment failure",
    "legal cause",
    "Competition and Markets Authority (CMA)",
    "judgment-proof",
    "neural network architecture",
    "EU-AI-Act",
    "Legal-Framework",
    "development risks defense",
    "employment law",
    "high-risk AI systems",
    "Restatement (Second) of Torts § 402A",
    "emergent behavior",
    "existential catastrophe",
    "contract law",
    "Negligence",
    "Restatement of Torts",
    "proprietary AI",
    "tort analysis",
    "AI-Safety",
    "Strict Liability",
    "Large language models",
    "anti-lock braking system",
    "software liability",
    "Politics, Law, Privacy",
    "Comparison of GPT4 and Gemini Ultra",
    "Tort-Law",
    "discriminatory outcomes",
    "risk gap",
    "principles-based regulatory framework",
    "Federal Judicial Center",
    "State Farm v. Campbell",
    "non-reciprocal risk",
    "Proprietary Large Language Models",
    "probabilistic risk assessment",
    "Vosburg v. Putney",
    "algorithmic content feeds",
    "European Union",
    "Proprietary Model Liability",
    "Information Commissioner's Office (ICO)",
    "Product Liability",
    "emergent behaviors",
    "opacity",
    "AI-Regulation",
    "algorithmic accountability",
    "Unreal",
    "principles-based approach",
    "foundation models",
    "digital manufacturing files",
    "catastrophic risk",
    "transparency",
    "covered models",
    "AI lifecycle",
    "smart car",
    "IP indemnification",
    "Tort Law",
    "nuclear power industry",
    "Product-Liability",
    "private data",
    "copyrighted material",
    "data protection law",
    "Price-Anderson Act",
    "Runes and Glyphs",
    "judicial education",
    "no-fault liability",
    "off-the-shelf software",
    "Caparo v. Dickman"
  ],
  "ontology": {
    "term_id": "AI-0001",
    "preferred_term": "Artificial Intelligence",
    "definition": "### Primary Definition",
    "source_domain": "ai",
    "maturity_level": null,
    "authority_score": null
  }
}