{
  "title": "Quadratic Voting",
  "content": "- ### OntologyBlock\n  id:: bc-0466-quadratic-voting-ontology\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: BC-0466\n\t- preferred-term:: Quadratic Voting\n\t- source-domain:: blockchain\n\t- status:: stub-needs-content\n\t- public-access:: true\n\t- content-status:: minimal-placeholder-requires-authoring\n\t- public-access:: true\n\t- definition:: A component of the blockchain ecosystem.\n\t- maturity:: draft\n\t- owl:class:: bc:QuadraticVoting\n\t- owl:physicality:: ConceptualEntity\n\t- owl:role:: Concept\n\t- belongsToDomain:: [[BlockchainDomain]]\n\n## OWL Formal Semantics\n\n```clojure\n;; OWL Functional Syntax\n\n(Declaration (Class :QuadraticVoting))\n\n;; Annotations\n(AnnotationAssertion rdfs:label :QuadraticVoting \"Quadratic Voting\"@en)\n(AnnotationAssertion rdfs:comment :QuadraticVoting \"A component of the blockchain ecosystem.\"@en)\n\n;; Data Properties\n(AnnotationAssertion dcterms:identifier :QuadraticVoting \"BC-0466\"^^xsd:string)\n```\n\n- ## About Quadratic Voting\n  id:: quadratic-voting-about\n\t-\n\t- Quadratic voting represents a radical departure from traditional one-person-one-vote and plutocratic token-weighted governance mechanisms. Developed by economists Glen Weyl and E. Glen Posner, this mechanism addresses a fundamental challenge in collective decision-making: how to measure not just the direction of preferences, but their intensity. In standard voting systems, a voter who feels strongly about an issue has the same influence as one who is barely interested, whilst in token-weighted systems, wealth concentration leads to plutocratic outcomes where whales dominate governance. Quadratic voting solves this by implementing a cost function where the price of votes increases quadratically—to cast n votes, a participant must spend n² voice credits. This elegant mathematical relationship creates powerful incentives for honest preference revelation whilst preventing wealthy actors from overwhelming the process.\n\t-\n\t- The mechanism has found particular success in the blockchain ecosystem, where [[Gitcoin]] has deployed quadratic funding (the dual of quadratic voting) to distribute over £50 million to public goods projects since 2019. The system encourages broad-based community support whilst mitigating the influence of large donors, embodying the principles of \"liberal radicalism\" articulated by Weyl, Hitzig, and Buterin. Beyond cryptocurrency, quadratic voting has been experimentally adopted by organisations ranging from the Colorado Democratic Party for internal prioritisation to Taiwan's Presidential Hackathon for citizen participation. However, the mechanism faces persistent challenges around identity verification and Sybil resistance—the same mathematical properties that make it attractive for measuring preference intensity also create strong incentives for individuals to create multiple identities to game the system. This tension between the theoretical elegance of quadratic voting and the practical difficulties of implementation continues to drive innovation in identity systems, zero-knowledge proofs, and mechanism design within [[BC-0461-decentralized-autonomous-organization]] governance.\n\t-\n\t- ### Mathematical Foundation\n\t  collapsed:: true\n\t\t- The core mathematical principle of quadratic voting establishes that purchasing n votes costs n² voice credits. This creates a marginal cost function where each additional vote becomes progressively more expensive:\n\t\t-\n\t\t- **Cost Function**: `Cost(v) = v²` where v is the number of votes cast\n\t\t- **Marginal Cost**: `MC(v) = 2v - 1` (the cost of the vth vote)\n\t\t- **Budget Constraint**: Each participant receives C voice credits, limiting total votes to √C\n\t\t-\n\t\t- This quadratic relationship emerges from welfare economics and mechanism design theory. The optimal voting strategy for a rational agent is to purchase votes until the marginal cost equals their marginal benefit, which for a voter with valuation w and probability p of being pivotal is:\n\t\t-\n\t\t- **Optimal votes**: `v* = w × p / 2`\n\t\t-\n\t\t- This creates a socially optimal outcome because the aggregated votes approximate the sum of utilities rather than just counting preferences. The mechanism achieves incentive compatibility in large populations—voters have no incentive to misreport their true preferences, as doing so would merely waste their voice credits.\n\t\t-\n\t\t- **Quadratic Funding Mechanism**: The dual application uses individual contributions to match funding. For a project receiving contributions c₁, c₂, ..., cₙ, the matching amount M is:\n\t\t-\n\t\t- `M = (Σ√cᵢ)² - Σcᵢ`\n\t\t-\n\t\t- This formula rewards projects with broad-based support rather than large individual donors. A project receiving 100 contributions of £1 receives more matching than one receiving a single £100 contribution, fundamentally reshaping public goods funding.\n\t\t-\n\t\t- The game-theoretic properties include resistance to strategic voting in large populations, though this breaks down with collusion. Weyl and Posner prove that quadratic voting is asymptotically optimal as the population approaches infinity, minimising deadweight loss from collective decisions whilst traditional voting mechanisms incur losses proportional to population variance in preferences.\n\t\t-\n\t- ### Technical Implementation\n\t  collapsed:: true\n\t\t- Implementing quadratic voting in smart contracts requires careful attention to precision, gas efficiency, and attack prevention. The core challenge lies in computing square roots on-chain, as Solidity lacks native support for floating-point arithmetic.\n\t\t-\n\t\t- **Voice Credit Management**:\n\t\t- ```solidity\n\t\t- mapping(address => uint256) public voiceCredits;\n\t\t- mapping(address => mapping(uint256 => int256)) public votes; // proposal => vote count\n\t\t-\n\t\t- function vote(uint256 proposalId, int256 voteCount) external {\n\t\t-     uint256 cost = uint256(voteCount * voteCount);\n\t\t-     require(voiceCredits[msg.sender] >= cost, \"Insufficient credits\");\n\t\t-\n\t\t-     // Return previous vote credits\n\t\t-     int256 previousVote = votes[msg.sender][proposalId];\n\t\t-     voiceCredits[msg.sender] += uint256(previousVote * previousVote);\n\t\t-\n\t\t-     // Deduct new vote cost\n\t\t-     voiceCredits[msg.sender] -= cost;\n\t\t-     votes[msg.sender][proposalId] = voteCount;\n\t\t-\n\t\t-     proposals[proposalId].tallyFor += voteCount;\n\t\t- }\n\t\t- ```\n\t\t-\n\t\t- **Square Root Calculation**: Most implementations use the Babylonian method (Newton's approximation) for on-chain square root computation, or pre-compute values off-chain with Merkle proofs for verification.\n\t\t-\n\t\t- **Quadratic Funding Calculation**: [[Gitcoin]] computes matching amounts off-chain using Python with high-precision arithmetic, then publishes results with cryptographic proofs:\n\t\t- ```python\n\t\t- def calculate_quadratic_funding(contributions):\n\t\t-     sqrt_sum = sum(math.sqrt(c) for c in contributions)\n\t\t-     total_contributions = sum(contributions)\n\t\t-     matching = (sqrt_sum ** 2) - total_contributions\n\t\t-     return matching\n\t\t- ```\n\t\t-\n\t\t- **Identity and Sybil Resistance**: Production systems integrate with identity verification:\n\t\t- - **BrightID**: Decentralised social identity graph\n\t\t- - **Proof of Humanity**: Video verification and vouching\n\t\t- - **Gitcoin Passport**: Aggregated identity scores from multiple sources\n\t\t- - **Aadhaar integration**: Government ID in India's quadratic voting trials\n\t\t-\n\t\t- Gas efficiency remains critical. Computing quadratic costs for multiple proposals can exceed block gas limits. Solutions include:\n\t\t- - Snapshot-style off-chain voting with cryptographic aggregation\n\t\t- - Optimistic rollups for computation-heavy tallying\n\t\t- - Batch processing with commit-reveal schemes\n\t\t-\n\t\t- Security considerations include preventing vote buying, ensuring atomic vote updates, and protecting against flash loan attacks that could temporarily inflate voice credit balances.\n\t\t-\n\t- ### Real-World Implementations\n\t  collapsed:: true\n\t\t- **Gitcoin Grants (2019-present)**:\n\t\t- The flagship implementation of quadratic funding has distributed over £50 million to Ethereum public goods across 17 grant rounds. In Round 15 (September 2022), 49,104 unique contributors supported 1,534 projects, with a matching pool of $2.5 million provided by the Ethereum Foundation and other sponsors. The mechanism successfully identifies projects with genuine community support—small tools, documentation efforts, and research initiatives that would struggle under traditional patronage models. However, Gitcoin has continuously battled Sybil attacks, implementing progressively sophisticated identity requirements. Round 12 experienced significant manipulation attempts, leading to the development of Gitcoin Passport, which aggregates over 30 identity signals to compute a trust score. Projects failing to meet minimum unique contributor thresholds (typically 25+ verified humans) receive reduced or zero matching.\n\t\t-\n\t\t- **RadicalxChange (2018-present)**:\n\t\t- The non-profit organisation founded by Glen Weyl has conducted numerous quadratic voting experiments. Their 2019 collaboration with the Colorado House Democrats saw legislators use quadratic voting to prioritise 107 policy proposals, allocating 100 voice credits each. Results showed significant divergence from simple majority preferences—issues with intense minority support (rural healthcare, indigenous rights) received higher priority than they would under traditional voting. The mechanism revealed preference intensities invisible in standard surveys. However, participants required extensive education about the system, with many initially confused by the quadratic cost structure.\n\t\t-\n\t\t- **Taiwan Presidential Hackathon (2018-2023)**:\n\t\t- The Taiwanese government, under Digital Minister Audrey Tang, has employed quadratic voting for citizen participation in selecting winning projects. In the 2022 hackathon, over 150 teams competed, with 200,000 citizens allocating 99 voice credits each to vote on finalists. The winning project, \"Disaster Prevention and Relief Platform Integration\", received broad support across demographic groups rather than being pushed by a concentrated lobby. Taiwan's implementation uses government digital IDs for Sybil resistance, leveraging existing civic infrastructure.\n\t\t-\n\t\t- **Downtown Stimulus (2021)**:\n\t\t- The City of Colorado Springs distributed $1 million in COVID relief funds using quadratic voting. 1,736 residents received 100 voice credits to allocate among local businesses. The mechanism directed funds to neighbourhood shops with strong community ties rather than large chains. Analysis showed quadratic voting produced 23% more equitable distribution compared to simulated linear voting, with minority-owned businesses receiving proportionally more support.\n\t\t-\n\t\t- **Decentraland DAO (2022-present)**:\n\t\t- The virtual world governance system combines quadratic voting with delegation. MANA token holders receive voice credits proportional to their stake (with a square root transformation to mitigate plutocracy), then use quadratic voting on grant proposals. In 2023, the DAO allocated $3.2 million across 89 grants, with average contributor counts of 147 per successful proposal. The system has faced criticism for complexity and low participation rates (typically 3-5% of token holders).\n\t\t-\n\t- ### Advantages and Benefits\n\t  collapsed:: true\n\t\t- **Preference Intensity Expression**: Unlike binary voting, quadratic voting allows participants to signal how much they care. A voter strongly opposed to a proposal can allocate many votes, whilst those with mild preferences conserve credits for issues they prioritise. This reveals information unavailable in traditional systems.\n\t\t-\n\t\t- **Tyranny of the Majority Prevention**: Intense minority preferences receive weight proportional to their strength. In the Colorado legislature example, rural healthcare issues received high priority despite representing a numerical minority, because affected legislators felt strongly enough to spend credits heavily.\n\t\t-\n\t\t- **Plutocracy Mitigation**: The quadratic cost structure prevents wealthy actors from buying outcomes. A participant with 100× the resources can only cast 10× the votes (since √100 = 10), a dramatic reduction from linear systems where they would have 100× influence.\n\t\t-\n\t\t- **Public Goods Funding Efficiency**: Quadratic funding empirically outperforms traditional matching schemes. Gitcoin analysis shows projects receiving quadratic funding have 3× higher survival rates after two years compared to those funded through traditional grants, suggesting the mechanism successfully identifies community-valued work.\n\t\t-\n\t\t- **Reduced Deadweight Loss**: Economic analysis by Weyl and Posner demonstrates that quadratic voting minimises the welfare loss from collective decisions, approaching first-best efficiency as population grows. Traditional voting can incur deadweight losses proportional to preference variance.\n\t\t-\n\t\t- **Empirical Satisfaction**: Surveys of quadratic voting participants consistently show higher satisfaction than traditional voting. In Taiwan's hackathon, 78% of participants reported feeling their preferences were \"better represented\" compared to previous years using simple voting.\n\t\t-\n\t- ### Limitations and Challenges\n\t  collapsed:: true\n\t\t- **Sybil Attacks**: The fundamental vulnerability. Because the marginal cost of additional votes decreases with multiple identities, an attacker with n identities can amplify influence by √n. If creating fake identities costs less than this benefit, the mechanism fails. Gitcoin estimates 15-30% of participants in early rounds were Sybil attackers. Current defences (Passport, BrightID) add friction and exclude legitimate users without government IDs.\n\t\t-\n\t\t- **Collusion**: Coordinated groups can pool voice credits and concentrate votes strategically. If k colluders combine resources, they can achieve k times the influence of k independent voters acting alone. This undermines the mechanism's foundations. Research on collusion-resistant mechanisms (by Buterin et al.) proposes penalising voters whose preferences are too correlated, but implementations face complexity and false positive concerns.\n\t\t-\n\t\t- **Complexity and User Comprehension**: Many participants struggle to understand the quadratic cost structure. Studies show 40-60% initially allocate votes sub-optimally, often exhausting credits too quickly or failing to spend them. Education helps but adds overhead. In the Colorado experiment, legislators required a two-hour training session.\n\t\t-\n\t\t- **Initial Credit Distribution**: The choice of how many voice credits to distribute is arbitrary and hugely influential. Gitcoin uses token holdings (creating plutocracy concerns), Taiwan uses equal distribution, RadicalxChange experiments with salary-based allocation. No consensus exists on the \"correct\" approach.\n\t\t-\n\t\t- **Low Participation**: Most blockchain implementations suffer from severe participation inequality. Decentraland sees 3-5% turnout, lower than traditional corporate shareholder voting. Quadratic voting's complexity may exacerbate apathy.\n\t\t-\n\t\t- **Computational Costs**: On-chain quadratic voting is expensive. Computing vote costs and aggregating results for large populations can exceed Ethereum block gas limits, forcing implementations off-chain or to Layer 2 solutions.\n\t\t-\n\t\t- **Vote Buying Markets**: Although the quadratic structure makes buying individual votes expensive, organised markets could still emerge. The lack of secret ballots in blockchain implementations enables verification of purchased votes, potentially facilitating such markets.\n\t\t-\n\t- ### Comparison with Alternatives\n\t  collapsed:: true\n\t\t- **vs. Token-Weighted Voting**: Standard [[BC-0462-on-chain-voting]] gives whales linear influence over outcomes. A holder of 51% of tokens has absolute control. Quadratic voting reduces this to √51% ≈ 71% influence if credits are allocated proportionally to holdings, significantly constraining plutocracy whilst still rewarding stakeholding.\n\t\t-\n\t\t- **vs. One-Person-One-Vote**: Traditional democratic voting treats all preferences equally, ignoring intensity. A voter barely favouring option A cancels out a voter with strong preference for B. Quadratic voting reveals these intensities, but at the cost of complexity and Sybil vulnerability. In identity-strong environments (government IDs), this trade-off often favours quadratic voting.\n\t\t-\n\t\t- **vs. [[BC-0467-conviction-voting]]**: Conviction voting measures preference intensity through time rather than credits. Voters stake tokens on proposals, with influence growing exponentially the longer they maintain their position. This is more intuitive than quadratic voting and avoids credit allocation questions, but cannot express negative preferences (opposition) and is vulnerable to patience-based plutocracy where wealthy voters can afford to wait.\n\t\t-\n\t\t- **vs. [[BC-0469-snapshot-voting]]**: Snapshot provides off-chain, gasless voting but typically uses linear weighting (one token, one vote). Combining Snapshot with quadratic voting is technically feasible and growing in adoption. Snapshot's flexibility allows various weighting strategies including quadratic transforms.\n\t\t-\n\t\t- **vs. [[BC-0468-multi-sig-governance]]**: Multi-signature schemes concentrate power in small committees (typically 3-15 members) with fixed thresholds. This is efficient and secure but not preference-weighted. Quadratic voting could theoretically apply to multi-sig contexts (weighting signers by conviction), but no significant implementations exist.\n\t\t-\n\t\t- **Trade-offs Summary**:\n\t\t- - **Simplicity**: One-person-one-vote > Conviction > Token-weighted > Quadratic\n\t\t- - **Preference revelation**: Quadratic > Conviction > Token-weighted > One-person-one-vote\n\t\t- - **Sybil resistance**: Multi-sig > One-person-one-vote > Token-weighted > Conviction > Quadratic\n\t\t- - **Plutocracy resistance**: One-person-one-vote > Quadratic > Conviction > Multi-sig > Token-weighted\n\t\t- - **Implementation cost**: Multi-sig > Conviction > Token-weighted > One-person-one-vote > Quadratic\n\t\t-\n\t- ### Legal and Regulatory Aspects\n\t  collapsed:: true\n\t\t- **Securities Law Implications**: US securities regulators have not issued specific guidance on quadratic voting in [[BC-0461-decentralized-autonomous-organization]] governance. However, the SEC's focus on \"governance tokens\" as potential securities creates risk. If voice credits or governance tokens used for quadratic voting are deemed securities, DAOs must comply with registration requirements or qualify for exemptions. The Hinman framework's focus on \"efforts of others\" suggests that genuine decentralised governance might avoid security classification, but quadratic voting's complexity could be viewed as increasing promoter involvement if centralised entities manage identity verification.\n\t\t-\n\t\t- **Voice Credit Transfer Restrictions**: If voice credits become transferable commodities, they likely constitute securities. Most implementations make credits non-transferable and tied to specific voting rounds to avoid this classification. Gitcoin explicitly prohibits credit transfers and allocates them only at round commencement.\n\t\t-\n\t\t- **Data Protection and Identity Verification**: GDPR in Europe creates tension with Sybil resistance requirements. Collecting government IDs, biometric data, or social graphs for identity verification involves processing personal data. Most quadratic voting systems claim legitimate interest or consent grounds, but right-to-erasure requests create challenges for immutable blockchain records. Solutions include off-chain identity verification with on-chain commitment schemes.\n\t\t-\n\t\t- **Campaign Finance Analogies**: Quadratic funding for political campaigns could trigger campaign finance laws. The US Federal Election Campaign Act limits individual contributions and requires disclosure. Quadratic funding's mathematical amplification of small donations might be viewed as circumventing contribution limits. No jurisdiction has explicitly addressed this; political applications remain experimental.\n\t\t-\n\t\t- **Cross-Jurisdictional Challenges**: DAOs using quadratic voting face conflicts between jurisdictions. Wyoming's DAO LLC statute (see [[BC-0470-dao-legal-structures]]) permits algorithmic governance but is silent on voting mechanisms. Vermont's BBLLC law similarly defers to organisational documents. This regulatory vacuum provides flexibility but creates uncertainty.\n\t\t-\n\t- ### Best Practices\n\t  collapsed:: true\n\t\t- **Identity Verification Strategy**:\n\t\t- - Use multiple identity signals (Gitcoin Passport approach) rather than single identifiers\n\t\t- - Weight signals by Sybil resistance strength (government ID > social graph > transaction history)\n\t\t- - Implement graduated matching—higher identity scores receive fuller matching\n\t\t- - Regularly update identity requirements as attackers adapt\n\t\t- - Consider \"constitutional\" protection for privacy: minimum necessary identity collection\n\t\t-\n\t\t- **Credit Allocation Parameters**:\n\t\t- - For public goods: Equal distribution promotes egalitarianism\n\t\t- - For stakeholder governance: √(token_balance) balances skin-in-game with plutocracy resistance\n\t\t- - For expert domains: Credential-weighted credits (researchers get more in scientific DAOs)\n\t\t- - Always publish methodology transparently before rounds begin\n\t\t-\n\t\t- **Round Structure**:\n\t\t- - Clear start/end times to prevent strategic timing games\n\t\t- - Matching pool size announced in advance (hiding it creates uncertainty that reduces participation)\n\t\t- - Minimum contribution thresholds to raise Sybil attack costs\n\t\t- - Maximum project funding caps to prevent winner-take-all dynamics\n\t\t- - Review periods for fraud detection before fund distribution\n\t\t-\n\t\t- **User Interface Design**:\n\t\t- - Show remaining voice credits prominently\n\t\t- - Visualise quadratic cost curve for different vote allocations\n\t\t- - Provide \"undo\" functionality to encourage experimentation\n\t\t- - Offer \"auto-allocate\" suggestions based on stated preferences for newcomers\n\t\t- - Mobile-first design; participation correlates with accessibility\n\t\t-\n\t\t- **Security Hardening**:\n\t\t- - Audit smart contracts with focus on arithmetic overflow (voice credit calculations)\n\t\t- - Implement rate limiting on vote changes to prevent spam\n\t\t- - Use commit-reveal for high-stakes decisions to prevent frontrunning\n\t\t- - Monitor for sudden vote spikes indicating automated attacks\n\t\t- - Maintain emergency pause functionality with multi-sig control\n\t\t-\n\t\t- **Community Education**:\n\t\t- - Publish accessible explainers (analogies: \"buying votes gets expensive fast\")\n\t\t- - Run practice rounds with play money before real stakes\n\t\t- - Share analytics from previous rounds to build understanding\n\t\t- - Host office hours or AMAs for questions\n\t\t- - Translate materials into multiple languages for global participation\n\t\t-\n\t- ### Future Developments\n\t  collapsed:: true\n\t\t- **Pairwise Quadratic Voting**: Recent research by Lalley and Weyl extends quadratic voting to pairwise comparisons between options rather than voting on absolute proposals. This reduces dimensionality and may improve outcomes when many options exist. Early simulations show 15-20% better preference satisfaction.\n\t\t-\n\t\t- **Blockchain-Native Identity Systems**: Projects like [[Worldcoin]] (iris scanning), Polygon ID (zero-knowledge credentials), and Soulbound Tokens aim to provide Sybil-resistant identity without government dependency. If successful, these could unlock quadratic voting in permissionless environments where it currently struggles.\n\t\t-\n\t\t- **Quadratic Attention Markets**: Proposed by Weyl, these would allow users to allocate attention quadratically across content, creating incentives for quality over clickbait. Social media platforms could reward creators based on quadratic aggregation of viewing time, potentially reshaping content economics.\n\t\t-\n\t\t- **Hybrid Mechanisms**: Combining quadratic voting with conviction voting, where voice credits accumulate over time and decay if withdrawn, could capture both intensity and commitment. The [[Commons Stack]] is researching such hybrid approaches.\n\t\t-\n\t\t- **Machine Learning for Collusion Detection**: Gitcoin is developing ML models to identify collusion networks by analysing voting patterns, contribution timing, and social graphs. Early results show 80%+ accuracy in detecting coordinated behaviour, enabling automatic matching reductions for suspicious projects.\n\t\t-\n\t\t- **Regulation-Friendly Implementations**: As securities regulation evolves, \"wrapped\" quadratic voting systems that operate within compliant frameworks are emerging. These might use accredited investor verification for token-based credits whilst maintaining quadratic mechanics for actual voting.\n\t\t-\n\t\t- **Cross-Chain Aggregation**: Future systems may allow voice credits earned or held on multiple chains to be aggregated for voting, creating portable governance power whilst maintaining Sybil resistance through cross-chain identity verification.\n\t\t-\n\t- #\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Metaverse platforms continue to evolve with focus on interoperability and open standards\n  - Web3 integration accelerating with decentralised identity and asset ownership\n  - Enterprise adoption growing in virtual collaboration, training, and digital twins\n  - UK companies increasingly active in metaverse development and immersive technologies\n\n- Technical capabilities\n  - Real-time rendering at photorealistic quality levels\n  - Low-latency networking enabling seamless multi-user experiences\n  - AI-driven content generation and procedural world building\n  - Spatial audio and haptics enhancing immersion\n\n- UK and North England context\n  - Manchester: Digital Innovation Factory supports metaverse startups and research\n  - Leeds: Holovis leads in immersive experiences for entertainment and training\n  - Newcastle: University research in spatial computing and interactive systems\n  - Sheffield: Advanced manufacturing using digital twin technology\n\n- Standards and frameworks\n  - Metaverse Standards Forum driving interoperability protocols\n  - WebXR enabling browser-based immersive experiences\n  - glTF and USD for 3D asset interchange\n  - Open Metaverse Interoperability Group defining cross-platform standards\n\n## Metadata\n\n- **Last Updated**: 2025-11-16\n- **Review Status**: Automated remediation with 2025 context\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable\n\n\n## References and Research\n\t  collapsed:: true\n\t\t- **Foundational Papers**:\n\t\t- - Weyl, E. G., & Posner, E. A. (2018). *Radical Markets: Uprooting Capitalism and Democracy for a Just Society*. Princeton University Press.\n\t\t- - Lalley, S., & Weyl, E. G. (2018). \"Quadratic Voting: How Mechanism Design Can Radicalize Democracy.\" *AEA Papers and Proceedings*, 108, 33-37.\n\t\t- - Buterin, V., Hitzig, Z., & Weyl, E. G. (2019). \"Liberal Radicalism: A Flexible Design for Philanthropic Matching Funds.\" *Available at SSRN*.\n\t\t-\n\t\t- **Implementations and Analysis**:\n\t\t- - Gitcoin Grants Round Analysis Reports (gitcoin.co/results)\n\t\t- - RadicalxChange Experiments Database (radicalxchange.org/experiments)\n\t\t- - Taiwan Presidential Hackathon Reports (presidential-hackathon.taiwan.gov.tw)\n\t\t-\n\t\t- **Collusion and Sybil Resistance**:\n\t\t- - Buterin, V., et al. (2020). \"Flexible Design for Collusion Resistance in Quadratic Funding.\" *Ethereum Research*.\n\t\t- - Hitzig, Z., et al. (2020). \"Addressing Collusion in Quadratic Funding.\" *RadicalxChange Working Papers*.\n\t\t-\n\t\t- **Related Mechanisms**:\n\t\t- - [[BC-0461-decentralized-autonomous-organization]] - DAO governance frameworks\n\t\t- - [[BC-0462-on-chain-voting]] - Token-weighted voting mechanisms\n\t\t- - [[BC-0467-conviction-voting]] - Time-weighted preference expression\n\t\t- - [[BC-0469-snapshot-voting]] - Off-chain voting infrastructure\n\t\t- - [[Gitcoin]] - Primary quadratic funding platform\n\t\t- - [[Liberal Radicalism]] - Theoretical foundation\n\t\t- - [[Sybil Resistance]] - Identity verification approaches\n\t\t- - [[Mechanism Design]] - Game-theoretic foundations\n\t\t-\n\t- ### Original Content\n\t  collapsed:: true\n\t\t- ```\n\n\t\t  ```",
  "properties": {
    "id": "bc-0466-quadratic-voting-ontology",
    "collapsed": "true",
    "- ontology": "true",
    "- term-id": "BC-0466",
    "- preferred-term": "Quadratic Voting",
    "- source-domain": "blockchain",
    "- status": "stub-needs-content",
    "- public-access": "true",
    "- content-status": "minimal-placeholder-requires-authoring",
    "- definition": "A component of the blockchain ecosystem.",
    "- maturity": "draft",
    "- owl:class": "bc:QuadraticVoting",
    "- owl:physicality": "ConceptualEntity",
    "- owl:role": "Concept",
    "- belongsToDomain": "[[BlockchainDomain]]"
  },
  "backlinks": [
    "BC-0467-conviction-voting",
    "BC-0468-multi-sig-governance"
  ],
  "wiki_links": [
    "Commons Stack",
    "Gitcoin",
    "BC-0469-snapshot-voting",
    "BlockchainDomain",
    "Sybil Resistance",
    "BC-0467-conviction-voting",
    "BC-0470-dao-legal-structures",
    "Worldcoin",
    "Mechanism Design",
    "Liberal Radicalism",
    "BC-0468-multi-sig-governance",
    "BC-0462-on-chain-voting",
    "BC-0461-decentralized-autonomous-organization"
  ],
  "ontology": {
    "term_id": "BC-0466",
    "preferred_term": "Quadratic Voting",
    "definition": "A component of the blockchain ecosystem.",
    "source_domain": "blockchain",
    "maturity_level": null,
    "authority_score": null
  }
}