{
  "title": "Digital Signature",
  "content": "- ### OntologyBlock\n  id:: digital-signature-ontology\n  collapsed:: true\n\n  - **Identification**\n    - public-access:: true\n    - ontology:: true\n    - term-id:: BC-0030\n    - preferred-term:: Digital Signature\n    - source-domain:: blockchain\n    - status:: complete\n    - version:: 1.0.0\n    - last-updated:: 2025-10-28\n\n  - **Definition**\n    - definition:: Cryptographic authentication mechanism within blockchain systems, providing essential functionality for distributed ledger technology operations and properties.\n    - maturity:: mature\n    - source:: [[ISO/IEC 23257:2021]], [[IEEE 2418.1]], [[NIST NISTIR]]\n    - authority-score:: 0.95\n\n  - **Semantic Classification**\n    - owl:class:: bc:DigitalSignature\n    - owl:physicality:: VirtualEntity\n    - owl:role:: Object\n    - owl:inferred-class:: bc:VirtualObject\n    - belongsToDomain:: [[CryptographicDomain]]\n    - implementedInLayer:: [[SecurityLayer]]\n\n  - #### Relationships\n    id:: digital-signature-relationships\n    - is-subclass-of:: [[Blockchain Entity]], [[CryptographicPrimitive]]\n\n  - #### OWL Axioms\n    id:: digital-signature-owl-axioms\n    collapsed:: true\n    - ```clojure\n      Prefix(:=<http://metaverse-ontology.org/blockchain#>)\nPrefix(owl:=<http://www.w3.org/2002/07/owl#>)\nPrefix(rdf:=<http://www.w3.org/1999/02/22-rdf-syntax-ns#>)\nPrefix(xml:=<http://www.w3.org/XML/1998/namespace>)\nPrefix(xsd:=<http://www.w3.org/2001/XMLSchema#>)\nPrefix(rdfs:=<http://www.w3.org/2000/01/rdf-schema#>)\nPrefix(dct:=<http://purl.org/dc/terms/>)\n\nOntology(<http://metaverse-ontology.org/blockchain/BC-0030>\n  Import(<http://metaverse-ontology.org/blockchain/core>)\n\n  ## Class Declaration\n  Declaration(Class(:DigitalSignature))\n\n  ## Subclass Relationships\n  SubClassOf(:DigitalSignature :CryptographicPrimitive)\n  SubClassOf(:DigitalSignature :BlockchainEntity)\n\n  ## Essential Properties\n  SubClassOf(:DigitalSignature\n    (ObjectSomeValuesFrom :partOf :Blockchain))\n\n  SubClassOf(:DigitalSignature\n    (ObjectSomeValuesFrom :hasProperty :Property))\n\n  ## Data Properties\n  DataPropertyAssertion(:hasIdentifier :DigitalSignature \"BC-0030\"^^xsd:string)\n  DataPropertyAssertion(:hasAuthorityScore :DigitalSignature \"1.0\"^^xsd:decimal)\n  DataPropertyAssertion(:isFoundational :DigitalSignature \"true\"^^xsd:boolean)\n\n  ## Object Properties\n  ObjectPropertyAssertion(:enablesFeature :DigitalSignature :BlockchainFeature)\n  ObjectPropertyAssertion(:relatesTo :DigitalSignature :RelatedConcept)\n\n  ## Annotations\n  AnnotationAssertion(rdfs:label :DigitalSignature \"Digital Signature\"@en)\n  AnnotationAssertion(rdfs:comment :DigitalSignature\n    \"Cryptographic authentication mechanism\"@en)\n  AnnotationAssertion(dct:description :DigitalSignature\n    \"Foundational blockchain concept with formal ontological definition\"@en)\n  AnnotationAssertion(:termID :DigitalSignature \"BC-0030\")\n  AnnotationAssertion(:priority :DigitalSignature \"1\"^^xsd:integer)\n  AnnotationAssertion(:category :DigitalSignature \"cryptographic-foundations\"@en)\n)\n      ```\n\n- ## About Digital Signature\n  id:: digital-signature-about\n\n  - Cryptographic authentication mechanism within blockchain systems, providing essential functionality for distributed ledger technology operations and properties.\n  -\n  - ### Key Characteristics\n    id:: digital-signature-characteristics\n    - 1. **Definitional Property**: Core defining characteristic\n    - 2. **Functional Property**: Operational behavior\n    - 3. **Structural Property**: Compositional elements\n    - 4. **Security Property**: Security guarantees provided\n    - 5. **Performance Property**: Efficiency considerations\n  -\n  - ### Technical Components\n    id:: digital-signature-components\n    - **Implementation**: How concept is realized technically\n    - **Verification**: Methods for validating correctness\n    - **Interaction**: Relationships with other components\n    - **Constraints**: Technical limitations and requirements\n  -\n  - ### Use Cases\n    id:: digital-signature-use-cases\n    - **1. Core Blockchain Operation**\n    - **Application**: Fundamental blockchain functionality\n    - **Example**: Practical implementation in major blockchains\n    - **Requirements**: Technical prerequisites\n    - **Benefits**: Value provided to blockchain systems\n  -\n  - ### Standards & References\n    id:: digital-signature-standards\n    - [[ISO/IEC 23257:2021]] - Blockchain and distributed ledger technologies\n    - [[IEEE 2418.1]] - Blockchain and distributed ledger technologies\n    - [[NIST NISTIR]] - Blockchain and distributed ledger technologies\n  -\n\n\t- ### Inclusive Digital Society:\n\t\t- By overcoming barriers to entry for emerging markets and less developed nations, a more inclusive digital society can be fostered. This inclusivity will empower new ideas and perspectives, leading to a richer and more diverse digital landscape.\n\n\t- ### Spatial and Augmented Reality Technologies:\n\t\t- The incorporation of spatial and augmented reality technologies can expand the possibilities within the Metaverse, allowing for more immersive and interactive experiences. These technologies have the potential to reshape digital society and redefine the ways in which people interact with digital environments.\n\n\t- ### Continuous Evolution and Adaptation:\n\t\t- As the digital landscape continues to evolve, the open-source Metaverse system must be flexible and adaptable to meet changing needs and expectations. Continuous innovation and collaboration within the industry will be crucial for the success and longevity of the Metaverse as a transformative digital society platform.\n\n\t- ### Embracing the Open-Source Metaverse Vision:\n\t\t- To create a truly transformative and inclusive digital society, it is essential to embrace the vision of an open-source Metaverse. By fostering collaboration, promoting open standards, and integrating advanced AI and ML technologies, the Metaverse can become a platform that serves societal and business needs.\n\n\t- ### Fostering Collaboration and Inclusivity:\n\t\t- Creating an inclusive digital society is a key goal for the open-source Metaverse. By breaking down barriers and making the platform accessible to a wider audience, new ideas and perspectives will enrich the digital landscape and drive innovation.\n\n\t\t\t\t\t- #### Omniverse Digital Twin\n\t\t\t\t\t\t- A virtual replica of a real-world environment or system.\n\t\t\t\t\t\t- Utilizes the Linked-JSON ontology we designed, including:\n\t\t\t\t\t\t\t- MetaverseEntity and its subclasses\n\t\t\t\t\t\t\t\t- MetaverseAgent\n\t\t\t\t\t\t\t\t- MetaverseScene\n\t\t\t\t\t\t\t\t- SceneObject\n\t\t\t\t\t\t\t\t- DigitalAsset\n\t\t\t\t\t\t\t\t- VirtualEconomy\n\t\t\t\t\t\t\t- Relationships between entities\n\t\t\t\t\t\t\t\t- MetaverseAgent participates in MetaverseScene\n\t\t\t\t\t\t\t\t- MetaverseScene governed by GovernanceStructure\n\t\t\t\t\t\t\t\t- DigitalAsset has Owner and Creator\n\t\t\t\t\t\t\t\t- VirtualEconomy regulated by EconomicPolicy\n\t\t\t\t\t\t- Example Linked-JSON snippets:\n\t\t\t\t\t\t\t- ```json\n\t\t\t\t\t\t\t  {\n\t\t\t\t\t\t\t    \"@id\": \"narrativegoldmine:MetaverseEntity\",\n\t\t\t\t\t\t\t    \"@type\": [\n\t\t\t\t\t\t\t      \"narrativegoldmine:Class\",\n\t\t\t\t\t\t\t      \"Linked-JSON:Class\",\n\t\t\t\t\t\t\t      \"http://www.w3.org/2002/07/owl#Class\"\n\t\t\t\t\t\t\t    ],\n\t\t\t\t\t\t\t    \"http://www.w3.org/2000/01/rdf-schema#comment\": [\n\t\t\t\t\t\t\t      {\n\t\t\t\t\t\t\t        \"@value\": \"The root type encompassing all entities within the metaverse.\"\n\t\t\t\t\t\t\t      }\n\t\t\t\t\t\t\t    ],\n\t\t\t\t\t\t\t    \"http://www.w3.org/2000/01/rdf-schema#label\": [\n\t\t\t\t\t\t\t      {\n\t\t\t\t\t\t\t        \"@value\": \"Metaverse Entity\"\n\t\t\t\t\t\t\t      }\n\t\t\t\t\t\t\t    ],\n\t\t\t\t\t\t\t    \"http://www.w3.org/2000/01/rdf-schema#subClassOf\": [\n\t\t\t\t\t\t\t      {\n\t\t\t\t\t\t\t        \"@id\": \"https://schema.org/Thing\"\n\t\t\t\t\t\t\t      }\n\t\t\t\t\t\t\t    ]\n\t\t\t\t\t\t\t  }\n\t\t\t\t\t\t\t  ```\n\t\t\t\t\t\t\t- ```json\n\t\t\t\t\t\t\t  {\n\t\t\t\t\t\t\t    \"@id\": \"narrativegoldmine:participatesIn\",\n\t\t\t\t\t\t\t    \"@type\": [\n\t\t\t\t\t\t\t      \"http://www.w3.org/2002/07/owl#ObjectProperty\"\n\t\t\t\t\t\t\t    ],\n\t\t\t\t\t\t\t    \"http://www.w3.org/2000/01/rdf-schema#domain\": [\n\t\t\t\t\t\t\t      {\n\t\t\t\t\t\t\t        \"@id\": \"narrativegoldmine:MetaverseAgent\"\n\t\t\t\t\t\t\t      }\n\t\t\t\t\t\t\t    ],\n\t\t\t\t\t\t\t    \"http://www.w3.org/2000/01/rdf-schema#range\": [\n\t\t\t\t\t\t\t      {\n\t\t\t\t\t\t\t        \"@id\": \"narrativegoldmine:MetaverseScene\"\n\t\t\t\t\t\t\t      }\n\t\t\t\t\t\t\t    ]\n\t\t\t\t\t\t\t  }\n\t\t\t\t\t\t\t  ```\n\n\t- ### E-commerce Workflow Automation\n\t\t- *Task:* Streamline online sales processes, particularly for digital or physical goods.\n\t\t- **Flodesk + Stripe (+ Zapier/Shipday)**\n\t\t\t- *Description:* Set up workflows combining Flodesk (email/checkout pages), Stripe (payments), Zapier (connecting apps), and potentially Shipday (delivery management for physical items) to automate order processing, shipping logistics, and customer communication (receipts).\n\t\t\t- *Cost:* Flodesk (~$38/mo), Stripe (per transaction fees), Zapier (free/paid), Shipday (free/paid).\n\t\t\t- *Website:* <!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!---->[Flodesk](https://flodesk.com/)<!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!---->, <!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!---->[Stripe UK](https://stripe.com/gb)<!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!---->, <!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!---->[Zapier](https://zapier.com/)<!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!---->, <!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!---->[Shipday](https://shipday.com/)<!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!---->\n\t-\n\n- # Misc to merge\n- More recently [[Decentralised Web]] is being touted as a way to connect content creators di­rectly to content consumers, without centralised companies acting as gatekeep­ers of the data. It implies that all users have a cryptographic key management system, to which they attach metadata, that they make requirements of peers with whom they communicate, and that they maintain trust ‘scores’ with peers.\n- It seems likely that this new model is less driven by a market need, and more by the high availability of tools which allow this to happen (the ecosys­tems described later). Add to this a social response to the collapse in trust of companies such as Facebook and other social media platforms (János Török and János Kertész. “Cascading collapse of online social networks”. In: Scientific reports 7.1 (2017), pages 1–8) .\n- There is perhaps a wish by con­sumers to pass more of the economic incentive to content creators, without the ‘rent seeking’ layer afforded by businesses, and a healthy dose of mania driven market speculation. Edelman’s latest trust report is shocking, finding that trust in all institutions has slumped recently to all time lows, and their global survey found that: “Nearly 6 in 10 say their default tendency is to distrust something until they see evidence it is trustworthy. Another 64% say it’s now to a point where people are incapable of having constructive and civil debates about issues they disagree on. When distrust is the default – we lack the ability to debate or collaborate.”\n- Emerging consensus\n\t- The recent hype cycle ignored the legacy definitions described above and instead focusing almost exclusively on Ethereum based peer-to-peer projects. \n\t  It can be seen that the description is somewhat in the eye of the beholder.\n\t- It’s possible to frame this Ethereum Web3 as a hugely complex and ineffi­cient digital rights management system (DRM). DRM is something that users of the internet are increasingly familiar and comfortable with. It’s somewhat debatable whether decentralising this is worthwhile. The thesis of the devel­opers of the technology seems to be that without it, control of ‘value’ will accrete over time, to one or more hegemonic controlling entities. It’s a strong argument, but there is a substantial counter argument emerging that users just don’t want this stuff. The nervousness of legislators in the USA to the attempt by Facebook/Meta to enter this peer-to-peer value transmission space is telling in terms of the perception of who is driving Web3.\n\t- Throughout 2022 there was much furore on the internet over what Web3 might be, and who it ‘serves’. Enthusiasts feel that products such as Sign-In with Ethereum (EIP-4361) might give users choice over their data sovereignty, and a meme to this effect is seen in Figure 2.3. In practice though users are expecting to use badly written, buggy, economically vulnerable ‘crypto’ wallets to log into websites. The quality of this wallet software is improving of late with the so called “wallet wars” seeing commerce grade offerings from Coinbase and shares platform ‘Robinhood’. These two companies alone have over 100 million users. It’s likely that these wallets will evolve to offer the full spectrum of Web3 functionality. With that said it doesn’t seem to make much sense yet on the face of it. There are in fact examples of the technology completely failing at censorship resistance. Popular ‘Web3’ browser extension Metamask and NFT platform Opensea have both recently banned countries in response to global sanction pressure. This failure to meaningfully decentralise will be explored further in the distributed identity section.\n\t- Of their 2022 ‘Big Ideas’ report, ARK investment LLC (who manage a $50B tech investment) said the following, which connects some of the dots already mentioned “While many (with heavily vested interests) want to define all things blockchain as web3 we believe that web3 is best understood as just 1 of 3 revolutions that the innovation of bitcoin has catalyzed.\n\t\t- The Money Revolution\n\t\t- The Financial Revolution\n\t\t- The Internet Revolution”\n- This new hyped push for Web3 is being driven by enormous venture capital investment. A16Z are a major player in this new landscape and have released their ten principles for emergent Web3. Note here that A16Z are (like so many others) probably a house of cards.\n\t- Establish a clear vision to foster decentralized digital infrastructure\n\t- Embrace multi-stakeholder approaches to governance and regulation\n\t- Create targeted, risk-calibrated oversight regimes for different web3 activities\n\t- Foster innovation with composability, open source code, and the power of open communities\n\t- Broaden access to the economic benefits of the innovation economy\n\t- Unlock the potential of DAOs\n\t- Deploy web3 to further sustainability goals\n\t- Embrace the role of well-regulated stablecoins in financial inclusion and innovation\n\t- Collaborate with other nations to harmonize standards and regulatory frameworks\n\t- Provide clear, fair tax rules for the reporting of digital assets, and lever­age technical solutions for tax compliance\n- This list seems targeted toward the coming regulatory landscape, and could be considered at odds with the original tenants of an organically emergent, decentralised internet. Indeed principles such as ‘furthering sustainability goals’ seem downright incongruous. The community they claim to wish to support here are openly critical of these major institutional players and their motives, with even more pointed criticisms coming from outside of the Web3. This book and lab steer well clear of these companies and their applications.\n- Dante Disparte, chief strategy officer of ‘Circle’ venture capital, said in testimony to a US senate hearing; that Web 1 was ‘read’, Web 2 was ‘read write’, and that Web 3 will ‘read write own’. The important takeaway here is not so much this oft quoted elevator pitch for Web3, but the fact that legislative bodies now consider this technology a force which they need to be aware of and potentially contend with.\n- Jeremy Allaire, again of Circle’, talks about the recent legislative order in the USA as follows: “this is a watershed moment for crypto, digital assets, and Web 3, akin to the 1996/1997 whole of government wakeup to the commercial internet. The U.S. seems to be taking on the reality that digital assets represent one of the most significant technologies and infrastructures for the 21st century; it’s rewarding to see this from the WH after so many of us have been making the case for 9+ years.”\n- We see that participation in this new Web3 is contingent on owning cryptocurrencies. It’s estimated that about 6% of people in the UK own some cryptocurrency, with skews to both younger demographics, and smaller holdings.\n-\n\n\t- ## Post ‘Meta’ metaverse\n\t\t- The current media around “metaverse” has been seeded by Mark Zuckerberg’s rebranding of his Facebook company to ‘Meta’, and his investment in the technology. Kraus et al suggest that this seems more a marketing and communication drive than a true shift in the company business model,[[kraus2022facebook]] but despite this Park and Kim identify dozens of recent papers of metaverse research emerging from Meta labs.[[park2022metaverse]]\n\t\t- In Stephenson’s ‘Snow Crash’ the Hero Protagonist (drolly called Hiro Protagonist) spends much of the novel in a dystopian virtual environment called the metaverse. It is unclear if Facebook is deliberately embracing the irony of aping such a dystopian image, but certainly their known predisposition for corporate surveillance, alongside their attempt at a global digital money is [ringing alarmbells](https://www.politico.com/newsletters/digital-future-daily/2022/04/12/the-facebook-whistleblower-takes-on-the-metaverse-00024762),as is their [currentplan](https://www.cnet.com/personal-finance/metas-new-47-5-fee-on-metaverse-items-has-nft-twitter-pissed/)for monetisation.\n\t\t- The second order hype is likely a [speculativeplay](https://www.goldmansachs.com/insights/pages/framing-the-future-of-web-3.0-metaverse-edition.html)by major companies on the future of the internet. Grayscale investment[published areport](https://grayscale.com/wp-content/uploads/2021/11/Grayscale_Metaverse_Report_Nov2021.pdf)which views Metaverse as a potential trillion dollar global industry.Such industry reports are given to hyperbole, but it seems thetechnology is becoming the focus of technology investment narratives.Some notable exerts from a [2021report](https://www.jpmorgan.com/content/dam/jpm/treasury-services/documents/opportunities-in-the-metaverse.pdf)by American bank JPMorgan show how the legacy financial institutions seethis opportunity:\n\t\t- In the view of the report it“The metaverse is a seamless convergence of our physical and digital lives, creating a unified, virtual community where we can work, play, relax, transact, and socialize.”\n\t\t- this isn’t the worst definition, and very much plays into both the value and mixed reality themes explored in this book.\n\t\t- They agree with the industry that monetisation of assets in metaverse applications is called “Metanomics”. It’s worth seeing this word once, as it’s clearly gaining traction, but it won’t be used in this book.\n\t\t- They make a point which is at the core of this book, that value transaction within metaverses may remove effective border controls for working globally. Be this teleoperation of robots, education, or shop fronts in a completely immersive VR world. They say: it“One of the great possibilities of the metaverse is that it will massively expand access to the marketplace for consumers from emerging and frontier economies. The internet has already unlocked access to goods and services that were previously out of reach. Now, workers in low-income countries, for example, may be able to get jobs in western companies without having to emigrate.”\n\t\t- There is a passage which foreshadows some of the choices made in this book: it“Expanded data analytics and reporting for virtual spaces. These will be specifically designated for commercial and marketing usage and will track business key performance indicators (this already exists in some worlds, such as Cryptovoxels)”. More on this later.\n\t\t- The report attempts to explore the web3 & cryptocurrency angles of metaverse. That’s also the aim of this book, but they have taken a much more constrained approach, ignoring the possibilities within Bitcoin.\n\t\t- They assert that strong regulatory capture, identification, KYC/AML etc should underpin their vision of the metaverse. This is far from the community driven and organically emergent narratives that underpin Web3. This is their corporate viewpoint, something they have to say. On the back of this they pitch their consultancy services in these areas.\n\t\t- There has been a reactive pushback against commercialisation andcorporateisation by the wider tech community, who are [concernedabout](https://www.metaversethics.org/p/mde02-metaverse-data-privacy-1)the aforementioned monetisation of biometrics. [Observers do nottrust](https://www.coindesk.com/layer2/2022/01/19/meta-leans-in-to-tracking-your-emotions-in-the-metaverse/)these ‘web’ players with such a potentially powerful social medium. Itis very plausible that this is all just a marketing play that goesnowhere and fizzles out. It is by no means clear that people want tospend time socialising globally in virtual and mixed reality. Thesemajor companies are making an asymmetric bet that if there is a moveinto virtual worlds, then they need to be stakeholders in thegatekeeping capabilities of those worlds.\n\t\t- To paraphrase Olson; the salesmen peddling the inevitability of themetaverse are stuck clinging to aesthetic details because, without them,they’re just talking about the internet. While virtual reality isenjoying hype right now, and will continue to develop, it facessignificant challenges related to the human body’s physiologicallimitations. For instance, the inner ear can become disoriented when auser experiences virtual movement without physically moving. This issuehas led to the development of VR applications that require compromisesbetween immersion and physical comfort.\n\n\t\t- #### More like a digital twin\n\t\t- One of the most intuitive ways to view a metaverse is as a virtual landscape. This is how metaverse was portrayed in the original Neal Stephenson use of the word. ‘Digital twin’ is another much abused industry term which trends toward a 3D representation of real worldspaces and objects. Sometimes these virtual objects are connected to the real by telemetry, allowing industrial monitoring applications. Much is made of such systems in simulation brochures, and on the web, but it’s surprisingly hard to find real world applications of the idea outside of complex large scale systems engineering (aerospace). The costs of maintenance are simply too high. The US army owns the digital twin which could be called [closest to “The Metaverse”](https://www.army.mil/standto/archive/2018/03/26/) (note the intentional capitalisation). Their global simulation environment mirrors real world locations for their training needs. The European space agency is building an Earth digital twin for climate research, as [is Nvidia](https://www.nvidia.com/en-us/on-demand/session/gtcfall22-a41326/?playlistId=playList-9bb5405e-3e40-4ff3-88db-61cd3a4507e5#:~:text=Earth%2D2%20aims%20to%20improve,learning%20methods%20at%20unprecedented%20scale.),but again it’s unclear what this offers over and above access to direct data feeds, and of course such an ambitious project likely has an ecological cost!\n\t\t- Within industry digital twins are seen as the primary use case for metaverse, with even the world economic forum [subscribing to the hype](https://www.weforum.org/agenda/2023/01/metaverse-biggest-impact-industry-davos2023/).To be clear, there is enormous effort, investment, and potential here, with NVIDIA choosing to bind [their Omniverse](https://www.nvidia.com/en-gb/omniverse/) platform to their substantial hype wave.\n\n\t- ## EMG Wristbands\n\t\t- Meta's EMG wristbands use electromyography to interpret electrical signals from the brain that control hand movements[1](https://blogs.expandreality.io/meta-are-enhancing-vr-experiences-with-neural-wristbands). This technology allows for seamless and precise interactions with digital objects in virtual and augmented reality environments without the need for external cameras or sensors[1](https://blogs.expandreality.io/meta-are-enhancing-vr-experiences-with-neural-wristbands).The wristbands contain embedded sensors that capture subtle electrical signals transmitted from the brain to the hands. These signals are then translated into precise commands, enabling real-time interaction with virtual environments[1](https://blogs.expandreality.io/meta-are-enhancing-vr-experiences-with-neural-wristbands).\n\t\t- [Meta are Enhancing VR Experiences with Neural Wristbands](https://blogs.expandreality.io/meta-are-enhancing-vr-experiences-with-neural-wristbands)\n\n- # Design formalisation\n\t- Here's the updated text to align with the Linked-JSON ontology:\n\t\t- 1. Fusing of digital and real life: The ontology accommodates the blending of digital and real-life experiences through the `MetaverseScene` class, which can have a `hasPhysicalCounterpart` property linking it to a real-world location (`schema:Place`). This allows for the representation of mixed reality environments where virtual scenes are anchored to physical spaces.\n\t\t- 2. Social first: The `MetaverseAgent` class, with its subclasses `HumanAgent` and `AIAgent`, forms the foundation for social interactions within the metaverse. The `SocialRelationship` class, a subclass of `foaf:Relationship`, captures the connections and interactions among agents, enabling the formation of social networks and communities.\n\t\t- 3. Real-time interactive 3D graphics: The `MetaverseScene` class represents the 3D environments within the metaverse, while the `SceneObject` class represents the interactive objects within those scenes. The `PhysicalProperties` class captures the visual and spatial characteristics of objects, such as texture and mass, contributing to the realism and interactivity of the 3D graphics.\n\t\t- 4. Persistent: The ontology supports persistence through the `MetaverseEntity` class, which serves as the base class for all entities within the metaverse. By assigning unique identifiers as 64 byte strings from BIP85 nostr and similar derivation path, (e.g., `@id`) to instances of `MetaverseEntity` and its subclasses, the ontology enables the persistence and continuity of objects, agents, and scenes across sessions and platforms.\n\t\t- 5. Supports ownership: The `DigitalAsset` class represents unique digital goods and assets within the metaverse. The `hasOwner` property, which links `DigitalAsset` to `MetaverseAgent`, establishes the ownership relationship. The `hasCreator` property can be used to attribute the creation of digital assets to specific agents.\n\t\t- 6. Supports user-generated content: The ontology supports user-generated content through the `SceneObject` and `DigitalAsset` classes. Agents (`MetaverseAgent`) can create and manipulate instances of these classes, contributing to the dynamic and participatory nature of the metaverse.\n\t\t- 7. Open and extensible: The ontology is designed to be open and extensible, utilizing established ontologies like Schema.org and FOAF, and allowing for the integration of additional domain-specific ontologies as needed. The modular structure of the ontology, with its hierarchical class relationships and well-defined properties, facilitates the extension and customization of the metaverse model.\n\t\t- 8. Low-friction economic actors and actions: The `VirtualEconomy` class represents the economic system within the metaverse, encompassing trade, ownership, and currency exchange. The `Marketplace` class facilitates the listing and transaction of digital assets and services. The `TradeAction` class from Schema.org can be used to capture economic transactions between agents.\n\t\t- 9. Trusted and secure: The ontology incorporates trust and security mechanisms through classes like `PrivacySetting`, which represents an agent's privacy preferences, and `AccessControlList` from Schema.org, which can be used to define access rights and permissions for metaverse entities. The `ReputationScore` class provides a means to assess an agent's trustworthiness based on their interactions and behavior within the metaverse.\n\t\t- 10. Convergence of film and games: The ontology supports the convergence of film and games through the `MetaverseScene` and `MetaverseEvent` classes. Scenes can represent immersive, cinematic environments, while events can encompass interactive gameplay sessions or narrative-driven experiences. The `MetaverseAgent` class allows for the participation of both human users and AI-controlled characters, blurring the line between film and game experiences.\n\t\t- 11. Blurring of IP boundaries and narrative flow: The `Varset` class introduces the concept of variations or alternate versions of metaverse scenes and objects, enabling the creation of branching narratives and remixing of intellectual property. The `InteractionEvent` class captures the interactions between agents and objects, allowing for dynamic and emergent storytelling that blurs traditional narrative boundaries.\n\t\t- 12. Multimodal and hardware-agnostic: The ontology is designed to be multimodal and hardware-agnostic, focusing on the fundamental concepts and relationships within the metaverse rather than specific hardware implementations. Classes like `MetaverseAgent` and `MetaverseScene` can be instantiated across different platforms and devices, ensuring a consistent metaverse experience regardless of the hardware used.\n\t\t- 13. Mobile-first experiences: While the ontology itself is hardware-agnostic, it can be easily extended to incorporate mobile-specific considerations. For example, the `MetaverseScene` class could include properties like `isMobileOptimized` to indicate scenes that are designed for mobile devices, ensuring a seamless mobile-first experience.\n\t\t- 14. Safeguarding and governance: The ontology addresses safeguarding and governance through classes like `MetaversePolicy`, which represents the rules and regulations governing behavior and interactions within the metaverse. The `GovernanceStructure` class captures the decision-making processes and enforcement mechanisms that ensure the safety and well-being of metaverse participants.\n\t\t- 15. Scaffolded by GenAI: The integration of GenAI (Generative AI) within the metaverse is supported through the `AIAgent` class and its associated properties, such as `hasLearningModel` and `hasTrainingData`. These properties allow for the representation of AI agents with varying levels of autonomy and adaptability, capable of generating content, providing assistance, and engaging in dynamic interactions with human users.\n\t\t- 16. Supports Agentic AI actors: The `AIAgent` class, along with its subclasses and properties, enables the creation of agentic AI actors within the metaverse. The `AgentArchetype` class defines different roles and behaviors for AI agents, while properties like `hasAgentArchetype` and `hasEmotionalState` imbue them with personality and emotional intelligence. The `participatesIn` property allows AI agents to actively engage in metaverse scenes and events alongside human users.\n\t\t- 17. Digital Asset and Ownership: The `DigitalAsset` class represents unique digital goods and assets within the metaverse. It includes properties like `genesis` (Bitcoin transaction ID where the asset was created), `issuance` leveraging [[RGB and Client Side Validation]] ), `type` (specifies the type of asset), `currentOwner` (links to the current owner agent), and `ownershipHistory` (represents the chain of ownership transfers). The `OwnershipTransfer` class represents the transfer of ownership of a `DigitalAsset` between agents, capturing details such as the `from` agent (transferring ownership), `to` agent (receiving ownership), `timestamp`, and `transactionId` (associated Bitcoin/Lightning Network transaction ID).\n\t\t- 18. [[Bitcoin]] and [[Lightning and Similar L2]] Network Integration: The `MetaverseAgent` class includes properties like `bitcoinWallet` (Bitcoin address associated with the agent) and `lightningNode` (public key of the agent's Lightning Network node) to enable Bitcoin and Lightning Network integration. The `VirtualEconomy` class includes properties like `bitcoinNetwork` and `lightningNetwork` to represent the underlying Bitcoin and Lightning Network infrastructure on which the economy operates. Fiat money can run on [[Cashu]].\n\t\t- 19. Nostr Integration: The `NostrEvent` class represents an event published on the Nostr network, with properties like `relayUrl` (URL of the Nostr relay where the event was published), `kind` (type or category of the event), `content` (content of the message or event data), and `tags` (list of associated `NostrTag` instances). The `NostrTag` class represents a tag associated with a `NostrEvent`, providing context and metadata through properties like `type` (type of tag) and `value` (value of the tag).\n\t\t- 20. PKI and Wallets: The `MetaverseEntity` class includes properties like `publicKey` and `privateKey` to support public key infrastructure (PKI) for entity identification and authentication. The `MetaverseAgent` class includes a `wallet` property that links to a `schema:DigitalWallet` instance, representing the agent's digital wallet for managing various assets.\n\t\t- 21. All objects and agents and artifacts are nostr PKI pairs. BIP32 is used to derive the path m/44'/1237'/ (according to the [Nostr entry](https://nostr-nips.com/nip-06) on SLIP44). In this way all objects are globally and hierarchically referenceable.\n\n\t\t\t- ### Digital Asset and Ownership\n\n\t- #### Inclusive Digital Society\n\t\t- By overcoming barriers to entry for emerging markets and less developed\n\t\t  nations, a more inclusive digital society can be fostered. This\n\t\t  inclusivity will empower new ideas and perspectives, leading to a richer\n\t\t  and more diverse digital landscape.\n\n\t- #### Spatial and Augmented Reality Technologies\n\t\t- The incorporation of spatial and augmented reality technologies can\n\t\t  expand the possibilities within the Metaverse, allowing for more\n\t\t  immersive and interactive experiences. These technologies have the\n\t\t  potential to reshape digital society and redefine the ways in which\n\t\t  people interact with digital environments.\n\n\t- #### Continuous Evolution and Adaptation\n\t\t- As the digital landscape continues to evolve, the open-source Metaverse\n\t\t  system must be flexible and adaptable to meet changing needs and\n\t\t  expectations. Continuous innovation and collaboration within the\n\t\t  industry will be crucial for the success and longevity of the Metaverse\n\t\t  as a transformative digital society platform.\n\n\t- #### Embracing the Open-Source Metaverse Vision\n\t\t- To create a truly transformative and inclusive digital society, it is\n\t\t  essential to embrace the vision of an open-source Metaverse. By\n\t\t  fostering collaboration, promoting open standards, and integrating\n\t\t  advanced AI and ML technologies, the Metaverse can become a platform\n\t\t  that serves societal and business needs.\n\n\t- #### Fostering Collaboration and Inclusivity\n\t\t- Creating an inclusive digital society is a key goal for the open-source\n\t\t  Metaverse. By breaking down barriers and making the platform accessible\n\t\t  to a wider audience, new ideas and perspectives will enrich the digital\n\t\t  landscape and drive innovation.\n\n\t\t\t- #### 2024 top up report\n\t\t\t\t- (I agree with lots of this one, but it's pretty much the IMF fishing for power, hence distancing themselves from it in the actual text, while also pushing it out on all channels)\n\t\t\t\t- [Broadening the Gains from Generative AI: The Role of Fiscal Policies (imf.org)](https://www.imf.org/en/Publications/Staff-Discussion-Notes/Issues/2024/06/11/Broadening-the-Gains-from-Generative-AI-The-Role-of-Fiscal-Policies-549639)\n\t\t\t\t\t- [Fiscal Policy Can Help Broaden the Gains blog post based on it](https://www.imf.org/en/Blogs/Articles/2024/06/17/fiscal-policy-can-help-broaden-the-gains-of-ai-to-humanity)\n\t\t\t\t- **Increased Poverty Due to Robotization**:\n\t\t\t\t\t- Robotization may lead to increasing poverty, especially affecting workers at the bottom of the wage distribution. The analysis shows that robotization resulted in a small long-term increase in poverty, with one additional robot per thousand workers increasing the poverty rate by 0.3 percentage points, a 3 percent increase. This is particularly concerning because it highlights the risk of low-wage workers falling into poverty due to technological advancements​​.\n\t\t\t\t- **Costly Transitions from AI**:\n\t\t\t\t\t- The transition to AI could be very costly due to labour market mismatches and prolonged periods of unemployment. Workers might face barriers to mobility and endure long unemployment or retraining periods before securing new jobs. This technological displacement often affects older workers more severely, leading to a generation-long adjustment period​​.\n\t\t\t\t- **Rapid and Unfair Disruption**:\n\t\t\t\t\t- The document cites that the advent of AI is progressing \"inhumanely fast\" and may seem \"unbelievably unfair,\" indicating a rapid pace of technological change that could disrupt labor markets and exacerbate inequalities before society can adequately adjust​​.\n\t\t\t\t- **Displacement Across All Skill Levels**:\n\t\t\t\t\t- AI adoption is likely to unevenly affect labour markets, risking disruptions that could displace both low-skill and high-skill jobs. Unlike past waves of automation that primarily displaced blue-collar workers, AI threatens to displace white-collar jobs, further polarizing wages and employment and amplifying income and wealth inequality​​.\n\t\t\t\t- **Challenges for Emerging Markets**:\n\t\t\t\t\t- In emerging markets and developing economies, the adoption of AI solutions is constrained by weak digital infrastructure, a lack of a developed digital economy, and insufficient local AI expertise. This suggests that these regions might struggle significantly to keep pace with AI advancements, potentially widening the global digital divide​​.\n\t\t\t\t- **Need for Overhauled Governance and Social Systems**:\n\t\t\t\t\t- Governments must upgrade their administrative and governance capacities to effectively manage AI innovation and its impacts. This includes investing in talent, data, and resources and potentially establishing dedicated agencies to track AI developments. The document stresses the need for international cooperation and robust regulatory frameworks to manage the rapid evolution and broad implications of AI​​.\n\n\t\t- #### Digital Art Creation:\n\t\t\t- Artists are using Stable Diffusion to create stunning and innovative digital artworks, pushing the boundaries of artistic expression and exploring new creative frontiers.\n\t\t\t  Concept Visualization:\n\n\t- ## Digital Objects\n\t\t- [[NFTs]]\n\t\t- [[Digital Objects]]\n\n\t- ### Continuous Evolution and Adaptation:\n\t\t- As the digital landscape continues to evolve, the open-source Metaverse system must be flexible and adaptable to meet changing needs and expectations. Continuous innovation and collaboration within the industry will be crucial for the success and longevity of the Metaverse as a transformative digital society platform.\n\n\t- ### Embracing the Open-Source Metaverse Vision:\n\t\t- To create a truly transformative and inclusive digital society, it is essential to embrace the vision of an open-source Metaverse. By fostering collaboration, promoting open standards, and integrating advanced AI and ML technologies, the Metaverse can become a platform that serves societal and business needs.\n\n\t- ### E-commerce Workflow Automation\n\t\t- *Task:* Streamline online sales processes, particularly for digital or physical goods.\n\t\t- **Flodesk + Stripe (+ Zapier/Shipday)**\n\t\t\t- *Description:* Set up workflows combining Flodesk (email/checkout pages), Stripe (payments), Zapier (connecting apps), and potentially Shipday (delivery management for physical items) to automate order processing, shipping logistics, and customer communication (receipts).\n\t\t\t- *Cost:* Flodesk (~$38/mo), Stripe (per transaction fees), Zapier (free/paid), Shipday (free/paid).\n\t\t\t- *Website:* <!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!---->[Flodesk](https://flodesk.com/)<!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!---->, <!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!---->[Stripe UK](https://stripe.com/gb)<!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!---->, <!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!---->[Zapier](https://zapier.com/)<!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!---->, <!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!---->[Shipday](https://shipday.com/)<!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!---->\n\t-\n\n\t\t- # LINKED JSON\n\t\t\t- Finally the, to improve on the OWL by simplifying it, this is a version using [Linked-JSON](https://linkedobjects.org/Linked-JSON) (by [Melvin Carvalho](https://github.com/melvincarvalho)). Some details are lost.\n\t\t\t\t\t\t          hasSkillProfile SkillProfile\n\t\t\t\t\t\t          hasPrivacySetting PrivacySetting\n\t\t\t\t\t\t          hasReputationScore ReputationScore\n\t\t\t\t\t\t          hasWallet DigitalWallet\n\t\t\t\t\t\t          createsVariations SceneObject\n\t\t\t\t\t\t          hasInteractionPreference InteractionPreference\n\t\t\t\t\t\t      }\n\t\t\t\t\t\t      \n\t\t\t\t\t\t      class DigitalWallet {\n\t\t\t\t\t\t          rdfs:label \"Digital Wallet\"\n\t\t\t\t\t\t          rdfs:comment \"Represents the agent's wallet for managing digital assets and currencies.\"\n\t\t\t\t\t\t      }\n\t\t\t\t\t\t      \n\t\t\t\t   Consistent Use of Linked JSON Terms:\n\t\t\t\t   The document consistently uses Linked JSON-specific terms, such as \"linkedjson:Class\", \"linkedjson:ObjectProperty\", and \"linkedjson:DatatypeProperty\", to differentiate them from the original OWL terms.\n\t\t\t\t   This clarity helps in understanding that the document is referencing the Linked JSON schema and not just using OWL labels.\n\t\t\t\t   Overall, the converted Linked JSON document successfully represents the metaverse ontology, capturing the key elements, relationships, and constraints from the original OWL ontology. The use of Linked JSON-specific terms and the inclusion of the \"Axioms and Restrictions\" section further enhance the semantic expressiveness and ensure the integrity of the ontology.\n\t\t\t\t   \n\t\t\t\t   The document is well-structured, consistent, and adheres to the Linked JSON principles, making it suitable for use in semantic web applications and data integration scenarios.\n\t\t\t\t  ```\n\n- # Design formalisation\n\t- Here's the updated text to align with the Linked-JSON ontology:\n\t\t- 1. Fusing of digital and real life: The ontology accommodates the blending of digital and real-life experiences through the `MetaverseScene` class, which can have a `hasPhysicalCounterpart` property linking it to a real-world location (`schema:Place`). This allows for the representation of mixed reality environments where virtual scenes are anchored to physical spaces.\n\t\t- 2. Social first: The `MetaverseAgent` class, with its subclasses `HumanAgent` and `AIAgent`, forms the foundation for social interactions within the metaverse. The `SocialRelationship` class, a subclass of `foaf:Relationship`, captures the connections and interactions among agents, enabling the formation of social networks and communities.\n\t\t- 3. Real-time interactive 3D graphics: The `MetaverseScene` class represents the 3D environments within the metaverse, while the `SceneObject` class represents the interactive objects within those scenes. The `PhysicalProperties` class captures the visual and spatial characteristics of objects, such as texture and mass, contributing to the realism and interactivity of the 3D graphics.\n\t\t- 4. Persistent: The ontology supports persistence through the `MetaverseEntity` class, which serves as the base class for all entities within the metaverse. By assigning unique identifiers as 64 byte strings from BIP85 nostr and similar derivation path, (e.g., `@id`) to instances of `MetaverseEntity` and its subclasses, the ontology enables the persistence and continuity of objects, agents, and scenes across sessions and platforms.\n\t\t- 5. Supports ownership: The `DigitalAsset` class represents unique digital goods and assets within the metaverse. The `hasOwner` property, which links `DigitalAsset` to `MetaverseAgent`, establishes the ownership relationship. The `hasCreator` property can be used to attribute the creation of digital assets to specific agents.\n\t\t- 6. Supports user-generated content: The ontology supports user-generated content through the `SceneObject` and `DigitalAsset` classes. Agents (`MetaverseAgent`) can create and manipulate instances of these classes, contributing to the dynamic and participatory nature of the metaverse.\n\t\t- 7. Open and extensible: The ontology is designed to be open and extensible, utilizing established ontologies like Schema.org and FOAF, and allowing for the integration of additional domain-specific ontologies as needed. The modular structure of the ontology, with its hierarchical class relationships and well-defined properties, facilitates the extension and customization of the metaverse model.\n\t\t- 8. Low-friction economic actors and actions: The `VirtualEconomy` class represents the economic system within the metaverse, encompassing trade, ownership, and currency exchange. The `Marketplace` class facilitates the listing and transaction of digital assets and services. The `TradeAction` class from Schema.org can be used to capture economic transactions between agents.\n\t\t- 9. Trusted and secure: The ontology incorporates trust and security mechanisms through classes like `PrivacySetting`, which represents an agent's privacy preferences, and `AccessControlList` from Schema.org, which can be used to define access rights and permissions for metaverse entities. The `ReputationScore` class provides a means to assess an agent's trustworthiness based on their interactions and behavior within the metaverse.\n\t\t- 10. Convergence of film and games: The ontology supports the convergence of film and games through the `MetaverseScene` and `MetaverseEvent` classes. Scenes can represent immersive, cinematic environments, while events can encompass interactive gameplay sessions or narrative-driven experiences. The `MetaverseAgent` class allows for the participation of both human users and AI-controlled characters, blurring the line between film and game experiences.\n\t\t- 11. Blurring of IP boundaries and narrative flow: The `Varset` class introduces the concept of variations or alternate versions of metaverse scenes and objects, enabling the creation of branching narratives and remixing of intellectual property. The `InteractionEvent` class captures the interactions between agents and objects, allowing for dynamic and emergent storytelling that blurs traditional narrative boundaries.\n\t\t- 12. Multimodal and hardware-agnostic: The ontology is designed to be multimodal and hardware-agnostic, focusing on the fundamental concepts and relationships within the metaverse rather than specific hardware implementations. Classes like `MetaverseAgent` and `MetaverseScene` can be instantiated across different platforms and devices, ensuring a consistent metaverse experience regardless of the hardware used.\n\t\t- 13. Mobile-first experiences: While the ontology itself is hardware-agnostic, it can be easily extended to incorporate mobile-specific considerations. For example, the `MetaverseScene` class could include properties like `isMobileOptimized` to indicate scenes that are designed for mobile devices, ensuring a seamless mobile-first experience.\n\t\t- 14. Safeguarding and governance: The ontology addresses safeguarding and governance through classes like `MetaversePolicy`, which represents the rules and regulations governing behavior and interactions within the metaverse. The `GovernanceStructure` class captures the decision-making processes and enforcement mechanisms that ensure the safety and well-being of metaverse participants.\n\t\t- 15. Scaffolded by GenAI: The integration of GenAI (Generative AI) within the metaverse is supported through the `AIAgent` class and its associated properties, such as `hasLearningModel` and `hasTrainingData`. These properties allow for the representation of AI agents with varying levels of autonomy and adaptability, capable of generating content, providing assistance, and engaging in dynamic interactions with human users.\n\t\t- 16. Supports Agentic AI actors: The `AIAgent` class, along with its subclasses and properties, enables the creation of agentic AI actors within the metaverse. The `AgentArchetype` class defines different roles and behaviors for AI agents, while properties like `hasAgentArchetype` and `hasEmotionalState` imbue them with personality and emotional intelligence. The `participatesIn` property allows AI agents to actively engage in metaverse scenes and events alongside human users.\n\t\t- 17. Digital Asset and Ownership: The `DigitalAsset` class represents unique digital goods and assets within the metaverse. It includes properties like `genesis` (Bitcoin transaction ID where the asset was created), `issuance` leveraging [[RGB and Client Side Validation]] ), `type` (specifies the type of asset), `currentOwner` (links to the current owner agent), and `ownershipHistory` (represents the chain of ownership transfers). The `OwnershipTransfer` class represents the transfer of ownership of a `DigitalAsset` between agents, capturing details such as the `from` agent (transferring ownership), `to` agent (receiving ownership), `timestamp`, and `transactionId` (associated Bitcoin/Lightning Network transaction ID).\n\t\t- 18. [[Bitcoin]] and [[Lightning and Similar L2]] Network Integration: The `MetaverseAgent` class includes properties like `bitcoinWallet` (Bitcoin address associated with the agent) and `lightningNode` (public key of the agent's Lightning Network node) to enable Bitcoin and Lightning Network integration. The `VirtualEconomy` class includes properties like `bitcoinNetwork` and `lightningNetwork` to represent the underlying Bitcoin and Lightning Network infrastructure on which the economy operates. Fiat money can run on [[Cashu]].\n\t\t- 19. Nostr Integration: The `NostrEvent` class represents an event published on the Nostr network, with properties like `relayUrl` (URL of the Nostr relay where the event was published), `kind` (type or category of the event), `content` (content of the message or event data), and `tags` (list of associated `NostrTag` instances). The `NostrTag` class represents a tag associated with a `NostrEvent`, providing context and metadata through properties like `type` (type of tag) and `value` (value of the tag).\n\t\t- 20. PKI and Wallets: The `MetaverseEntity` class includes properties like `publicKey` and `privateKey` to support public key infrastructure (PKI) for entity identification and authentication. The `MetaverseAgent` class includes a `wallet` property that links to a `schema:DigitalWallet` instance, representing the agent's digital wallet for managing various assets.\n\t\t- 21. All objects and agents and artifacts are nostr PKI pairs. BIP32 is used to derive the path m/44'/1237'/ (according to the [Nostr entry](https://nostr-nips.com/nip-06) on SLIP44). In this way all objects are globally and hierarchically referenceable.\n\n\t\t\t- ### Digital Asset and Ownership\n\n\t- # Overview\n\t  \n\t  \n\t  The expansion of corporate metaverse platforms like [[NVIDIA Omniverse]] will make shared virtual spaces increasingly complex and vast, accommodating a multitude of digital twin models. This means users will be able to explore and interact with realistic replicas of real-world objects and environments, such as buildings, vehicles, or even entire cities.\n\t  \n\n\t- #### Inclusive Digital Society\n\t\t- By overcoming barriers to entry for emerging markets and less developed\n\t\t  nations, a more inclusive digital society can be fostered. This\n\t\t  inclusivity will empower new ideas and perspectives, leading to a richer\n\t\t  and more diverse digital landscape.\n\n\t- #### Spatial and Augmented Reality Technologies\n\t\t- The incorporation of spatial and augmented reality technologies can\n\t\t  expand the possibilities within the Metaverse, allowing for more\n\t\t  immersive and interactive experiences. These technologies have the\n\t\t  potential to reshape digital society and redefine the ways in which\n\t\t  people interact with digital environments.\n\n\t- #### Continuous Evolution and Adaptation\n\t\t- As the digital landscape continues to evolve, the open-source Metaverse\n\t\t  system must be flexible and adaptable to meet changing needs and\n\t\t  expectations. Continuous innovation and collaboration within the\n\t\t  industry will be crucial for the success and longevity of the Metaverse\n\t\t  as a transformative digital society platform.\n\n\t- #### Embracing the Open-Source Metaverse Vision\n\t\t- To create a truly transformative and inclusive digital society, it is\n\t\t  essential to embrace the vision of an open-source Metaverse. By\n\t\t  fostering collaboration, promoting open standards, and integrating\n\t\t  advanced AI and ML technologies, the Metaverse can become a platform\n\t\t  that serves societal and business needs.\n\n\t- #### Fostering Collaboration and Inclusivity\n\t\t- Creating an inclusive digital society is a key goal for the open-source\n\t\t  Metaverse. By breaking down barriers and making the platform accessible\n\t\t  to a wider audience, new ideas and perspectives will enrich the digital\n\t\t  landscape and drive innovation.\n\n\t\t- #### Digital Art Creation:\n\t\t\t- Artists are using Stable Diffusion to create stunning and innovative digital artworks, pushing the boundaries of artistic expression and exploring new creative frontiers.\n\t\t\t  Concept Visualization:\n\n\t- ### Continuous Evolution and Adaptation:\n\t\t- As the digital landscape continues to evolve, the open-source Metaverse system must be flexible and adaptable to meet changing needs and expectations. Continuous innovation and collaboration within the industry will be crucial for the success and longevity of the Metaverse as a transformative digital society platform.\n\n\t- ### E-commerce Workflow Automation\n\t\t- *Task:* Streamline online sales processes, particularly for digital or physical goods.\n\t\t- **Flodesk + Stripe (+ Zapier/Shipday)**\n\t\t\t- *Description:* Set up workflows combining Flodesk (email/checkout pages), Stripe (payments), Zapier (connecting apps), and potentially Shipday (delivery management for physical items) to automate order processing, shipping logistics, and customer communication (receipts).\n\t\t\t- *Cost:* Flodesk (~$38/mo), Stripe (per transaction fees), Zapier (free/paid), Shipday (free/paid).\n\t\t\t- *Website:* <!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!---->[Flodesk](https://flodesk.com/)<!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!---->, <!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!---->[Stripe UK](https://stripe.com/gb)<!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!---->, <!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!---->[Zapier](https://zapier.com/)<!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!---->, <!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!---->[Shipday](https://shipday.com/)<!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!----><!---->\n\t-\n\n\t\t\t- ##### On sale transfer\n\t\t\t\t- 20% of total sale amount into digital wallet of the creator. 80% oftotal sale amount into digital wallet of the seller.\n\t\t\t\t- NFT smart contracts hold an incredibly potential; an artists descendantsfinancially benefiting directly from the resale of a piece of work longafter the artist/museum’s/gallery or even state have turned to dust aslong as the original creator’s digital wallet is accessible, *theblockhain becomes an everlasting digital patron* ensuring\n\t\t\t\t- Proof of ownership is intuitively a pretty obvious application for thetechnology, but again it’s hard to justify the expense when the benefitsare so slim. [Bulldogs on theblockchain](https://www.bullishlybred.com/) is a clear gimmick, andmight even incentivise poor behaviours as there are two products herewhich are not necessarily aligned. Much has been written over the yearsabout [deeds to property](https://propy.com/browse/propy-nft/) beingpassed through blockchains, cutting out the middle man, but in the eventthat a house deed NFT was hacked and stolen it’s obviously not the casethat the property would then pass to the hacker.\n\t\t\t\t- As a gauge of how frothy this market still is it’s interesting to lookat the APE token which Yuga just launched. They airdropped 10,000 of thetokens free to each of the 10,000 NFT holders. This instantly created amulti-billion dollar market cap, and a top 50 ‘crypto’ out of thin air,based purely on their brand. It’s clear that there is both brand, and amarket here.\n\t\t\t\t  ![image](./assets/8b0f2b24b70d1083878b139fb04cb6001e4acf56.jpg)\n\t\t\t\t- A global industry with revenues over £120b, [with asciitilde half thepeople on the planet](https://www.wepc.com/news/video-game-statistics/)playing some form of games in 2021.\n\t\t\t\t- Some of the more interesting (less arcane)use cases identified in the thread are summarised very briefly below,again with comments as to how this might pertain to our metaverse applications.\n\t\t\t\t\t- Hobby tokens, demonstrating interest in an activity. This is potentially a metaverse adaptation of badges on a blazer in the real world, and might serve to drive communities in a metaverse. The same is true for activism and political alighnment. It’s a great idea and worth developing.\n\t\t\t\t\t- Professional Networks and qualification badges, like a LinkedIn qualification panel, but in the metaverse. A cisco NFT in the metaverse for a CCNA qualification makes intuitive sense.\n\t\t\t\t\t- Badges to indicate membership of distributed projects within a metaverse. This allows users to identify avatars with shared goals in the metaverse.\n\t\t\t\t\t- Retail incentives, like brand loyalty stamps or rewards for participation in marketing, or early access programmes. This is a true in a metaverse marketplace as it is in a real world coffee shop.\n\t\t\t\t\t- Multiplayer communities with incentives to hit collective milestones. “Collecting as a team sport”. This again seems like a great and intuitive opportunity, but is perhaps less suitable for our more business focussed space. User content submission and automatic monetisation when reused by brands, bonded to an NFT contract.\n\t\t\t\t\t- Customer Cohort NFTs: early adopters of successful brands would be able to prove the provenance of their enthusiasm for a new product, and this might unlock brand loyalty bonuses. It seems this wouldn’t be a transferable NFT, and is more like the “soulbound” idea advanced by Meta.\n\t\t\t\t\t- Education and Customer Support, think an NFT of a great score on reddit community support forums. A trusted community member badge, but visible in the metaverse. This is somewhat like the web of trust model advanced earlier in the book.\n\n\t\t- # LINKED JSON\n\t\t\t- Finally the, to improve on the OWL by simplifying it, this is a version using [Linked-JSON](https://linkedobjects.org/Linked-JSON) (by [Melvin Carvalho](https://github.com/melvincarvalho)). Some details are lost.\n\t\t\t\t\t\t          hasSkillProfile SkillProfile\n\t\t\t\t\t\t          hasPrivacySetting PrivacySetting\n\t\t\t\t\t\t          hasReputationScore ReputationScore\n\t\t\t\t\t\t          hasWallet DigitalWallet\n\t\t\t\t\t\t          createsVariations SceneObject\n\t\t\t\t\t\t          hasInteractionPreference InteractionPreference\n\t\t\t\t\t\t      }\n\t\t\t\t\t\t      \n\t\t\t\t\t\t      class DigitalWallet {\n\t\t\t\t\t\t          rdfs:label \"Digital Wallet\"\n\t\t\t\t\t\t          rdfs:comment \"Represents the agent's wallet for managing digital assets and currencies.\"\n\t\t\t\t\t\t      }\n\t\t- 13. Mobile-first experiences: While the ontology itself is hardware-agnostic, it can be easily extended to incorporate mobile-specific considerations. For example, the `MetaverseScene` class could include properties like `isMobileOptimized` to indicate scenes that are designed for mobile devices, ensuring a seamless mobile-first experience.\n\t\t- 14. Safeguarding and governance: The ontology addresses safeguarding and governance through classes like `MetaversePolicy`, which represents the rules and regulations governing behavior and interactions within the metaverse. The `GovernanceStructure` class captures the decision-making processes and enforcement mechanisms that ensure the safety and well-being of metaverse participants.\n\t\t- 15. Scaffolded by GenAI: The integration of GenAI (Generative AI) within the metaverse is supported through the `AIAgent` class and its associated properties, such as `hasLearningModel` and `hasTrainingData`. These properties allow for the representation of AI agents with varying levels of autonomy and adaptability, capable of generating content, providing assistance, and engaging in dynamic interactions with human users.\n\t\t- 16. Supports Agentic AI actors: The `AIAgent` class, along with its subclasses and properties, enables the creation of agentic AI actors within the metaverse. The `AgentArchetype` class defines different roles and behaviors for AI agents, while properties like `hasAgentArchetype` and `hasEmotionalState` imbue them with personality and emotional intelligence. The `participatesIn` property allows AI agents to actively engage in metaverse scenes and events alongside human users.\n\t\t- 17. Digital Asset and Ownership: The `DigitalAsset` class represents unique digital goods and assets within the metaverse. It includes properties like `genesis` (Bitcoin transaction ID where the asset was created), `issuance` leveraging [[RGB and Client Side Validation]] ), `type` (specifies the type of asset), `currentOwner` (links to the current owner agent), and `ownershipHistory` (represents the chain of ownership transfers). The `OwnershipTransfer` class represents the transfer of ownership of a `DigitalAsset` between agents, capturing details such as the `from` agent (transferring ownership), `to` agent (receiving ownership), `timestamp`, and `transactionId` (associated Bitcoin/Lightning Network transaction ID).\n\t\t- 18. [[Bitcoin]] and [[Lightning and Similar L2]] Network Integration: The `MetaverseAgent` class includes properties like `bitcoinWallet` (Bitcoin address associated with the agent) and `lightningNode` (public key of the agent's Lightning Network node) to enable Bitcoin and Lightning Network integration. The `VirtualEconomy` class includes properties like `bitcoinNetwork` and `lightningNetwork` to represent the underlying Bitcoin and Lightning Network infrastructure on which the economy operates. Fiat money can run on [[Cashu]].\n\t\t- 19. Nostr Integration: The `NostrEvent` class represents an event published on the Nostr network, with properties like `relayUrl` (URL of the Nostr relay where the event was published), `kind` (type or category of the event), `content` (content of the message or event data), and `tags` (list of associated `NostrTag` instances). The `NostrTag` class represents a tag associated with a `NostrEvent`, providing context and metadata through properties like `type` (type of tag) and `value` (value of the tag).\n\t\t- 20. PKI and Wallets: The `MetaverseEntity` class includes properties like `publicKey` and `privateKey` to support public key infrastructure (PKI) for entity identification and authentication. The `MetaverseAgent` class includes a `wallet` property that links to a `schema:DigitalWallet` instance, representing the agent's digital wallet for managing various assets.\n\t\t- 21. All objects and agents and artifacts are nostr PKI pairs. BIP32 is used to derive the path m/44'/1237'/ (according to the [Nostr entry](https://nostr-nips.com/nip-06) on SLIP44). In this way all objects are globally and hierarchically referenceable.\n\n\t- #### Continuous Evolution and Adaptation\n\t\t- As the digital landscape continues to evolve, the open-source Metaverse\n\t\t  system must be flexible and adaptable to meet changing needs and\n\t\t  expectations. Continuous innovation and collaboration within the\n\t\t  industry will be crucial for the success and longevity of the Metaverse\n\t\t  as a transformative digital society platform.\n\n\t- #### Embracing the Open-Source Metaverse Vision\n\t\t- To create a truly transformative and inclusive digital society, it is\n\t\t  essential to embrace the vision of an open-source Metaverse. By\n\t\t  fostering collaboration, promoting open standards, and integrating\n\t\t  advanced AI and ML technologies, the Metaverse can become a platform\n\t\t  that serves societal and business needs.\n\n\t- #### Fostering Collaboration and Inclusivity\n\t\t- Creating an inclusive digital society is a key goal for the open-source\n\t\t  Metaverse. By breaking down barriers and making the platform accessible\n\t\t  to a wider audience, new ideas and perspectives will enrich the digital\n\t\t  landscape and drive innovation.\n\n\t\t- #### Digital Art Creation:\n\t\t\t- Artists are using Stable Diffusion to create stunning and innovative digital artworks, pushing the boundaries of artistic expression and exploring new creative frontiers.\n\t\t\t  Concept Visualization:\n\n\t- #### Fostering Collaboration and Inclusivity\n\t\t- Creating an inclusive digital society is a key goal for the open-source\n\t\t  Metaverse. By breaking down barriers and making the platform accessible\n\t\t  to a wider audience, new ideas and perspectives will enrich the digital\n\t\t  landscape and drive innovation.\n\n\t- ### Biomedical:\n\t\t- As the digital landscape continues to evolve, the open-source Metaverse system must be flexible and adaptable to meet changing needs and expectations. Continuous innovation and collaboration within the industry will be crucial for the success and longevity of the Metaverse as a transformative digital society platform.\n\n\t- #### Fostering Collaboration and Inclusivity\n\t\t- Creating an inclusive digital society is a key goal for the open-source\n\t\t  Metaverse. By breaking down barriers and making the platform accessible\n\t\t  to a wider audience, new ideas and perspectives will enrich the digital\n\t\t  landscape and drive innovation.\n\n- ### VISA and Mastercard\n\t- Both major credit card companies are building out their “crypto”capabilities. Mastercard have [launched a back endplatform](https://finance.yahoo.com/news/mastercard-crypto-secure-200559003.html)to mitigate fraud when buying digital products with their cards. VISAhave announced a “[crypto business to business supportunit](https://investor.visa.com/news/news-details/2021/Visa-Introduces-Crypto-Advisory-Services-to-Help-Partners-Navigate-a-New-Era-of-Money-Movement/default.aspx)”.They have also [published a whitepaper](https://usa.visa.com/solutions/crypto/auto-payments-for-self-custodial-wallets.html)to allow users to improve their experience.\n\t- western union etc, moneygram, transfer-wise,\n\n- ## Computers breeding humans\n\t- We have become dependant on algorithmically generated personal feeds, we have lost the capacity to explore our digital society\n\t\t- [Where have all the websites gone? (fromjason.xyz)](https://www.fromjason.xyz/p/notebook/where-have-all-the-websites-gone/)\n\t- These platforms are very vulnerable and exposed to manipulation, especially as the previous guardrails are removed for profit margins.\n\t- These technologies are reductionist, which feels like a shortcut, but is actually a simplification across the manifold of American English, and is likely making people intellectually lazy.\n\t- Increasingly there will be no other choice, trending toward [[Human vs AI]].\n\n- ## See Also\n\t- [[Digital Society Harms]]\n\t- [[Death of the Internet]]\n\n- ### VISA and Mastercard\n\t- Both major credit card companies are building out their “crypto”capabilities. Mastercard have [launched a back endplatform](https://finance.yahoo.com/news/mastercard-crypto-secure-200559003.html)to mitigate fraud when buying digital products with their cards. VISAhave announced a “[crypto business to business supportunit](https://investor.visa.com/news/news-details/2021/Visa-Introduces-Crypto-Advisory-Services-to-Help-Partners-Navigate-a-New-Era-of-Money-Movement/default.aspx)”.They have also [published a whitepaper](https://usa.visa.com/solutions/crypto/auto-payments-for-self-custodial-wallets.html)to allow users to improve their experience.\n\t- western union etc, moneygram, transfer-wise,\n\n- ### Misc\n\t- [Nat Friedman Embraces AI to Translate the Herculaneum Papyri (bloomberg.com)](https://www.bloomberg.com/features/2024-ai-unlock-ancient-world-secrets/?leadSource=uverify%20wall)\n\t- https://www.youtube.com/watch?v=8Qq2KEvE_xo\n\t- [Home Page Digital Restoration Initiative (uky.edu)](https://www2.cs.uky.edu/dri/)\n\n- ## See Also\n\t- [[Digital Society Harms]]\n\t- [[Death of the Internet]]\n\t- [[Agents]]\n\t- [[Agentic Alliance]]\n\n- ### VISA and Mastercard\n\t- Both major credit card companies are building out their “crypto”capabilities. Mastercard have [launched a back endplatform](https://finance.yahoo.com/news/mastercard-crypto-secure-200559003.html)to mitigate fraud when buying digital products with their cards. VISAhave announced a “[crypto business to business supportunit](https://investor.visa.com/news/news-details/2021/Visa-Introduces-Crypto-Advisory-Services-to-Help-Partners-Navigate-a-New-Era-of-Money-Movement/default.aspx)”.They have also [published a whitepaper](https://usa.visa.com/solutions/crypto/auto-payments-for-self-custodial-wallets.html)to allow users to improve their experience.\n\n- ### Objects in our collaborative mixed reality\n\t- There has been a recent shift away from the ‘toxic’ moniker of NFT and toward ‘Digital objects’, and seem to be judged crucial to metaverse applications. The success of avatar [‘collectibles’ markets](https://medium.com/coinmonks/reddit-nft-success-ca2685163576)in the Reddit ecosystem, and Meta (ex Facebook) similarly divesting themselves of the NFT term seem to suggest a pivot point in the industry. Meta were encouraging adoption through zero fee incentives but were likely hanging their monetisation of their whole rebrand on taking a huge cut from NFT content creators on their platform. This seems to have failed and they are [windingup](https://help.instagram.com/1824155514623095) that part of their business.\n\t- We have potential paths to digital assets within future layer 3technologies ([RGB](https://www.rgb.tech/) & Pear Credits), but they’renot yet fit for purpose. There are compromise options already available,as below.\n\n- ##### 2.4.5 NFT marketplaces\n  NFT markets are far more centralised services which match 'owners' of digital assets with potential buyers. The concept is a staple of the more recent interpretation of Web3, even though in practice these seem to be centralised concerns. [Opensea](https://opensea.io/) claims to be the largest decentralised NFT marketplace, but they have the ability to [remove listings](https://thedefiant.io/sad-frogs-delisted-opensea/) in response to legal challenges. This seems to fly in the face of Web3 principles. NFTs are currently a [deeply flawed](https://tante.cc/2021/12/17/the-third-web/) technology but seem likely to persist and will be covered later.\n\n- ## See Also\n\t- [[Bitcoin]]\n\t- [[Lightning and Similar L2]]\n\t- [[Digital Asset Risks]]\n\n- ## Accessibility in Non-Immersive Software\n- While the focus has been on immersive technologies, non-immersive software also faces significant accessibility challenges. Ensuring that traditional software applications are accessible is critical to maintaining inclusivity in everyday digital interactions.\n\n- ### Misc\n\t- [Nat Friedman Embraces AI to Translate the Herculaneum Papyri (bloomberg.com)](https://www.bloomberg.com/features/2024-ai-unlock-ancient-world-secrets/?leadSource=uverify%20wall)\n\t- https://www.youtube.com/watch?v=8Qq2KEvE_xo\n\t- [Home Page Digital Restoration Initiative (uky.edu)](https://www2.cs.uky.edu/dri/)\n\n- ## See Also\n\t- [[Digital Society Harms]]\n\t- [[Death of the Internet]]\n\t- [[Agents]]\n\t- [[Agentic Alliance]]\n\n- ### VISA and Mastercard\n\t- Both major credit card companies are building out their “crypto”capabilities. Mastercard have [launched a back endplatform](https://finance.yahoo.com/news/mastercard-crypto-secure-200559003.html)to mitigate fraud when buying digital products with their cards. VISAhave announced a “[crypto business to business supportunit](https://investor.visa.com/news/news-details/2021/Visa-Introduces-Crypto-Advisory-Services-to-Help-Partners-Navigate-a-New-Era-of-Money-Movement/default.aspx)”.They have also [published a whitepaper](https://usa.visa.com/solutions/crypto/auto-payments-for-self-custodial-wallets.html)to allow users to improve their experience.\n\n- ### Objects in our collaborative mixed reality\n\t- There has been a recent shift away from the ‘toxic’ moniker of NFT and toward ‘Digital objects’, and seem to be judged crucial to metaverse applications. The success of avatar [‘collectibles’ markets](https://medium.com/coinmonks/reddit-nft-success-ca2685163576)in the Reddit ecosystem, and Meta (ex Facebook) similarly divesting themselves of the NFT term seem to suggest a pivot point in the industry. Meta were encouraging adoption through zero fee incentives but were likely hanging their monetisation of their whole rebrand on taking a huge cut from NFT content creators on their platform. This seems to have failed and they are [windingup](https://help.instagram.com/1824155514623095) that part of their business.\n\t- We have potential paths to digital assets within future layer 3technologies ([RGB](https://www.rgb.tech/) & Pear Credits), but they’renot yet fit for purpose. There are compromise options already available,as below.\n\n- ##### 2.4.5 NFT marketplaces\n  NFT markets are far more centralised services which match 'owners' of digital assets with potential buyers. The concept is a staple of the more recent interpretation of Web3, even though in practice these seem to be centralised concerns. [Opensea](https://opensea.io/) claims to be the largest decentralised NFT marketplace, but they have the ability to [remove listings](https://thedefiant.io/sad-frogs-delisted-opensea/) in response to legal challenges. This seems to fly in the face of Web3 principles. NFTs are currently a [deeply flawed](https://tante.cc/2021/12/17/the-third-web/) technology but seem likely to persist and will be covered later.\n\n- ## See Also\n\t- [[Bitcoin]]\n\t- [[Lightning and Similar L2]]\n\t- [[Digital Asset Risks]]\n\n- ## Accessibility in Non-Immersive Software\n- While the focus has been on immersive technologies, non-immersive software also faces significant accessibility challenges. Ensuring that traditional software applications are accessible is critical to maintaining inclusivity in everyday digital interactions.",
  "properties": {
    "id": "digital-signature-standards",
    "collapsed": "true",
    "- public-access": "true",
    "- ontology": "true",
    "- term-id": "BC-0030",
    "- preferred-term": "Digital Signature",
    "- source-domain": "blockchain",
    "- status": "complete",
    "- version": "1.0.0",
    "- last-updated": "2025-10-28",
    "- definition": "Cryptographic authentication mechanism within blockchain systems, providing essential functionality for distributed ledger technology operations and properties.",
    "- maturity": "mature",
    "- source": "[[ISO/IEC 23257:2021]], [[IEEE 2418.1]], [[NIST NISTIR]]",
    "- authority-score": "0.95",
    "- owl:class": "bc:DigitalSignature",
    "- owl:physicality": "VirtualEntity",
    "- owl:role": "Object",
    "- owl:inferred-class": "bc:VirtualObject",
    "- belongsToDomain": "[[CryptographicDomain]]",
    "- implementedInLayer": "[[SecurityLayer]]",
    "- is-subclass-of": "[[Blockchain Entity]], [[CryptographicPrimitive]]"
  },
  "backlinks": [],
  "wiki_links": [
    "Digital Society Harms",
    "Cashu",
    "CryptographicPrimitive",
    "Bitcoin",
    "Blockchain Entity",
    "SecurityLayer",
    "Digital Asset Risks",
    "NFTs",
    "Human vs AI",
    "ISO/IEC 23257:2021",
    "kraus2022facebook",
    "park2022metaverse",
    "Digital Objects",
    "Agents",
    "IEEE 2418.1",
    "NVIDIA Omniverse",
    "Death of the Internet",
    "NIST NISTIR",
    "RGB and Client Side Validation",
    "Agentic Alliance",
    "CryptographicDomain",
    "Decentralised Web",
    "Lightning and Similar L2"
  ],
  "ontology": {
    "term_id": "BC-0030",
    "preferred_term": "Digital Signature",
    "definition": "Cryptographic authentication mechanism within blockchain systems, providing essential functionality for distributed ledger technology operations and properties.",
    "source_domain": "blockchain",
    "maturity_level": null,
    "authority_score": 0.95
  }
}