{
  "title": "Consortium Blockchain",
  "content": "- ### OntologyBlock\n  id:: bc-0432-consortium-blockchain-ontology\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: BC-0432\n\t- preferred-term:: Consortium Blockchain\n\t- source-domain:: blockchain\n\t- status:: stub-needs-content\n\t- public-access:: true\n\t- content-status:: minimal-placeholder-requires-authoring\n\t- public-access:: true\n\t- definition:: A component of the blockchain ecosystem.\n\t- maturity:: draft\n\t- owl:class:: bc:ConsortiumBlockchain\n\t- owl:physicality:: ConceptualEntity\n\t- owl:role:: Concept\n\t- belongsToDomain:: [[BlockchainDomain]]\n\n## OWL Formal Semantics\n\n```clojure\n;; OWL Functional Syntax\n\n(Declaration (Class :ConsortiumBlockchain))\n\n;; Annotations\n(AnnotationAssertion rdfs:label :ConsortiumBlockchain \"Consortium Blockchain\"@en)\n(AnnotationAssertion rdfs:comment :ConsortiumBlockchain \"A component of the blockchain ecosystem.\"@en)\n\n;; Data Properties\n(AnnotationAssertion dcterms:identifier :ConsortiumBlockchain \"BC-0432\"^^xsd:string)\n```\n\n- ## About Consortium Blockchain\n  id:: consortium-blockchain-about\n\n  - Consortium blockchain, also known as federated blockchain, represents a semi-private distributed ledger architecture designed for collaborative use amongst a defined group of organisations whilst maintaining greater control and privacy than public blockchains. Unlike public blockchains where anyone can participate in consensus and read all data, consortium blockchains restrict participation to pre-approved member organisations, creating a trusted network where competitors can collaborate on shared business processes without revealing proprietary information to the public or unauthorised parties. This architecture addresses the fundamental tension in multi-organisational business networks between the need for transparency amongst trusted partners and the requirement for confidentiality from external observers and even some internal participants. Consortium blockchains employ [[Permissioned Network]] architectures where identity management systems authenticate participants, consensus mechanisms involve only authorised validator nodes, and [[Smart Contracts]] execute business logic agreed upon by consortium members. Major implementations include [[Hyperledger Fabric]] for general enterprise use, [[R3 Corda]] specifically designed for financial services, and [[Quorum]] (now [[Hyperledger Besu]]) developed initially by JP Morgan for banking consortia. These platforms enable industries to achieve benefits of blockchain technology including immutability, cryptographic security, and distributed consensus whilst maintaining regulatory compliance, commercial confidentiality, and performance requirements essential for enterprise adoption.\n\n  - ### Technical Architecture\n    - Consortium blockchain architecture fundamentally differs from public blockchain designs through its permissioning layers, governance structures, and flexible consensus mechanisms optimised for known participants rather than adversarial environments. The architecture typically implements a modular design separating identity management, consensus, smart contract execution, and data storage to enable customisation for specific consortium requirements. [[Hyperledger Fabric]] pioneered this modular approach with distinct components for the Membership Service Provider (MSP) handling identity and access control, orderer nodes managing consensus, peer nodes executing chaincode (smart contracts) and maintaining ledger state, and channels enabling private sub-networks within the broader consortium.\n    - Key components:\n      - [[Membership Service Provider]] - Cryptographic identity management system issuing X.509 certificates to authorised participants, defining roles and permissions through attribute-based access control, and enabling fine-grained authorisation policies for consortium governance\n      - [[Consensus Mechanisms for Permissioned Networks]] - Algorithms optimised for known participants including [[Raft]] for crash fault tolerance providing high throughput and low latency, [[Byzantine Fault Tolerant]] (BFT) protocols like [[PBFT]] for malicious participant tolerance, and [[Proof of Authority]] where designated validators rotate responsibility for block production\n      - [[Channels and Private Data Collections]] - Architectural patterns enabling selective data sharing within consortium, where channels create completely separate blockchains visible only to subset of members, and private data collections enable sharing encrypted data amongst specific organisations whilst hashes anchor to main channel for verification\n      - [[Pluggable Consensus and State Database]] - Modular architecture allowing consortia to select consensus algorithms and storage backends appropriate for their requirements, with options ranging from simple key-value stores to sophisticated SQL databases supporting complex queries\n      - [[Decentralised Identifiers]] (DIDs) and [[Verifiable Credentials]] - Emerging standards enabling interoperability between consortium networks and integration with self-sovereign identity systems for participant authentication\n      - [[Smart Contract Governance]] - Endorsement policies requiring specified subset of consortium members to validate transactions before commitment, enabling business rules where competitors must agree on shared state whilst protecting individual proprietary logic\n\n  - ### Key Features and Capabilities\n    - **Controlled Participation with Accountability**: Consortium blockchains require participants to authenticate using cryptographic identities issued by trusted certificate authorities, creating accountability whilst preserving pseudonymity where appropriate. Unlike public blockchains where participants operate anonymously, consortium members are known to governance structures, enabling legal recourse and regulatory compliance. [[Hyperledger Fabric]]'s Membership Service Provider (MSP) implements hierarchical identity structures where organisations manage their own members' certificates whilst the consortium governs organisation admission, enabling flexible trust models appropriate for industries from finance to supply chain.\n    - **Selective Transparency and Confidentiality**: Consortium blockchains enable nuanced data sharing policies where different information visibility rules apply to different participants. [[Channels]] in Hyperledger Fabric create completely separate ledgers visible only to authorised organisations, enabling competitors to participate in the same network infrastructure whilst maintaining confidentiality of bilateral transactions. [[Private Data Collections]] provide finer-grained privacy where transaction data is shared only amongst specific organisations whilst cryptographic hashes anchor to shared channels, enabling verification without disclosure.\n    - **High Performance and Scalability**: Permissioned consensus mechanisms achieve significantly higher transaction throughput than public blockchain consensus algorithms because validators are known, reducing network communication overhead and eliminating probabilistic settlement delays. [[R3 Corda]] achieves thousands of transactions per second by abandoning global state replication in favour of point-to-point communication between transaction participants, sharing data only with parties that need to know. [[Hyperledger Fabric]] channels enable horizontal scaling where adding channels increases overall network capacity without impacting existing channel performance.\n    - **Enterprise Integration and Interoperability**: Consortium blockchain platforms provide extensive integration capabilities with existing enterprise systems including [[Enterprise Resource Planning]] (ERP), [[Customer Relationship Management]] (CRM), and [[Supply Chain Management]] systems through RESTful APIs, message queues, and database connectors. [[Hyperledger Fabric]] supports smart contracts (chaincode) written in general-purpose languages including [[Go]], [[Java]], and [[JavaScript]], reducing barriers to enterprise adoption. Emerging standards like [[InterWork Alliance]] Token Taxonomy Framework enable interoperability between different consortium blockchain implementations.\n\n  - ### Industry Applications\n    - **Food Safety and Supply Chain Transparency**: [[IBM Food Trust]] built on [[Hyperledger Fabric]] connects food manufacturers, distributors, processors, retailers, growers, and other stakeholders in a consortium blockchain tracking food products from farm to table. [[Walmart]] pioneered the platform, reducing contamination source tracing time from 6 days to 2.2 seconds for mangoes, enabling rapid response to food safety incidents. Consortium participants include major global brands such as [[Carrefour]], [[Nestle]], [[Dole]], [[Tyson Foods]], [[Unilever]], and [[Golden State Foods]], with each organisation sharing specified information about product provenance, handling, and quality testing whilst protecting commercially sensitive data like pricing and inventory levels.\n      - Implementation details: Each supply chain participant operates Hyperledger Fabric peer nodes, submitting transactions documenting product transfers, quality inspections, and storage conditions. Smart contracts enforce data quality standards and automate alerts when products approach expiry or experience temperature excursions. Consumers can scan QR codes accessing verified product journey information without exposing supplier relationships.\n      - Benefits achieved: Rapid contamination source identification, reduced food waste through better inventory tracking, enhanced consumer trust through transparency, reduced paperwork and manual reconciliation, and enabling premium pricing for verified sustainable sourcing\n      - [[GS1]] standards for product identification, [[Internet of Things]] sensor integration, [[Distributed Ledger Technology]]\n    - **Financial Services and Securities Settlement**: [[R3 Corda]] consortium brings together over 300 financial institutions including banks, insurers, market infrastructure providers, and regulators to develop distributed ledger solutions for financial services. Unlike blockchain systems with global state, Corda implements a [[Directed Acyclic Graph]] structure where only transaction parties and observers see transaction details, meeting stringent financial privacy requirements. Major implementations include [[DTCC]]'s Trade Information Warehouse migration handling $11 trillion in derivatives contracts, and securities settlement systems reducing settlement time from T+2 to near-instantaneous.\n      - Implementation details: Financial agreements are modelled as [[States]] in Corda representing assets and obligations, with [[Contracts]] defining validity rules and [[Flows]] automating complex multi-party protocols for issuance, trading, and settlement. Notary nodes prevent double-spending without seeing transaction details, maintaining confidentiality whilst ensuring consensus on asset uniqueness.\n      - Benefits achieved: Settlement time reduction from days to minutes, operational cost reduction through automation of reconciliation, reduced counterparty risk through simultaneous exchange of assets, regulatory compliance through auditable transaction history, and enabling new financial products through programmable contracts\n      - [[Digital Asset Modeling Language]] (DAML), [[FIX Protocol]], [[ISO 20022]] messaging standards\n    - **Healthcare Data Exchange**: Healthcare consortium blockchains enable secure sharing of patient records, clinical trials data, and drug supply chain information amongst hospitals, pharmaceutical companies, insurers, and research institutions whilst maintaining [[HIPAA]] compliance and patient privacy. [[MedRec]] and similar systems use consortium blockchain to create comprehensive patient health timelines accessible to authorised providers, reducing duplicate testing and improving care coordination.\n      - Implementation details: Patient consent management through blockchain-based smart contracts controls which healthcare providers can access specific medical records, with cryptographic proofs enabling verification of data authenticity without central intermediaries. [[Pharmaceutical supply chain]] tracking on consortium blockchains combats counterfeit drugs, with participants including manufacturers, distributors, pharmacies, and regulatory authorities verifying authenticity at each transfer point.\n      - Benefits achieved: Reduced medical errors through comprehensive patient history, accelerated clinical trials through secure data sharing, combat counterfeit pharmaceuticals, patient data ownership and portability, interoperability between healthcare systems\n      - [[Fast Healthcare Interoperability Resources]] (FHIR) integration, [[Zero-Knowledge Proofs]] for privacy\n\n  - ### Standards and Governance\n    - **Standards**: Consortium blockchain standardisation efforts focus on interoperability, governance frameworks, and technical specifications. [[ISO/TC 307]] Blockchain and Distributed Ledger Technologies develops international standards including [[ISO 22739]] vocabulary, [[ISO/TR 23455]] governance framework, and [[ISO/TR 3242]] use cases. The [[Enterprise Ethereum Alliance]] publishes specifications for enterprise blockchain including client APIs and permissioning. [[Hyperledger Foundation]] under the [[Linux Foundation]] develops open-source consortium blockchain platforms with standardised architectural patterns. The [[InterWork Alliance]] creates token taxonomy frameworks enabling asset portability across different blockchain implementations.\n    - **Governance models**: Consortium blockchain governance operates at multiple levels including network governance determining membership and rules, technical governance managing protocol upgrades and infrastructure, and business governance defining consortium objectives and resource allocation. [[R3]] consortium initially operated with member fee funding and steering committees representing major banks, evolving to open-source model with [[Corda]] Network Foundation managing production network governance separately from R3's commercial platform development. [[Hyperledger Fabric]] networks typically implement tiered governance with consortium board making strategic decisions, technical committee managing infrastructure, and business network operators facilitating day-to-day operations. Governance frameworks must balance competing interests of consortium members, address conflict resolution, and enable decision-making without central authority.\n    - **Compliance**: Consortium blockchains must navigate complex regulatory landscapes varying by industry and jurisdiction. Financial services consortia operate under securities regulations, banking supervision, and anti-money laundering frameworks requiring transaction monitoring and reporting capabilities. [[GDPR]] compliance in European Union requires careful data architecture where personal data is stored off-chain with only cryptographic references on immutable ledger, enabling data deletion through cryptographic key destruction. [[Know Your Customer]] and [[Customer Due Diligence]] regulations necessitate identity verification integrated with consortium membership management. Regulatory uncertainty around smart contract legal enforceability drives development of [[Ricardian Contracts]] linking legal prose with executable code.\n\n  - ### Comparison with Alternatives\n    - Compared to [[Public Blockchain]]: Consortium blockchains sacrifice decentralisation and censorship resistance for performance, privacy, and regulatory compliance. Public blockchains like [[Bitcoin]] and [[Ethereum]] enable permissionless participation and resist central control but expose all transaction data publicly and require energy-intensive consensus mechanisms with probabilistic finality measured in minutes or hours. Consortium blockchains achieve transaction finality in seconds with deterministic consensus, handle thousands of transactions per second versus dozens for public chains, and enable selective data sharing essential for enterprise applications. However, consortium blockchains introduce trusted parties managing membership, creating potential censorship vectors and reducing neutrality valued in public systems.\n    - Compared to [[Traditional Databases with Multi-Party Access]]: Consortium blockchains provide cryptographic auditability, immutability guarantees, and elimination of central database administrators that could unilaterally modify records. Traditional shared databases require trusted operators and complex reconciliation processes when participants' copies diverge. Consortium blockchains create shared source of truth automatically maintained through consensus without trusted intermediary, reducing operational overhead and enabling real-time settlement of obligations. However, databases provide superior query performance, mature tooling, and proven disaster recovery procedures, making consortium blockchain appropriate primarily where multiple organisations with competing interests need irrefutable shared records.\n    - When to use consortium blockchain: Choose consortium blockchain when multiple organisations with partially aligned interests need to share data and execute business logic without central trusted party, when immutability and auditability are essential for compliance or dispute resolution, when participants require confidentiality from external parties and selective disclosure amongst members, or when eliminating reconciliation overhead between organisational silos provides significant value. Traditional databases suffice for single-organisation applications, and public blockchains are appropriate when permissionless access and censorship resistance outweigh privacy and performance considerations.\n\n  - ### Implementation Considerations\n    - **Technical requirements**: Implementing consortium blockchain requires distributed systems expertise, cryptographic understanding, and platform-specific knowledge. Infrastructure needs include redundant nodes for each participating organisation (typically 2-3 peers plus orderer/validator nodes for governance members), secure key management infrastructure potentially including [[Hardware Security Modules]], network connectivity with TLS encryption between all nodes, and monitoring systems tracking consensus participation and ledger synchronisation. Development teams need proficiency in smart contract languages specific to chosen platform ([[Solidity]] for Quorum, [[Chaincode]] in Go/Java/JavaScript for Hyperledger Fabric, [[Kotlin]] contracts for Corda) and integration patterns connecting blockchain with existing enterprise systems.\n    - **Organisational readiness**: Consortium formation requires significant organisational alignment amongst competitors or supply chain partners who must agree on governance structures, data sharing policies, technical standards, and cost allocation models. Legal frameworks must address intellectual property for shared smart contract code, liability for network outages or bugs, and dispute resolution mechanisms. Business process reengineering is often necessary to realise blockchain benefits, as organisations must standardise previously heterogeneous processes to operate on shared business network. Change management programmes should prepare staff for new ways of working where shared data reduces information asymmetries and automation through smart contracts may eliminate manual reconciliation roles.\n    - **Cost considerations**: Consortium blockchain implementation costs include platform licensing (for commercial offerings) or development effort (for open-source platforms), infrastructure for node operation (on-premises or cloud), smart contract development and auditing, integration with existing systems, and ongoing operational costs for network governance and infrastructure maintenance. [[Hyperledger Fabric]] being open-source avoids licensing fees but requires significant technical expertise. [[R3 Corda Enterprise]] provides commercial support, enhanced performance, and disaster recovery features for licensing fees. Initial implementation costs typically range from £250,000 to £2,000,000 depending on complexity and consortium size, with annual operational costs of £100,000 to £500,000 per organisation for infrastructure, staffing, and governance participation.\n    - **Timeline**: Consortium blockchain projects require substantial time for both technical implementation and organisational coordination. Typical timeline includes 3-6 months for consortium formation and governance framework design, 3-6 months for proof-of-concept development demonstrating core use cases, 6-12 months for production system development including smart contracts, integration, and security hardening, and 3-6 months for pilot deployment with initial participants before broader rollout. Total time from inception to production often spans 18-36 months. Accelerated deployments leveraging existing consortium frameworks like [[IBM Food Trust]] or [[Contour]] trade finance network can reduce timeline to 6-12 months by joining established business networks rather than creating new consortia.\n\n  - ### Major Implementations\n    - **IBM Food Trust (Hyperledger Fabric)**: The world's largest food safety blockchain consortium connects participants across the global food supply chain including retailers (Walmart, Carrefour, Kroger), food manufacturers (Nestle, Tyson Foods, Dole, Driscoll's, McCormick), distributors (McLane Company), and solution providers. The platform has traced millions of food products, with Walmart mandating supplier participation for leafy greens after successful pilots demonstrated dramatic improvement in contamination source tracing. The consortium governance model includes steering committee with major retailers and solution providers, technical working groups addressing integration challenges, and tiered membership levels enabling smaller suppliers to participate affordably.\n    - **R3 Corda Network**: The production Corda Network hosts over 300 participants including major banks (HSBC, BNP Paribas, Morgan Stanley, China Merchants Bank), insurance companies (MetLife, AXA), and market infrastructure (DTCC, SIX Digital Exchange). Major applications include [[DTCC]]'s Trade Information Warehouse handling post-trade processing for credit default swaps, [[Contour]] network for trade finance replacing letters of credit with blockchain-based trade finance guarantees, and [[HQLAx]] enabling high-quality liquid asset settlement for collateral management. Corda's unique architecture enabling point-to-point transaction sharing rather than global state replication proved essential for financial services privacy requirements whilst maintaining consensus on asset uniqueness through notary services.\n    - **We.Trade (Hyperledger Fabric)**: European trade finance consortium founded by major banks including Deutsche Bank, HSBC, KBC, Natixis, Nordea, Rabobank, Santander, Société Générale, and UniCredit to digitise trade finance processes for small and medium enterprises. The platform automates letter of credit issuance, tracks shipments, and executes smart contract-based payment releases when delivery conditions are met. Despite demonstrating technical viability and processing thousands of transactions, We.Trade faced challenges achieving critical mass adoption, highlighting the non-technical barriers to consortium blockchain success including competing commercial interests and incumbent system inertia.\n\n  - ### Challenges and Limitations\n    - Technical challenges include managing network governance and protocol upgrades across organisations with competing interests, where coordinating major version updates requires consensus amongst all participants who must upgrade nodes simultaneously to maintain network compatibility. [[State explosion]] can occur in consortium blockchains where ledger size grows unbounded, requiring sophisticated data archival and pruning strategies whilst maintaining cryptographic verifiability of historical transactions. [[Interoperability]] between different consortium blockchain platforms remains limited, with most implementations creating isolated networks that cannot easily exchange assets or verify credentials across platforms. [[Oracle problems]] persist where smart contracts require external data inputs, necessitating trusted oracle services or decentralised oracle networks introducing additional failure modes.\n    - Organisational challenges centre on consortium formation and sustainability, where competitors must agree to collaborate whilst protecting proprietary information and competitive positions. [[Free rider problems]] emerge when consortium benefits accrue unequally, with some members contributing disproportionate resources to network governance and infrastructure whilst others benefit without equivalent investment. [[Network effects]] create chicken-and-egg challenges where value requires critical mass of participants, but organisations hesitate to join unproven networks with few members. Commercial conflicts arise when consortium members compete in adjacent markets or when platform providers (like IBM or R3) compete with consortium member businesses.\n    - Scalability considerations include consensus mechanism performance limits where Byzantine fault tolerant protocols typically support 15-20 validator nodes before performance degrades significantly, potentially limiting consortium size or requiring tiered validator selection. [[Channel proliferation]] in Hyperledger Fabric networks can create operational complexity as number of bilateral channels grows quadratically with participants. [[Smart contract upgrades]] require governance processes managing backwards compatibility and migration of on-chain state to new contract versions.\n    - Security concerns include the risk of collusion amongst validator nodes in smaller consortia where Byzantine fault tolerance assumptions may not hold if economic incentives align consortium members to attack network integrity. [[Key management]] complexity increases in permissioned systems where organisations must secure both network operational keys and business transaction signing keys. [[Privacy vulnerabilities]] can emerge from traffic analysis or metadata leakage even in systems with strong cryptographic confidentiality guarantees.\n\n  - ### Future Directions\n    - Emerging trends include convergence of consortium blockchain with [[Decentralized Finance]] (DeFi) concepts, creating hybrid systems where permissioned enterprise networks interact with public blockchains for settlement or liquidity provision. [[Central Bank Digital Currencies]] (CBDCs) will likely employ consortium blockchain architectures where commercial banks operate validator nodes in networks governed by central banks, bridging traditional finance and distributed ledger technology.\n    - Planned improvements focus on cross-consortium interoperability through standards like [[Interledger Protocol]], [[Atomic Swaps]], and [[Cross-Chain Messaging]] protocols enabling asset transfers and data verification between different consortium implementations. [[Hyperledger Cactus]] specifically addresses blockchain interoperability for enterprise use cases. [[Modular blockchain architectures]] separate consensus, data availability, and execution layers, enabling consortia to customise tradeoffs between performance, security, and decentralisation.\n    - Research areas include [[Confidential Computing]] integration with consortium blockchain where [[Trusted Execution Environments]] like [[Intel SGX]] or [[AMD SEV]] enable computation on encrypted data, providing hardware-enforced confidentiality complementing cryptographic privacy. [[Post-quantum cryptography]] migration planning addresses long-term security of consortium blockchains storing high-value assets against future quantum computing threats. [[Formal verification]] of smart contracts using tools like [[Isabelle/HOL]] or [[Coq]] aims to mathematically prove correctness of critical business logic. [[Machine learning]] integration enables intelligent routing, fraud detection, and automated compliance monitoring in consortium networks. [[Sustainability]] initiatives focus on energy-efficient consensus mechanisms, with consortium blockchains already consuming orders of magnitude less energy than proof-of-work public blockchains due to optimised permissioned consensus algorithms.\n\n  - #\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Metaverse platforms continue to evolve with focus on interoperability and open standards\n  - Web3 integration accelerating with decentralised identity and asset ownership\n  - Enterprise adoption growing in virtual collaboration, training, and digital twins\n  - UK companies increasingly active in metaverse development and immersive technologies\n\n- Technical capabilities\n  - Real-time rendering at photorealistic quality levels\n  - Low-latency networking enabling seamless multi-user experiences\n  - AI-driven content generation and procedural world building\n  - Spatial audio and haptics enhancing immersion\n\n- UK and North England context\n  - Manchester: Digital Innovation Factory supports metaverse startups and research\n  - Leeds: Holovis leads in immersive experiences for entertainment and training\n  - Newcastle: University research in spatial computing and interactive systems\n  - Sheffield: Advanced manufacturing using digital twin technology\n\n- Standards and frameworks\n  - Metaverse Standards Forum driving interoperability protocols\n  - WebXR enabling browser-based immersive experiences\n  - glTF and USD for 3D asset interchange\n  - Open Metaverse Interoperability Group defining cross-platform standards\n\n## Metadata\n\n- **Last Updated**: 2025-11-16\n- **Review Status**: Automated remediation with 2025 context\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable\n\n\n## References and Further Reading\n    - [[Hyperledger Fabric Documentation]] - Comprehensive technical documentation for leading consortium blockchain platform\n    - [[R3 Corda Documentation]] - Technical specifications and tutorials for financial services DLT\n    - [[Blockchain for Business]] by Alistair Milne - Academic analysis of enterprise blockchain adoption\n    - [[ISO/TC 307 Blockchain Standards]] - International standardisation efforts for DLT\n    - [[Enterprise Ethereum Alliance Specifications]] - Technical standards for permissioned Ethereum deployments\n    - [[Governance of Blockchain Systems]] by Ying-Ying Hsieh et al. - Research on consortium governance challenges\n    - [[IBM Food Trust Case Study]] - Detailed analysis of supply chain consortium implementation\n    - [[DTCC Whitepaper on TIW Blockchain Migration]] - Financial services infrastructure transformation through DLT",
  "properties": {
    "id": "bc-0432-consortium-blockchain-ontology",
    "collapsed": "true",
    "- ontology": "true",
    "- term-id": "BC-0432",
    "- preferred-term": "Consortium Blockchain",
    "- source-domain": "blockchain",
    "- status": "stub-needs-content",
    "- public-access": "true",
    "- content-status": "minimal-placeholder-requires-authoring",
    "- definition": "A component of the blockchain ecosystem.",
    "- maturity": "draft",
    "- owl:class": "bc:ConsortiumBlockchain",
    "- owl:physicality": "ConceptualEntity",
    "- owl:role": "Concept",
    "- belongsToDomain": "[[BlockchainDomain]]"
  },
  "backlinks": [
    "BC-0493-real-estate-tokenization",
    "BC-0447-anti-counterfeiting",
    "BC-0494-property-registry",
    "BC-0445-conflict-mineral-tracking",
    "BC-0441-provenance-tracking",
    "BC-0444-luxury-goods-authentication",
    "BC-0442-pharmaceutical-traceability",
    "BC-0443-food-safety-blockchain"
  ],
  "wiki_links": [
    "Key management",
    "Carrefour",
    "Dole",
    "Digital Asset Modeling Language",
    "ISO/TC 307",
    "ISO/TC 307 Blockchain Standards",
    "Permissioned Network",
    "Solidity",
    "Go",
    "GDPR",
    "Ricardian Contracts",
    "Customer Relationship Management",
    "Walmart",
    "HIPAA",
    "Confidential Computing",
    "Privacy vulnerabilities",
    "Raft",
    "Hyperledger Foundation",
    "Unilever",
    "MedRec",
    "Tyson Foods",
    "Know Your Customer",
    "Interledger Protocol",
    "Blockchain for Business",
    "Supply Chain Management",
    "Fast Healthcare Interoperability Resources",
    "Decentralised Identifiers",
    "Membership Service Provider",
    "InterWork Alliance",
    "Isabelle/HOL",
    "Internet of Things",
    "Hyperledger Cactus",
    "Quorum",
    "FIX Protocol",
    "Kotlin",
    "JavaScript",
    "Verifiable Credentials",
    "Channels",
    "Hardware Security Modules",
    "Proof of Authority",
    "Public Blockchain",
    "ISO/TR 23455",
    "GS1",
    "Smart contract upgrades",
    "IBM Food Trust Case Study",
    "AMD SEV",
    "Atomic Swaps",
    "Post-quantum cryptography",
    "Oracle problems",
    "Directed Acyclic Graph",
    "Enterprise Resource Planning",
    "Interoperability",
    "Governance of Blockchain Systems",
    "R3",
    "Enterprise Ethereum Alliance Specifications",
    "R3 Corda Documentation",
    "Machine learning",
    "Free rider problems",
    "Contour",
    "ISO 22739",
    "Java",
    "Modular blockchain architectures",
    "Zero-Knowledge Proofs",
    "Nestle",
    "Enterprise Ethereum Alliance",
    "Sustainability",
    "Bitcoin",
    "R3 Corda Enterprise",
    "Customer Due Diligence",
    "Channel proliferation",
    "ISO 20022",
    "Golden State Foods",
    "Network effects",
    "Trusted Execution Environments",
    "Traditional Databases with Multi-Party Access",
    "Linux Foundation",
    "Corda",
    "BlockchainDomain",
    "Contracts",
    "Hyperledger Fabric Documentation",
    "Consensus Mechanisms for Permissioned Networks",
    "States",
    "DTCC",
    "Intel SGX",
    "IBM Food Trust",
    "R3 Corda",
    "State explosion",
    "Flows",
    "Distributed Ledger Technology",
    "Smart Contracts",
    "Private Data Collections",
    "Coq",
    "HQLAx",
    "Hyperledger Fabric",
    "Hyperledger Besu",
    "PBFT",
    "Byzantine Fault Tolerant",
    "Cross-Chain Messaging",
    "Formal verification",
    "Channels and Private Data Collections",
    "Ethereum",
    "Chaincode",
    "Central Bank Digital Currencies",
    "DTCC Whitepaper on TIW Blockchain Migration",
    "Pluggable Consensus and State Database",
    "ISO/TR 3242",
    "Smart Contract Governance",
    "Pharmaceutical supply chain",
    "Decentralized Finance"
  ],
  "ontology": {
    "term_id": "BC-0432",
    "preferred_term": "Consortium Blockchain",
    "definition": "A component of the blockchain ecosystem.",
    "source_domain": "blockchain",
    "maturity_level": null,
    "authority_score": null
  }
}