{
  "title": "AML KYC Compliance",
  "content": "- ### OntologyBlock\n  id:: bc-0476-aml-kyc-compliance-ontology\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: BC-0476\n\t- preferred-term:: AML KYC Compliance\n\t- source-domain:: blockchain\n\t- status:: stub-needs-content\n\t- public-access:: true\n\t- content-status:: minimal-placeholder-requires-authoring\n\t- public-access:: true\n\t- definition:: A component of the blockchain ecosystem.\n\t- maturity:: draft\n\t- owl:class:: bc:AMLKYCCompliance\n\t- owl:physicality:: ConceptualEntity\n\t- owl:role:: Concept\n\t- belongsToDomain:: [[BlockchainDomain]]\n\n## OWL Formal Semantics\n\n```clojure\n;; OWL Functional Syntax\n\n(Declaration (Class :AMLKYCCompliance))\n\n;; Annotations\n(AnnotationAssertion rdfs:label :AMLKYCCompliance \"AML KYC Compliance\"@en)\n(AnnotationAssertion rdfs:comment :AMLKYCCompliance \"A component of the blockchain ecosystem.\"@en)\n\n;; Data Properties\n(AnnotationAssertion dcterms:identifier :AMLKYCCompliance \"BC-0476\"^^xsd:string)\n```\n\n- ## About AML KYC Compliance\n  id:: aml-kyc-compliance-about\n\n  - Anti-Money Laundering (AML) and Know Your Customer (KYC) compliance represent the cornerstone of financial regulation in the cryptocurrency and blockchain industry. These regulatory frameworks aim to prevent illicit financial activities, including money laundering, terrorist financing, and fraud, by requiring financial institutions and Virtual Asset Service Providers (VASPs) to verify customer identities and monitor transactions for suspicious activity. The application of traditional banking AML/KYC requirements to the decentralised and pseudonymous nature of blockchain technology presents unique challenges and has driven innovation in compliance technology.\n\n  - The Financial Action Task Force (FATF), an intergovernmental organisation established in 1989, sets international standards for AML/KYC compliance through its 40 Recommendations. In June 2019, FATF explicitly extended these standards to virtual asset service providers, requiring them to implement the same rigorous customer due diligence procedures as traditional financial institutions. This regulatory expansion has fundamentally transformed the cryptocurrency industry, forcing exchanges, custodians, and other service providers to invest heavily in compliance infrastructure whilst maintaining the technological advantages of blockchain systems.\n\n  - The implementation of AML/KYC compliance in blockchain contexts involves a complex interplay of identity verification, transaction monitoring, risk assessment, and reporting obligations. Major cryptocurrency exchanges now employ sophisticated blockchain analytics tools to trace fund flows across public ledgers, identify high-risk transactions, and generate Suspicious Activity Reports (SARs) when appropriate. The cost of compliance has become substantial, with large exchanges spending tens of millions of pounds annually on compliance staff, technology, and legal counsel. Enforcement actions against non-compliant entities have reached record levels, with regulators imposing multi-billion pound fines on major cryptocurrency platforms that failed to implement adequate AML/KYC controls.\n\n  - ### Regulatory Framework\n\n    - **FATF Recommendations**: The Financial Action Task Force's 40 Recommendations form the global standard for combating money laundering and terrorist financing. Recommendation 15 specifically addresses new technologies, including virtual assets, whilst Recommendation 16 (the \"Travel Rule\") requires VASPs to obtain, hold, and transmit originator and beneficiary information for virtual asset transfers. The FATF's June 2019 guidance on virtual assets and VASPs created binding obligations for member countries to regulate cryptocurrency businesses.\n\n    - **Bank Secrecy Act (United States)**: The BSA requires financial institutions to assist government agencies in detecting and preventing money laundering. FinCEN's 2013 guidance confirmed that cryptocurrency exchanges and administrators qualify as Money Services Businesses (MSBs) and must register with FinCEN, implement AML programmes, and file SARs for suspicious transactions exceeding $2,000. The BSA also mandates Currency Transaction Reports (CTRs) for transactions over $10,000.\n\n    - **Fifth Anti-Money Laundering Directive (European Union)**: The 5AMLD, implemented in January 2020, brought cryptocurrency exchanges and custodian wallet providers within the scope of EU AML regulation. It requires member states to register and supervise VASPs, mandates customer due diligence, and extends beneficial ownership transparency requirements to cryptocurrency businesses. The 6AMLD, effective from December 2020, further harmonised money laundering offences across the EU and expanded criminal liability.\n\n    - **UK Money Laundering Regulations 2017**: Amended in 2020 to include cryptoasset exchange providers and custodian wallet providers, these regulations require FCA registration and compliance with customer due diligence, ongoing monitoring, and suspicious activity reporting. The FCA maintains a public register of compliant firms and has rejected numerous applications for failing to meet AML standards.\n\n    - **Enforcement Authorities**: Multiple regulatory bodies enforce AML/KYC requirements: FinCEN and the Office of Foreign Assets Control (OFAC) in the US; the Financial Conduct Authority (FCA) in the UK; the European Banking Authority (EBA) across the EU; and various national regulators in Asia-Pacific jurisdictions. These authorities coordinate through FATF to ensure consistent global standards.\n\n  - ### Compliance Requirements\n\n    - **Customer Identification Programme (CIP)**: VASPs must establish procedures to verify customer identities using reliable, independent documentation. This typically includes government-issued photo identification, proof of address, and increasingly, biometric verification through facial recognition or liveness detection. Customers must provide full legal names, dates of birth, residential addresses, and national identification numbers.\n\n    - **Customer Due Diligence (CDD)**: Standard CDD involves verifying customer identity, understanding the purpose and intended nature of the business relationship, and conducting ongoing monitoring of transactions. Risk-based approaches allow simplified due diligence for low-risk customers but require enhanced due diligence for high-risk categories, including politically exposed persons (PEPs), customers from high-risk jurisdictions, and those engaging in unusual transaction patterns.\n\n    - **Enhanced Due Diligence (EDD)**: For high-risk customers, VASPs must obtain additional information including source of wealth, source of funds, beneficial ownership structures, and purpose of transactions. EDD may involve senior management approval, more frequent monitoring, and additional verification steps. Transactions involving amounts exceeding certain thresholds (typically £10,000 or equivalent) automatically trigger EDD requirements.\n\n    - **Suspicious Activity Reporting**: VASPs must file SARs with financial intelligence units when transactions exhibit characteristics suggesting money laundering or terrorist financing. In the US, SARs must be filed within 30 days of detecting suspicious activity. The UK's National Crime Agency received over 3,000 SARs related to cryptocurrency in 2021, representing a 400% increase from 2019. Tipping off customers about SAR filings is prohibited and constitutes a criminal offence.\n\n    - **Record Keeping**: Regulatory requirements mandate retention of customer identification records for at least five years after account closure, and transaction records for at least five years after completion. Records must be readily accessible to regulators and law enforcement upon request. The immutability of blockchain records actually facilitates this requirement, though off-chain customer data requires secure storage solutions.\n\n    - **Transaction Monitoring**: Continuous monitoring systems must identify unusual patterns such as structuring (breaking large transactions into smaller amounts to avoid reporting thresholds), rapid movement of funds, transactions with high-risk jurisdictions, or mixing services that obscure fund provenance. Alert systems must flag transactions for human review based on configurable risk parameters.\n\n  - ### Technical Implementation\n\n    - **Blockchain Analytics Platforms**: Sophisticated tools trace cryptocurrency flows across public blockchains, identifying patterns associated with illicit activity. Leading platforms include:\n      - **Chainalysis**: Provides Know Your Transaction (KYT) real-time monitoring, Reactor investigation software, and Kryptos compliance data. Used by the IRS, FBI, and major exchanges worldwide. Can trace funds through mixers and privacy coins with varying degrees of success.\n      - **Elliptic**: Offers wallet screening, transaction monitoring, and investigation tools covering 99% of cryptocurrency trading volume across Bitcoin, Ethereum, and other major chains. Maintains a database of over 270 million cryptocurrency addresses associated with illicit activities.\n      - **CipherTrace**: Provides anti-money laundering, counter-terrorist financing, and fraud detection solutions. Acquired by Mastercard in 2021, signalling increasing mainstream adoption of blockchain compliance technology.\n      - **TRM Labs**: Focuses on DeFi protocol risk assessment and cross-chain transaction tracing, addressing the compliance challenges posed by decentralised exchanges and smart contract interactions.\n\n    - **Identity Verification Systems**: Digital identity verification has evolved significantly to meet VASP requirements:\n      - **Document Verification**: Automated systems extract and verify data from government-issued IDs using optical character recognition (OCR), check document security features, and validate against government databases.\n      - **Biometric Authentication**: Facial recognition compares submitted photos or videos against ID documents, whilst liveness detection prevents spoofing attacks using photographs or videos. Some jurisdictions now accept decentralised identity solutions based on blockchain credentials.\n      - **Age Verification**: Automated age estimation prevents underage access to cryptocurrency services whilst minimising data collection.\n\n    - **Risk Scoring Engines**: Machine learning models assess customer and transaction risk based on multiple factors including geographic location, transaction volume and velocity, counterparty relationships, historical behaviour, and blockchain analytics data. Risk scores determine the level of due diligence required and trigger alerts for high-risk activity.\n\n    - **Sanctions Screening**: Real-time screening against OFAC's Specially Designated Nationals (SDN) list, EU sanctions lists, and UN sanctions ensures VASPs do not facilitate transactions for sanctioned individuals or entities. Following Russia's invasion of Ukraine, sanctions compliance became particularly critical, with major exchanges blocking Russian users and freezing assets.\n\n  - ### Real-World Compliance Implementations\n\n    - **Coinbase (United States)**: The largest US cryptocurrency exchange maintains one of the most sophisticated compliance programmes in the industry. Coinbase employs over 300 compliance staff, implements risk-based KYC requiring government ID and facial recognition for all users, and uses proprietary blockchain analytics combined with Chainalysis to monitor over 1.5 billion transactions monthly. Coinbase files thousands of SARs annually and maintains relationships with over 40 regulatory agencies globally. The company spent approximately $150 million on compliance in 2021, representing roughly 5% of revenue. Coinbase's compliance-first approach enabled it to become the first major cryptocurrency exchange to achieve a US public listing in April 2021.\n\n    - **Kraken (United States)**: Operates in over 190 countries with tailored compliance programmes for each jurisdiction. Kraken implements tiered KYC, with basic identity verification (name, date of birth, country) for limited access, intermediate verification (government ID, proof of address) for standard features, and enhanced verification (source of funds documentation) for institutional clients. Following FinCEN enforcement actions, Kraken enhanced its transaction monitoring systems and increased compliance staff by 400% between 2019 and 2022.\n\n    - **Binance (Global)**: The world's largest cryptocurrency exchange by volume underwent significant compliance transformation following regulatory pressure. Initially operating with minimal KYC requirements, Binance faced investigations and enforcement actions in multiple jurisdictions. In response, Binance mandated KYC for all users in August 2021, appointed former US Treasury criminal investigator Greg Monahan as Chief Compliance Officer, and committed over $200 million to compliance infrastructure. Despite these efforts, Binance faced a $4.3 billion settlement with US authorities in November 2023 for historical AML violations, representing the largest corporate penalty in US history. The settlement required Binance to exit the US market and implement enhanced compliance monitoring.\n\n    - **Gemini (United States)**: Founded by the Winklevoss twins, Gemini positioned itself as a \"compliance-first\" exchange from inception. Registered as a New York Trust Company under the New York Department of Financial Services (NYDFS), Gemini implements bank-level AML/KYC controls including identity verification, ongoing monitoring, SAR filing, and OFAC sanctions screening. Gemini maintains hot wallet insurance and cold storage security whilst conducting annual SOC 2 Type 2 examinations. This compliance posture allowed Gemini to serve institutional clients and launch regulated cryptocurrency derivatives products.\n\n    - **Bitfinex (British Virgin Islands)**: Demonstrates the consequences of inadequate compliance. US authorities alleged Bitfinex's sister company Tether failed to implement adequate KYC controls, enabling money laundering. In 2021, Bitfinex and Tether settled with the New York Attorney General for $18.5 million, agreed to cease operations in New York, and committed to regular reporting of reserve assets. The case highlighted that offshore registration does not exempt VASPs from AML requirements when serving US customers.\n\n  - ### Enforcement Actions and Precedents\n\n    - **Binance $4.3 Billion Settlement (2023)**: The US Department of Justice, FinCEN, and OFAC imposed the largest-ever corporate penalty on Binance for systematic AML violations including failing to register as a money services business, failing to implement adequate AML programmes, and facilitating transactions with sanctioned jurisdictions including Iran, Cuba, and Syria. Binance admitted processing over $275 million in transactions with sanctioned entities and failing to report over 100,000 suspicious transactions. Founder Changpeng Zhao pleaded guilty to violating the Bank Secrecy Act and resigned as CEO.\n\n    - **BitMEX $100 Million Penalty (2021)**: The Seychelles-based derivatives exchange and its founders paid $100 million to FinCEN and the CFTC for operating an unregistered trading platform and violating AML laws. BitMEX wilfully failed to implement KYC procedures, allowing anonymous trading and facilitating money laundering. The exchange processed billions in cryptocurrency derivatives trades from US customers without proper BSA compliance.\n\n    - **BTC-e and Alexander Vinnik (2017-2020)**: The Russian-operated exchange BTC-e facilitated over $4 billion in money laundering before US authorities shut it down. Operator Alexander Vinnik faced charges for running an unlicensed money transmitting business and laundering proceeds from the Mt. Gox hack, ransomware attacks, and darknet marketplaces. The case demonstrated law enforcement's capability to trace cryptocurrency transactions and prosecute offshore operators serving US customers.\n\n    - **1Broker Shutdown (2018)**: US authorities seized 1Broker's domain and funds for operating an unregistered securities exchange and failing to implement AML controls. The platform allowed anonymous trading of securities-based swaps using Bitcoin, explicitly advertising its lack of KYC requirements. The case established that cryptocurrency-based platforms cannot circumvent securities registration and AML requirements by avoiding fiat currency.\n\n    - **ShapeShift KYC Mandate (2018)**: Following regulatory pressure, the formerly KYC-free cryptocurrency exchange ShapeShift implemented mandatory identity verification. While not a formal enforcement action, this voluntary compliance shift reflected the regulatory direction and the practical impossibility of operating a non-custodial exchange serving US customers without KYC.\n\n    - **UK FCA Registration Rejections (2020-2022)**: The FCA rejected 75% of cryptocurrency exchange applications for failing to meet AML standards, demonstrating strict enforcement of compliance requirements. Rejected firms included Bittylicious, Coinfloor, and multiple smaller exchanges that could not demonstrate adequate systems and controls, risk assessments, or financial crime prevention capabilities.\n\n  - ### Global Regulatory Landscape\n\n    - **United States**: FinCEN's 2013 guidance established cryptocurrency exchanges as Money Services Businesses subject to BSA requirements. The SEC regulates security tokens, whilst the CFTC oversees cryptocurrency derivatives. State-level money transmitter licences (MTLs) add complexity, with New York's BitLicence representing one of the strictest regimes. The infrastructure bill passed in 2021 included cryptocurrency tax reporting requirements, and proposed legislation seeks to further clarify regulatory jurisdiction.\n\n    - **European Union**: The 5AMLD and 6AMLD established harmonised AML standards across member states, though national implementation varies. MiCA (Markets in Crypto-Assets Regulation), fully applicable from December 2024, will create comprehensive licensing and AML requirements for crypto-asset service providers across the EU. Member state regulators include BaFin (Germany), AMF (France), and CONSOB (Italy), each implementing EU directives with local variations.\n\n    - **United Kingdom**: Following Brexit, the UK maintains alignment with EU AML standards whilst developing independent frameworks. The FCA's authorisation regime for cryptoasset businesses requires demonstration of robust AML systems before registration approval. The Economic Crime Bill 2022 strengthened enforcement powers and extended corporate criminal liability for money laundering failures.\n\n    - **Singapore**: The Monetary Authority of Singapore (MAS) requires cryptocurrency businesses to obtain a Payment Services Act licence, demonstrating AML/CFT controls comparable to traditional financial institutions. Singapore's risk-based approach allows innovation whilst maintaining strict compliance standards. Major exchanges including Crypto.com, Coinbase, and Independent Reserve hold Singapore licences.\n\n    - **Japan**: The Payment Services Act requires cryptocurrency exchanges to register with the Financial Services Agency (FSA), implement robust KYC/AML controls, and maintain capital reserves. Following the $530 million Coincheck hack in 2018, Japan strengthened custody and security requirements. The FSA conducts regular on-site inspections and has suspended or sanctioned multiple exchanges for compliance failures.\n\n    - **Hong Kong**: The Securities and Futures Commission (SFC) licences virtual asset trading platforms under an opt-in regime, requiring licensed exchanges to serve only professional investors. Proposed legislation would mandate licensing for all retail-accessible platforms, implementing comprehensive AML/KYC requirements aligned with FATF standards.\n\n    - **Switzerland**: FINMA's distributed ledger technology guidelines recognise different token categories (payment, utility, asset tokens) with tailored regulatory requirements. Swiss cryptocurrency businesses must comply with Anti-Money Laundering Act requirements, with the self-regulatory organisation VQF providing oversight for many firms.\n\n  - ### Compliance Challenges\n\n    - **Decentralised Finance (DeFi)**: Decentralised exchanges, lending protocols, and other DeFi applications operate without central intermediaries, creating fundamental tension with KYC requirements. Regulators increasingly expect DeFi developers and governance token holders to implement compliance controls, though the technical feasibility and philosophical compatibility remain contested. Some protocols implement optional KYC for higher transaction limits, whilst others explore decentralised identity solutions.\n\n    - **Privacy Preservation**: AML/KYC requirements fundamentally conflict with cryptocurrency's privacy promises. Privacy coins (Monero, Zcash) face delisting from compliant exchanges despite legitimate use cases. Balancing financial surveillance capabilities with individual privacy rights remains deeply contested, with some jurisdictions (particularly in the EU under GDPR) imposing strict data minimisation requirements that may conflict with AML record-keeping mandates.\n\n    - **Cross-Border Complexity**: Cryptocurrency's borderless nature clashes with jurisdiction-specific regulatory requirements. Exchanges serving global customers must implement varying KYC standards, sanctions screening for different lists, and transaction reporting to multiple authorities. Geographic blocking and licensing in specific jurisdictions adds operational complexity and cost.\n\n    - **Self-Hosted Wallet Oversight**: Approximately 60% of cryptocurrency holdings reside in self-hosted wallets beyond VASP control. The proposed EU \"Transfer of Funds Regulation\" would extend AML requirements to transfers between VASPs and self-hosted wallets, requiring VASPs to collect beneficiary information even for non-custodial transactions. This proposal faces significant opposition from privacy advocates and technical experts who question its enforceability.\n\n    - **Cost Burden**: Compliance costs disproportionately impact smaller VASPs and startups. Blockchain analytics subscriptions cost $50,000-$500,000 annually, compliance staff salaries average £80,000-£150,000, legal counsel fees reach millions for multi-jurisdictional operations, and technology infrastructure requires ongoing investment. These costs create barriers to entry and drive industry consolidation.\n\n    - **Emerging Technologies**: Layer-2 scaling solutions, cross-chain bridges, and new privacy-preserving technologies constantly evolve, challenging compliance monitoring systems. Zero-knowledge proofs could potentially enable compliance verification without exposing sensitive customer data, but regulatory acceptance remains uncertain.\n\n  - ### Best Practices\n\n    - **Risk-Based Approach**: Tailor KYC requirements to customer risk profiles rather than applying uniform measures. Low-risk customers might require basic identity verification for limited services, whilst high-risk customers undergo enhanced due diligence. Risk factors include jurisdiction, transaction volume, business type, and behavioural patterns.\n\n    - **Continuous Monitoring**: Implement real-time transaction monitoring rather than periodic reviews. Automated systems should flag unusual activity for human review, incorporating machine learning to reduce false positives whilst maintaining high detection rates. Regular customer rescreening against sanctions lists ensures ongoing compliance as designations change.\n\n    - **Technology Integration**: Integrate KYC verification into user onboarding flows to minimise friction. Automated document verification, biometric authentication, and instant ID checks reduce verification time from days to minutes whilst improving accuracy. API integrations with blockchain analytics providers enable real-time risk assessment of incoming deposits.\n\n    - **Compliance Programme Governance**: Establish board-level oversight of compliance functions with regular reporting on AML effectiveness. Designate a compliance officer with adequate resources and authority. Conduct independent audits of compliance systems annually. Document all policies, procedures, and risk assessments comprehensively.\n\n    - **Staff Training**: Provide comprehensive AML/KYC training to all staff handling customer interactions or transactions. Training should cover suspicious activity indicators, escalation procedures, sanctions screening, and jurisdiction-specific requirements. Annual refresher training ensures awareness of evolving risks and regulatory changes.\n\n    - **Collaborative Intelligence**: Participate in industry information-sharing initiatives to identify emerging money laundering typologies. VASP associations in various jurisdictions facilitate coordination with regulators and peer learning. Some jurisdictions allow or encourage SARs information sharing among financial institutions to detect cross-platform schemes.\n\n    - **Blockchain Forensics Capability**: Develop internal expertise in blockchain transaction analysis or maintain relationships with specialised forensic firms. Understanding fund flows, identifying mixing services, and recognising chain-hopping techniques improves detection of sophisticated laundering attempts.\n\n  - ### Future Developments\n\n    - **International Standards Harmonisation**: FATF continues refining virtual asset guidance, with the October 2021 update clarifying Travel Rule implementation expectations. Future revisions will likely address DeFi oversight, stablecoin regulation, and NFT platforms. Greater international coordination could reduce compliance complexity for global VASPs.\n\n    - **Decentralised Identity Solutions**: Blockchain-based identity credentials could enable portable KYC, allowing customers to verify identity once and reuse credentials across multiple platforms. Self-sovereign identity models give users control over personal data whilst proving verification to compliant VASPs. Standards like W3C Decentralised Identifiers (DIDs) and Verifiable Credentials are evolving toward regulatory acceptance.\n\n    - **AI and Machine Learning**: Advanced analytics will improve suspicious activity detection whilst reducing false positives that burden compliance teams. Natural language processing could analyse transaction metadata, whilst network analysis identifies complex money laundering structures across multiple blockchains and intermediaries.\n\n    - **Regulatory Technology (RegTech)**: Standardised reporting formats, automated compliance documentation, and regulatory APIs could reduce compliance costs. Shared utility platforms might provide KYC-as-a-service, allowing smaller VASPs to access enterprise-grade compliance technology. Real-time reporting to regulators could replace periodic filings.\n\n    - **Privacy-Preserving Compliance**: Zero-knowledge proofs and secure multi-party computation could theoretically enable compliance verification without exposing sensitive customer data to VASPs or even regulators. Research projects explore architectures where customers prove identity attributes (e.g., \"I am over 18 and not on sanctions lists\") without revealing actual identity. Regulatory acceptance will determine whether these approaches gain traction.\n\n    - **Embedded Compliance**: Next-generation blockchain protocols may incorporate compliance features at the base layer, enabling selective disclosure or automatic regulatory reporting whilst preserving appropriate privacy. Central Bank Digital Currencies (CBDCs) will likely include built-in compliance monitoring, raising questions about surveillance and financial privacy.\n\n  - #\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Metaverse platforms continue to evolve with focus on interoperability and open standards\n  - Web3 integration accelerating with decentralised identity and asset ownership\n  - Enterprise adoption growing in virtual collaboration, training, and digital twins\n  - UK companies increasingly active in metaverse development and immersive technologies\n\n- Technical capabilities\n  - Real-time rendering at photorealistic quality levels\n  - Low-latency networking enabling seamless multi-user experiences\n  - AI-driven content generation and procedural world building\n  - Spatial audio and haptics enhancing immersion\n\n- UK and North England context\n  - Manchester: Digital Innovation Factory supports metaverse startups and research\n  - Leeds: Holovis leads in immersive experiences for entertainment and training\n  - Newcastle: University research in spatial computing and interactive systems\n  - Sheffield: Advanced manufacturing using digital twin technology\n\n- Standards and frameworks\n  - Metaverse Standards Forum driving interoperability protocols\n  - WebXR enabling browser-based immersive experiences\n  - glTF and USD for 3D asset interchange\n  - Open Metaverse Interoperability Group defining cross-platform standards\n\n## Metadata\n\n- **Last Updated**: 2025-11-16\n- **Review Status**: Automated remediation with 2025 context\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable\n\n\n## References and Standards\n\n    - [[BC-0477-travel-rule]] - FATF Recommendation 16 implementation\n    - [[BC-0478-securities-regulation]] - Securities law application to crypto-assets\n    - [[BC-0479-stablecoin-regulation]] - AML requirements for stablecoin issuers\n    - [[BC-0401-blockchain]] - Underlying technology enabling transaction tracing\n    - [[BC-0455-blockchain-analytics]] - Technical approaches to transaction monitoring\n    - [[FATF]] - Financial Action Task Force standards and guidance\n    - [[FinCEN]] - US Financial Crimes Enforcement Network\n    - [[FCA]] - UK Financial Conduct Authority\n    - [[Virtual Asset Service Provider]] - FATF definition and requirements\n    - [[Know Your Customer]] - Identity verification principles\n    - [[Suspicious Activity Report]] - Reporting obligations\n    - [[Bank Secrecy Act]] - US AML statutory framework\n    - [[Fifth Anti-Money Laundering Directive]] - EU regulatory framework",
  "properties": {
    "id": "bc-0476-aml-kyc-compliance-ontology",
    "collapsed": "true",
    "- ontology": "true",
    "- term-id": "BC-0476",
    "- preferred-term": "AML KYC Compliance",
    "- source-domain": "blockchain",
    "- status": "stub-needs-content",
    "- public-access": "true",
    "- content-status": "minimal-placeholder-requires-authoring",
    "- definition": "A component of the blockchain ecosystem.",
    "- maturity": "draft",
    "- owl:class": "bc:AMLKYCCompliance",
    "- owl:physicality": "ConceptualEntity",
    "- owl:role": "Concept",
    "- belongsToDomain": "[[BlockchainDomain]]"
  },
  "backlinks": [
    "BC-0491-healthcare-records",
    "BC-0447-anti-counterfeiting",
    "BC-0477-travel-rule",
    "BC-0492-clinical-trials",
    "BC-0479-stablecoin-regulation",
    "BC-0478-securities-regulation",
    "BC-0480-cbdc-frameworks"
  ],
  "wiki_links": [
    "FinCEN",
    "BC-0455-blockchain-analytics",
    "Know Your Customer",
    "BC-0479-stablecoin-regulation",
    "BC-0477-travel-rule",
    "BC-0478-securities-regulation",
    "BlockchainDomain",
    "FCA",
    "Fifth Anti-Money Laundering Directive",
    "Virtual Asset Service Provider",
    "Suspicious Activity Report",
    "FATF",
    "Bank Secrecy Act",
    "BC-0401-blockchain"
  ],
  "ontology": {
    "term_id": "BC-0476",
    "preferred_term": "AML KYC Compliance",
    "definition": "A component of the blockchain ecosystem.",
    "source_domain": "blockchain",
    "maturity_level": null,
    "authority_score": null
  }
}