{
  "title": "Self Sovereign Identity",
  "content": "- ### OntologyBlock\n  id:: bc-0456-self-sovereign-identity-ontology\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: BC-0456\n\t- preferred-term:: Self Sovereign Identity\n\t- source-domain:: blockchain\n\t- status:: stub-needs-content\n\t- public-access:: true\n\t- content-status:: minimal-placeholder-requires-authoring\n\t- public-access:: true\n\t- definition:: A component of the blockchain ecosystem.\n\t- maturity:: draft\n\t- owl:class:: bc:SelfSovereignIdentity\n\t- owl:physicality:: ConceptualEntity\n\t- owl:role:: Concept\n\t- belongsToDomain:: [[BlockchainDomain]]\n\n## OWL Formal Semantics\n\n```clojure\n;; OWL Functional Syntax\n\n(Declaration (Class :SelfSovereignIdentity))\n\n;; Annotations\n(AnnotationAssertion rdfs:label :SelfSovereignIdentity \"Self Sovereign Identity\"@en)\n(AnnotationAssertion rdfs:comment :SelfSovereignIdentity \"A component of the blockchain ecosystem.\"@en)\n\n;; Data Properties\n(AnnotationAssertion dcterms:identifier :SelfSovereignIdentity \"BC-0456\"^^xsd:string)\n```\n\n- ## About Self Sovereign Identity\n  id:: self-sovereign-identity-about\n\n\t- Self-Sovereign Identity (SSI) represents a fundamental paradigm shift in digital identity management, transferring control from centralised authorities and federated identity providers to individual users themselves. In traditional identity systems, whether centralised databases maintained by governments and corporations, or federated models like [[OAuth]] and [[SAML]], users remain dependent on third-party organisations to assert, manage, and verify their identities. SSI proposes an alternative architecture where individuals hold cryptographically verifiable credentials in their own [[BC-0459-digital-identity-wallet|digital wallets]], present claims selectively to verifiers, and maintain ultimate authority over their identity data. Built on [[BC-0457-decentralized-identifiers|Decentralised Identifiers]] (DIDs) and [[BC-0458-verifiable-credentials|Verifiable Credentials]], SSI leverages [[BC-0435-hyperledger-indy|Hyperledger Indy]] and other blockchain technologies to create tamper-evident registries without requiring centralised identity databases. The approach addresses critical privacy concerns in an era of ubiquitous digital surveillance, data breaches, and identity theft. Rather than organisations accumulating vast repositories of personal data—prime targets for hackers—SSI distributes identity information to individual holders who reveal only the minimum necessary attributes for each interaction. This principle of selective disclosure, combined with cryptographic proofs, enables users to prove they are over 18 without revealing their exact birthdate, or demonstrate professional qualifications without exposing their complete employment history. The architecture aligns with regulatory frameworks including [[GDPR]], which enshrines rights to data portability and erasure, and is being actively implemented in government programmes from British Columbia's OrgBook containing over 1.4 million legal entities, to the European Union's Self-Sovereign Identity Framework (ESSIF) and emerging European Digital Identity Wallet mandated under eIDAS 2.0 regulation.\n\n\t- ### Technical Architecture\n\t\t- **Decentralised Identifier Foundation**: SSI systems rely on [[BC-0457-decentralized-identifiers|DIDs]] as persistent, cryptographically verifiable identifiers that individuals and organisations control without requiring centralised registration authorities. Unlike traditional identifiers such as email addresses or usernames tied to specific service providers, DIDs use the format `did:method:identifier` where the method specifies how to resolve the DID to its associated DID Document containing public keys, authentication methods, and service endpoints. The [[Sovrin Network]], built on [[BC-0435-hyperledger-indy|Hyperledger Indy]], implements the `did:sov` method, whilst Microsoft's ION network uses `did:ion` anchored to the [[Bitcoin]] which refers to The first decentralised peer-to-peer electronic cash system and cryptocurrency, implementing proof-of-work consensus, a fixed 21 million coin supply cap, and the UTXO transaction model, serving as the foundational reference implementation for blockchain technology. blockchain via the Sidetree protocol. This decentralisation ensures that identity remains persistent even if specific service providers disappear, addressing the fragility inherent in federated identity systems where account portability depends on continued operation of the identity provider.\n\n\t\t- **Cryptographic Trust Model**: Rather than institutional trust in centralised authorities, SSI establishes trust through public key cryptography and digital signatures. When an issuer such as a university creates a credential certifying a degree, it signs the credential with its private key. The corresponding public key, discoverable through the issuer's DID Document, allows any verifier to cryptographically confirm the credential's authenticity without contacting the issuer. This model dramatically reduces dependency on online verification services, enables offline credential verification in environments with limited connectivity, and prevents issuers from tracking when and where holders present credentials—a significant privacy improvement over centralised systems that log every verification request.\n\n\t\t- **Verifiable Data Registry**: SSI architectures employ various forms of verifiable data registries to anchor cryptographic commitments without storing personal data on-chain. [[BC-0435-hyperledger-indy|Hyperledger Indy]] maintains ledgers recording schemas, credential definitions, revocation registries, and DID Documents, but never the credentials themselves. The [[Sovrin Network]] operates as a permissioned blockchain with steward nodes distributed globally, whilst Microsoft ION uses Bitcoin's blockchain to anchor Sidetree operations containing batches of DID operations compressed and referenced via IPFS hashes. These registries provide tamper-evident records enabling verification of credential validity and revocation status whilst preserving privacy through data minimisation.\n\n\t\t- **Privacy-Preserving Protocols**: Advanced SSI implementations incorporate zero-knowledge proof capabilities enabling selective disclosure and predicate proofs. Using Camenisch-Lysyanskaya (CL) signatures implemented in [[BC-0435-hyperledger-indy|Hyperledger Indy]], credential holders can prove specific attributes (such as age over 18) without revealing the underlying data (their birthdate). Similarly, holders can demonstrate possession of credentials issued by trusted authorities without disclosing other credentials in their wallet. These cryptographic techniques prevent credential correlation across different verifiers—if a user presents a driving licence to rent a car and separately presents an educational credential to apply for a job, the two verifiers cannot collude to link these interactions to the same individual unless the user explicitly chooses to use the same DID for both transactions.\n\n\t- ### Core Principles of Self-Sovereignty\n\t\t- **Existence**: Users must have an independent existence beyond their digital identities. SSI recognises individuals as sovereign entities with inherent rights preceding any digital representation, establishing that identity systems serve people rather than people serving systems.\n\n\t\t- **Control**: Users must control their identities without depending on external administrative authorities. This extends beyond mere access rights to encompass the ability to create, update, and retire identifiers, choose which credentials to accept and retain, and determine precisely what information to disclose in each interaction.\n\n\t\t- **Access**: Users must have ready access to their own identity data and complete records of how that data has been used. SSI wallets maintain audit logs of credential issuance and presentation events, empowering users with transparency about their digital footprint whilst preventing identity providers from surveilling user activities.\n\n\t\t- **Transparency**: Systems and algorithms governing identity must be open and transparent. The open-source nature of platforms like [[BC-0435-hyperledger-indy|Hyperledger Indy]], along with public governance frameworks published by the [[Sovrin Network]] and [[Trust Over IP Foundation]], ensures that cryptographic methods, data models, and operational policies remain subject to public scrutiny rather than proprietary black boxes.\n\n\t\t- **Persistence**: Identities must remain available for as long as users require them, not subject to arbitrary expiration imposed by service providers. While specific credentials may expire (such as annual professional certifications), the underlying DIDs persist under user control, ensuring continuity of digital existence independent of any organisation's business decisions.\n\n\t\t- **Portability**: Identity information and credentials must be portable across contexts and service providers. Users should export their complete credential collection from one [[BC-0459-digital-identity-wallet|digital wallet]] and import it into another without loss of functionality, preventing vendor lock-in and ensuring competition in the identity service provider ecosystem.\n\n\t\t- **Interoperability**: Identities should be usable across widest possible contexts through adherence to open standards. [[W3C]] specifications for DIDs and Verifiable Credentials, combined with interoperability protocols from the [[Trust Over IP Foundation]], enable credentials issued by one implementation to be verified by any compliant verifier regardless of underlying blockchain or database technology.\n\n\t\t- **Consent**: Users must explicitly consent to any use of their identity data, with granular control over each disclosure. Unlike terms-of-service agreements bundling numerous permissions, SSI implements fine-grained consent at each credential presentation, with cryptographic proof of user authorization preventing unauthorised data sharing.\n\n\t\t- **Minimisation**: Identity disclosures should be limited to the minimum information necessary for each specific purpose. Selective disclosure mechanisms and zero-knowledge proofs enable verifiers to obtain only essential attributes, dramatically reducing privacy risks compared to monolithic identity documents revealing comprehensive personal details.\n\n\t\t- **Protection**: Users' rights to their identity data must be protected by those organisations claiming to represent or verify them. This principle imposes obligations on issuers and verifiers to implement appropriate technical and organisational safeguards, align with data protection regulations like [[GDPR]], and avoid practices that undermine user sovereignty such as correlation tracking or undisclosed data retention.\n\n\t- ### Standards Landscape\n\t\t- **W3C Specifications**: The [[W3C]] Decentralized Identifier (DID) v1.0 specification, published as a Recommendation in July 2022, provides the foundational standard for SSI identifiers, with v1.1 currently in Working Draft status incorporating refinements based on implementation experience. The [[W3C]] Verifiable Credentials Data Model v2.0, published as a Recommendation in May 2025, defines the data structure, semantics, and proof mechanisms for cryptographically verifiable credentials. Accompanying specifications including Verifiable Credential Data Integrity 1.0, Data Integrity EdDSA and ECDSA Cryptosuites, and Bitstring Status List v1.0 provide comprehensive technical infrastructure for SSI implementations.\n\n\t\t- **Trust Over IP Stack**: The [[Trust Over IP Foundation]], launched in May 2020 with 27 founding members and hosted by the Linux Foundation, defines a four-layer architecture combining technical and governance stacks. Layer One establishes decentralised trust roots using DIDs, Layer Two implements DIDComm protocol for secure peer-to-peer communication, Layer Three specifies credential exchange protocols based on [[W3C]] Verifiable Credentials, and Layer Four defines governance frameworks describing business, legal, and technical policies. This dual-stack approach recognises that technology alone cannot achieve interoperable digital trust—governance frameworks establishing accountability and dispute resolution mechanisms are equally essential.\n\n\t\t- **European Frameworks**: The European Self-Sovereign Identity Framework (ESSIF), launched in 2019 as part of the European Blockchain Services Infrastructure (EBSI), provides an eIDAS-compatible SSI architecture for cross-border public services across EU member states. The eIDAS 2.0 Regulation (EU 2024/1183), which entered into force in May 2024, mandates that all EU member states provide certified European Digital Identity Wallets to citizens and businesses by November 2026, with a target of 80% citizen availability by 2030. These wallets must support [[BC-0458-verifiable-credentials|Verifiable Credentials]], enable selective disclosure, and interoperate across jurisdictions whilst complying with strict privacy and security requirements. Over 350 companies and public authorities across 26 member states plus Norway, Iceland, and Ukraine participate in large-scale pilots testing these systems.\n\n\t\t- **Governance Frameworks**: The [[Sovrin Network]] pioneered comprehensive governance approaches with its Sovrin Governance Framework defining roles, responsibilities, and policies for network stewards, transaction endorsers, credential issuers, and other participants. The [[Trust Over IP Foundation]] has published metamodel specifications for describing trust frameworks in machine-readable formats, enabling automated policy enforcement and interoperability assessment. These frameworks address critical questions beyond technical protocols: who is liable when credentials contain errors? How are disputes resolved? What recourse exists if wallets are compromised? Effective SSI deployment requires answers embedded in legally binding governance structures.\n\n\t- ### Real-World Implementations\n\t\t- **British Columbia OrgBook**: The Government of British Columbia deployed one of the world's first production SSI systems using [[BC-0435-hyperledger-indy|Hyperledger Indy]] and the [[Sovrin Network]]. OrgBook BC provides a searchable public directory of verifiable credentials for registered organisations, containing over 1.4 million active legal entities and 3.8 million verifiable credentials as of 2021. Built on Hyperledger Aries Verifiable Credentials Registry architecture, the system enables government agencies to issue foundational credentials (business registrations, permits, licences) that organisations hold in digital wallets and present to other agencies or private sector verifiers. This eliminates redundant identity verification across different government services, dramatically reducing administrative burden. The system demonstrates SSI's capability to scale to jurisdictional levels whilst maintaining privacy—the public OrgBook contains only public business information, whilst private credentials for sensitive data remain under organisational control in their respective wallets.\n\n\t\t- **Sovrin Network Deployments**: The [[Sovrin Network]], a permissioned blockchain purpose-built for SSI on [[BC-0435-hyperledger-indy|Hyperledger Indy]], supports numerous production use cases across identity proofing, educational credentials, professional certifications, and supply chain verifications. The network's distributed steward nodes, operated by organisations globally under the Sovrin Governance Framework, provide decentralised infrastructure without relying on any single jurisdiction or corporate entity. Integration with the European Self-Sovereign Identity Consortium (ESSIC) enables interoperability between Sovrin-based systems and European EBSI infrastructure, demonstrating the network-of-networks approach essential for global SSI adoption.\n\n\t\t- **European Digital Identity Initiatives**: Countries including Germany, Portugal, Poland, and Austria have commenced issuing digital identity wallets to citizens following eIDAS 2.0 mandate timelines, with production deployments beginning in 2025. These implementations must support use cases spanning government services (tax filing, social benefits applications), private sector transactions (bank account opening, mobile phone contracts), and cross-border scenarios (presenting educational credentials obtained in one country to employers in another). The scale of ambition—wallets for 80% of EU citizens by 2030—represents the largest SSI deployment globally, with technical specifications developed through multi-stakeholder collaboration documented in the EU Digital Identity Wallet Architecture and Reference Framework.\n\n\t\t- **Educational Credentials**: Universities and credentialing organisations increasingly issue [[BC-0458-verifiable-credentials|Verifiable Credentials]] for degrees, transcripts, and micro-credentials. The Blockcerts standard, now aligned with [[W3C]] specifications, enables institutions to issue tamper-evident credentials anchored to [[Bitcoin]] which refers to The first decentralised peer-to-peer electronic cash system and cryptocurrency, implementing proof-of-work consensus, a fixed 21 million coin supply cap, and the UTXO transaction model, serving as the foundational reference implementation for blockchain technology. or [[Ethereum]] which refers to A component of the metaverse ecosystem focusing on ethereum. blockchains. The European Blockchain Services Infrastructure supports the European Student Card initiative enabling students to prove enrollment status, completed courses, and earned qualifications across member states without requiring centralised databases duplicating sensitive educational records. These implementations address credential fraud—estimated to cost the education sector billions annually—whilst empowering learners with portable, verifiable proof of achievements.\n\n\t- ### Privacy and Security\n\t\t- **Selective Disclosure Mechanisms**: Unlike traditional credentials like passports revealing comprehensive personal information whenever presented, SSI enables fine-grained disclosure control. Using zero-knowledge proofs and cryptographic commitments, holders prove specific claims (age over 18, residency in a particular country, possession of a professional licence) without revealing underlying data. [[BC-0435-hyperledger-indy|Hyperledger Indy]]'s implementation of Camenisch-Lysyanskaya signatures supports predicates enabling mathematical comparisons (age > 21, credit score > 700) proven cryptographically without disclosing actual values. This capability addresses privacy concerns whilst meeting verifier requirements for risk assessment and regulatory compliance.\n\n\t\t- **Correlation Resistance**: SSI architectures implement techniques preventing different verifiers from colluding to track individuals' activities. Pairwise DIDs—unique identifiers used for each relationship—prevent linking based on DID reuse. Cryptographic blinding when deriving proofs from credentials prevents signature-based correlation. Link secrets (cryptographic blinding factors) known only to the holder prevent issuers from tracking where credentials are presented. These layered protections ensure that even if multiple organisations verify the same individual's credentials, they cannot determine these verifications relate to the same person unless the individual explicitly chooses to enable such correlation.\n\n\t\t- **Key Management and Recovery**: The decentralised nature of SSI places critical importance on cryptographic key management. Loss of private keys controlling DIDs and wallets can result in permanent loss of access to credentials and digital identity. Implementations employ various strategies balancing security and recoverability: social recovery mechanisms requiring threshold numbers of trusted contacts to regenerate keys, secure hardware modules protecting keys from extraction, biometric authentication preventing unauthorised access, and encrypted cloud backups with user-controlled decryption keys. The [[Trust Over IP Foundation]]'s specifications for key management provide guidance on appropriate approaches for different risk contexts, recognising that requirements differ dramatically between consumer applications and high-assurance government or financial services.\n\n\t\t- **Revocation and Status Management**: Effective identity systems must support credential revocation when circumstances change—employees leaving organisations, licences expiring, or credentials issued in error. Traditional PKI revocation lists create privacy risks by enabling issuers to track verification attempts. SSI implementations address this through privacy-preserving revocation registries: [[BC-0435-hyperledger-indy|Hyperledger Indy]]'s cryptographic accumulator allows verifiers to check revocation status without revealing which credential is being verified, whilst the [[W3C]] Bitstring Status List v1.0 specification published in 2025 provides efficient status checking for credentials at scale. These mechanisms balance privacy protection with issuers' legitimate need to invalidate compromised or outdated credentials.\n\n\t- ### Regulatory Compliance\n\t\t- **GDPR Alignment**: SSI architectures align naturally with [[GDPR]] principles including data minimisation, purpose limitation, and user control. The Right to Data Portability (Article 20) maps directly to credential portability across wallets and service providers. The Right to Erasure (Article 17) is addressed through on-chain anchoring of cryptographic hashes rather than personal data—deleting credentials from wallets and removing DID Documents from registries achieves erasure whilst maintaining cryptographic integrity of remaining records. However, tensions exist: GDPR's requirement for identification of data controllers and processors conflicts with fully decentralised architectures where no single entity controls infrastructure. Governance frameworks must clearly delineate roles and responsibilities to ensure accountability whilst preserving decentralisation benefits.\n\n\t\t- **eIDAS 2.0 Compatibility**: The revised eIDAS Regulation explicitly embraces SSI through mandated Digital Identity Wallets supporting [[BC-0458-verifiable-credentials|Verifiable Credentials]] and [[BC-0457-decentralized-identifiers|DIDs]]. The regulation establishes legal recognition of qualified electronic signatures and seals created using wallet-based credentials, elevates privacy protections requiring selective disclosure capabilities, and mandates interoperability across member states. Technical specifications define standardised credential schemas for foundational attributes (legal identity, age, nationality), qualified attributes requiring higher assurance (professional qualifications, health data), and pseudonymous attributes enabling privacy-preserving interactions. Large-scale pilots testing cross-border use cases inform ongoing refinement of technical standards and operational policies.\n\n\t\t- **Know Your Customer (KYC) Integration**: Financial institutions subject to Anti-Money Laundering (AML) and KYC regulations require robust identity verification. SSI enables more efficient and privacy-preserving KYC through reusable identity verification credentials: customers undergo identity proofing once with a qualified trust service provider, receive a verifiable credential attesting to verified identity attributes and assurance level, then present this credential to multiple financial institutions without repeating verification processes. This approach reduces friction and cost whilst maintaining regulatory compliance. However, regulatory uncertainty persists regarding liability allocation when institutions rely on third-party issued credentials rather than conducting verification directly. Governance frameworks must clarify responsibilities and establish dispute resolution mechanisms to enable broader adoption.\n\n\t- ### Comparison with Traditional Identity Models\n\t\t- **Centralised vs Self-Sovereign**: Traditional centralised identity systems concentrate personal data in organisational databases creating single points of failure, attractive targets for attackers, and enabling mass surveillance. SSI distributes identity information to individual wallets, eliminating honeypots of personal data whilst empowering users with control. However, centralisation offers simpler operational models with clear accountability structures and established legal frameworks, whereas SSI requires new governance approaches and user assumption of key management responsibilities. The transition path involves hybrid models where SSI complements rather than replaces centralised systems, with credentials anchoring to trusted issuers whilst storage and presentation shift to user control.\n\n\t\t- **Federated vs Self-Sovereign**: Federated identity systems like [[OAuth]], [[SAML]], and OpenID Connect enable single sign-on across multiple service providers by delegating authentication to identity providers (e.g., \"Log in with Google\"). Whilst improving user experience compared to separate credentials for each service, federation creates dependencies on identity providers, enables tracking of user activity across services, and limits interoperability to pre-established trust relationships. SSI eliminates reliance on online identity provider availability, prevents tracking through pairwise DIDs and unlinkable presentations, and enables credential acceptance based on cryptographic verification rather than bilateral agreements. However, federation offers simpler integration for existing web services, whereas SSI requires wallet software deployment and new verification logic implementation.\n\n\t\t- **Migration Challenges**: Transitioning from established centralised and federated systems to SSI presents significant challenges. Existing identity infrastructure represents substantial sunk investment with operational processes, compliance frameworks, and user expectations built around current models. SSI adoption requires coordination across issuers, holders, and verifiers—the classic chicken-and-egg problem where users won't adopt wallets without useful credentials, issuers won't create credentials without wallet adoption, and verifiers won't accept credentials without established trust frameworks. Successful deployment strategies focus on use cases offering clear value propositions independent of network effects (such as educational credentials providing immediate benefit to holders) and on anchoring new SSI credentials to existing trusted authorities to leverage established institutional trust.\n\n\t- ### Challenges and Adoption Barriers\n\t\t- **Technical Complexity**: SSI introduces cryptographic concepts, distributed systems architecture, and new verification protocols unfamiliar to most developers and system administrators. Whilst frameworks like [[BC-0435-hyperledger-indy|Hyperledger Aries]] provide higher-level APIs abstracting complexity, integration with existing identity and access management systems requires expertise spanning blockchain, cryptography, and traditional IT infrastructure. The shortage of developers with requisite skills constrains deployment velocity, whilst the pace of standards evolution creates uncertainty about which specifications will achieve lasting adoption.\n\n\t\t- **User Experience**: Effective SSI requires users to understand concepts like private keys, credential schemas, and selective disclosure—abstractions foreign to most people's mental models of identity. Wallet interfaces must hide this complexity behind intuitive experiences matching users' expectations from familiar applications whilst maintaining security properties. Poor user experience in early implementations, particularly around key backup and recovery, has led to loss of credentials and digital identity, creating negative perceptions. Biometric authentication, social recovery mechanisms, and progressive disclosure of advanced features represent evolving approaches to balance usability and security.\n\n\t\t- **Governance Coordination**: Interoperable SSI ecosystems require coordination across multiple stakeholders with divergent interests: governments prioritising regulatory compliance and citizen protection, enterprises seeking efficiency and liability limitation, privacy advocates demanding maximal user control, and technology providers pursuing competitive advantage. Developing governance frameworks balancing these interests whilst maintaining flexibility for innovation presents ongoing challenges. The [[Trust Over IP Foundation]] and similar initiatives provide venues for multi-stakeholder collaboration, but translating consensus into operational reality across jurisdictions with different legal traditions and regulatory approaches remains complex.\n\n\t\t- **Regulatory Uncertainty**: Despite progress through eIDAS 2.0 and other frameworks, significant regulatory uncertainty persists. Questions remain about legal liability when credentials contain errors, enforceability of smart contracts governing credential issuance, applicability of data protection regulations to distributed ledgers, and cross-border recognition of credentials issued under different governance frameworks. This uncertainty deters risk-averse organisations, particularly in heavily regulated sectors like finance and healthcare, from committing to SSI implementations. Regulatory sandboxes enabling controlled experimentation under supervisory oversight provide mechanisms to address uncertainty through practice whilst building evidentiary basis for permanent frameworks.\n\n\t- ### Future Directions\n\t\t- **Mobile Driving Licences and Government Credentials**: Governments globally are piloting mobile driving licence (mDL) implementations following ISO/IEC 18013-5 standards, with several U.S. states and European countries deploying production systems. Integration with SSI wallets enables mDLs to serve as foundational credentials proving legal identity, age, and address with high assurance levels suitable for financial services onboarding, governmental service access, and other regulated contexts. Expansion to additional government-issued credentials (passports, national ID cards, residency permits) builds comprehensive digital identity portfolios portable across contexts.\n\n\t\t- **Cross-Border Identity Interoperability**: Current identity systems largely operate within national boundaries, creating friction for international travellers, remote workers, and global digital services. SSI's standards-based approach offers potential for credentials issued in one jurisdiction to be verified and accepted in others, contingent on establishment of mutual recognition frameworks. The eIDAS 2.0 requirement for wallet interoperability across EU member states provides large-scale testing ground, whilst bilateral agreements between EU and partner jurisdictions (potentially including post-Brexit UK, United States, and others) could extend interoperability globally. Technical standards are necessary but insufficient—political will and diplomatic coordination to align governance frameworks remain critical.\n\n\t\t- **Internet of Things and Machine Identity**: As IoT devices proliferate, secure device identity and authentication become critical. SSI principles apply equally to autonomous devices, industrial equipment, and AI agents requiring verifiable identity separate from human operators. DIDs enable devices to establish cryptographically verifiable identities, receive authorisation credentials defining permitted actions, and prove provenance and configuration integrity. Applications span autonomous vehicles proving regulatory compliance, medical devices demonstrating safety certifications, and smart city infrastructure authenticating to municipal systems. Scalability challenges intensify with potentially billions of devices requiring identity management at a scale unprecedented in human-centric systems.\n\n\t\t- **AI and Synthetic Identity**: The emergence of capable AI systems and proliferation of deepfakes create urgent need for distinguishing authentic human-generated content and interactions from synthetic productions. Verifiable credentials cryptographically binding content to verified human creators offer potential countermeasure to synthetic identity fraud and misinformation. However, privacy tensions arise—whilst attribution deters malicious synthetic content, mandatory identity disclosure could chill legitimate anonymous speech. Governance frameworks must balance authenticity verification, privacy protection, and free expression through context-appropriate disclosure requirements and technical privacy-enhancing mechanisms like zero-knowledge proofs of credential possession without identity revelation.\n\n\t- ### Related Concepts\n\t\t- [[BC-0457-decentralized-identifiers|Decentralised Identifiers]]\n\t\t- [[BC-0458-verifiable-credentials|Verifiable Credentials]]\n\t\t- [[BC-0459-digital-identity-wallet|Digital Identity Wallet]]\n\t\t- [[BC-0460-identity-verification|Identity Verification]]\n\t\t- [[BC-0435-hyperledger-indy|Hyperledger Indy]]\n\t\t- [[Sovrin Network]]\n\t\t- [[Trust Over IP Foundation]]\n\t\t- [[W3C]]\n\t\t- [[GDPR]]\n\t\t- [[eIDAS]]\n\t\t- [[OAuth]]\n\t\t- [[SAML]]\n\t\t- [[Bitcoin]] which refers to The first decentralised peer-to-peer electronic cash system and cryptocurrency, implementing proof-of-work consensus, a fixed 21 million coin supply cap, and the UTXO transaction model, serving as the foundational reference implementation for blockchain technology.\n\t\t- [[Ethereum]] which refers to A component of the metaverse ecosystem focusing on ethereum.\n\n\t- ### Original Content\n\t  collapsed:: true\n\t\t- ```\n\n\t\t  ```\n\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Metaverse platforms continue to evolve with focus on interoperability and open standards\n  - Web3 integration accelerating with decentralised identity and asset ownership\n  - Enterprise adoption growing in virtual collaboration, training, and digital twins\n  - UK companies increasingly active in metaverse development and immersive technologies\n\n- Technical capabilities\n  - Real-time rendering at photorealistic quality levels\n  - Low-latency networking enabling seamless multi-user experiences\n  - AI-driven content generation and procedural world building\n  - Spatial audio and haptics enhancing immersion\n\n- UK and North England context\n  - Manchester: Digital Innovation Factory supports metaverse startups and research\n  - Leeds: Holovis leads in immersive experiences for entertainment and training\n  - Newcastle: University research in spatial computing and interactive systems\n  - Sheffield: Advanced manufacturing using digital twin technology\n\n- Standards and frameworks\n  - Metaverse Standards Forum driving interoperability protocols\n  - WebXR enabling browser-based immersive experiences\n  - glTF and USD for 3D asset interchange\n  - Open Metaverse Interoperability Group defining cross-platform standards\n\n## Metadata\n\n- **Last Updated**: 2025-11-16\n- **Review Status**: Automated remediation with 2025 context\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable",
  "properties": {
    "id": "bc-0456-self-sovereign-identity-ontology",
    "collapsed": "true",
    "- ontology": "true",
    "- term-id": "BC-0456",
    "- preferred-term": "Self Sovereign Identity",
    "- source-domain": "blockchain",
    "- status": "stub-needs-content",
    "- public-access": "true",
    "- content-status": "minimal-placeholder-requires-authoring",
    "- definition": "A component of the blockchain ecosystem.",
    "- maturity": "draft",
    "- owl:class": "bc:SelfSovereignIdentity",
    "- owl:physicality": "ConceptualEntity",
    "- owl:role": "Concept",
    "- belongsToDomain": "[[BlockchainDomain]]"
  },
  "backlinks": [
    "BC-0491-healthcare-records",
    "BC-0493-real-estate-tokenization",
    "BC-0494-property-registry",
    "BC-0492-clinical-trials",
    "BC-0495-voting-systems"
  ],
  "wiki_links": [
    "Bitcoin",
    "BC-0459-digital-identity-wallet|digital wallets",
    "SAML",
    "W3C",
    "BC-0435-hyperledger-indy|Hyperledger Aries",
    "BC-0459-digital-identity-wallet|digital wallet",
    "Trust Over IP Foundation",
    "OAuth",
    "Sovrin Network",
    "Ethereum",
    "BC-0457-decentralized-identifiers|DIDs",
    "BC-0457-decentralized-identifiers|Decentralised Identifiers",
    "BlockchainDomain",
    "eIDAS",
    "BC-0435-hyperledger-indy|Hyperledger Indy",
    "BC-0459-digital-identity-wallet|Digital Identity Wallet",
    "BC-0458-verifiable-credentials|Verifiable Credentials",
    "BC-0460-identity-verification|Identity Verification",
    "GDPR"
  ],
  "ontology": {
    "term_id": "BC-0456",
    "preferred_term": "Self Sovereign Identity",
    "definition": "A component of the blockchain ecosystem.",
    "source_domain": "blockchain",
    "maturity_level": null,
    "authority_score": null
  }
}