{
  "title": "Snapshot Voting",
  "content": "- ### OntologyBlock\n  id:: bc-0469-snapshot-voting-ontology\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: BC-0469\n\t- preferred-term:: Snapshot Voting\n\t- source-domain:: blockchain\n\t- status:: stub-needs-content\n\t- public-access:: true\n\t- content-status:: minimal-placeholder-requires-authoring\n\t- public-access:: true\n\t- definition:: A component of the blockchain ecosystem.\n\t- maturity:: draft\n\t- owl:class:: bc:SnapshotVoting\n\t- owl:physicality:: ConceptualEntity\n\t- owl:role:: Concept\n\t- belongsToDomain:: [[BlockchainDomain]]\n\n## OWL Formal Semantics\n\n```clojure\n;; OWL Functional Syntax\n\n(Declaration (Class :SnapshotVoting))\n\n;; Annotations\n(AnnotationAssertion rdfs:label :SnapshotVoting \"Snapshot Voting\"@en)\n(AnnotationAssertion rdfs:comment :SnapshotVoting \"A component of the blockchain ecosystem.\"@en)\n\n;; Data Properties\n(AnnotationAssertion dcterms:identifier :SnapshotVoting \"BC-0469\"^^xsd:string)\n```\n\n- ## About Snapshot Voting\n  id:: snapshot-voting-about\n\t-\n\t- Snapshot has emerged as the dominant off-chain voting infrastructure for blockchain governance, serving over 10,000 organisations including virtually every major [[BC-0461-decentralized-autonomous-organization]] and DeFi protocol. The platform's core innovation lies in enabling gasless voting through cryptographic signatures (EIP-712) rather than on-chain transactions, eliminating the friction that plagued early governance systems where voters spent $50-$200 in gas fees per vote during Ethereum network congestion. By storing proposals and votes on the InterPlanetary File System ([[IPFS]]) with cryptographic verification, Snapshot achieves the verifiability of blockchain voting without the cost. This fundamental design choice has democratised participation—small token holders who previously couldn't afford to vote now participate freely, dramatically improving turnout rates. Major protocols like [[Aave]], [[Uniswap]], Compound, ENS, and Gitcoin conduct all governance votes through Snapshot, collectively representing hundreds of billions in total value locked.\n\t-\n\t- The technical architecture uses off-chain signature collection where voters sign messages containing their vote preference and proposal ID using their Ethereum wallet, which generates an EIP-712 structured signature requiring no gas. Snapshot's indexing infrastructure queries blockchain state at a specific historical block number (the \"snapshot block\") to determine each voter's token balance or voting power, then aggregates signed votes to compute results. This creates a trust model distinct from pure on-chain systems: whilst vote authenticity is cryptographically verifiable (anyone can validate signatures), vote counting relies on Snapshot's infrastructure and IPFS data availability. The platform addresses this through transparency (all votes publicly visible and verifiable), redundant IPFS pinning, and integration with on-chain execution mechanisms. SafeSnap and Reality.eth enable binding on-chain execution of Snapshot results—after a Snapshot vote passes, a bridging mechanism allows [[BC-0468-multi-sig-governance]] wallets or governance contracts to execute the outcome with cryptographic proof that it matches the off-chain vote. This hybrid architecture combines Snapshot's scalability and cost-efficiency with on-chain enforcement, creating a two-stage governance process: off-chain deliberation and signalling, then on-chain execution for binding changes.\n\t-\n\t- Snapshot's flexibility represents another major advantage. The platform supports numerous voting strategies beyond simple token-weighted voting, including: quadratic voting (implementing [[BC-0466-quadratic-voting]] off-chain), delegation (token holders delegate voting power to representatives), NFT-based voting (ownership of specific NFTs grants votes), whitelist voting (only approved addresses can vote), and complex multi-token strategies (combining multiple token balances with custom weights). This extensibility has spawned an ecosystem of custom strategies—as of 2024, over 500 distinct voting strategies exist, enabling governance experimentation impossible on-chain due to gas constraints. However, Snapshot's off-chain nature creates limitations and risks. Results are not self-executing—they require manual on-chain implementation, creating opportunities for execution failure or malicious deviation from voted outcomes. The platform also faces centralisation concerns around infrastructure dependency, and sophisticated attacks exploiting the snapshot block mechanism (flash loans, governance attacks, timing manipulation) require careful defence. Despite these trade-offs, Snapshot has become indispensable infrastructure, processing over 100,000 proposals and millions of votes since launch in 2020.\n\t-\n\t- ### Mathematical Foundation\n\t  collapsed:: true\n\t\t- Snapshot voting's mathematical foundation centres on cryptographic signature verification and weighted vote aggregation using historical blockchain state.\n\t\t-\n\t\t- **EIP-712 Structured Data Signing**: Votes use typed structured data signing per EIP-712:\n\t\t-\n\t\t- ```\n\t\t- TypedData = {\n\t\t-     types: {\n\t\t-         Vote: [\n\t\t-             { name: \"from\", type: \"address\" },\n\t\t-             { name: \"space\", type: \"string\" },\n\t\t-             { name: \"timestamp\", type: \"uint64\" },\n\t\t-             { name: \"proposal\", type: \"bytes32\" },\n\t\t-             { name: \"choice\", type: \"uint32\" },\n\t\t-             { name: \"metadata\", type: \"string\" }\n\t\t-         ]\n\t\t-     },\n\t\t-     domain: { name: \"snapshot\", version: \"0.1.4\" },\n\t\t-     message: { from: voter_address, space: \"aave.eth\", ... }\n\t\t- }\n\t\t- ```\n\t\t-\n\t\t- Voter signs this structured data with their private key, producing signature (r, s, v). Anyone can verify:\n\t\t-\n\t\t- `signer = ecrecover(keccak256(TypedData), v, r, s)`\n\t\t-\n\t\t- If `signer == voter_address`, the vote is authentic. No blockchain transaction required.\n\t\t-\n\t\t- **Snapshot Block Mechanism**: Voting power is determined at a specific historical block:\n\t\t-\n\t\t- `VotingPower(voter) = TokenBalance(voter, snapshot_block)`\n\t\t-\n\t\t- This prevents vote buying and manipulation—acquiring tokens after the snapshot doesn't grant voting power for that proposal. Snapshot block is typically set when proposal is created, several blocks in the past to prevent frontrunning.\n\t\t-\n\t\t- **Vote Aggregation Functions**: Different strategies aggregate votes differently:\n\t\t-\n\t\t- - **Linear (token-weighted)**: `TotalVotes_option = Σ(voters_for_option) TokenBalance(voter)`\n\t\t- - **Quadratic**: `TotalVotes_option = Σ(voters_for_option) √TokenBalance(voter)`\n\t\t- - **One-person-one-vote**: `TotalVotes_option = Count(voters_for_option)` if `TokenBalance(voter) > threshold`\n\t\t- - **Delegation**: `VotingPower(delegate) = TokenBalance(delegate) + Σ(delegators) TokenBalance(delegator)`\n\t\t-\n\t\t- **Multi-Strategy Composition**: Custom strategies can combine multiple sources:\n\t\t-\n\t\t- ```javascript\n\t\t- function customStrategy(voter, block) {\n\t\t-     let power = 0;\n\t\t-     power += balanceOf(TOKEN_A, voter, block) * 2;  // 2× weight for TOKEN_A\n\t\t-     power += balanceOf(TOKEN_B, voter, block);\n\t\t-     power += sqrt(balanceOf(LP_TOKEN, voter, block)) * 5;  // Quadratic for LP tokens\n\t\t-     if (ownsNFT(GOVERNANCE_NFT, voter, block)) power += 1000;  // Bonus for NFT\n\t\t-     return power;\n\t\t- }\n\t\t- ```\n\t\t-\n\t\t- **Quorum and Approval Thresholds**: Proposals pass based on configurable rules:\n\t\t-\n\t\t- - **Simple majority**: `Votes_for > Votes_against`\n\t\t- - **Supermajority**: `Votes_for > threshold × Total_votes` (e.g., threshold = 0.66 for 66%)\n\t\t- - **Absolute quorum**: `Total_votes > quorum_percentage × Total_possible_votes`\n\t\t- - **Approval voting**: `Votes_for / (Votes_for + Votes_against) > threshold` AND `Total_votes > quorum`\n\t\t-\n\t\t- **Security Against Double Voting**: Each voter address can vote once per proposal. The system checks:\n\t\t-\n\t\t- `votes[proposal_id][voter_address] == null` before accepting new vote\n\t\t-\n\t\t- If a duplicate vote is submitted, latest valid signature overwrites previous (allowing vote changes).\n\t\t-\n\t- ### Technical Implementation\n\t  collapsed:: true\n\t\t- Snapshot's architecture separates voter interfaces, signature collection, vote storage, and aggregation across distributed infrastructure.\n\t\t-\n\t\t- **Frontend and Signature Generation**:\n\t\t- Users interact with snapshot.org interface or custom DAO frontends. When voting, JavaScript prompts wallet signature:\n\t\t-\n\t\t- ```javascript\n\t\t- import { Web3Provider } from '@ethersproject/providers';\n\t\t- import snapshot from '@snapshot-labs/snapshot.js';\n\t\t-\n\t\t- const provider = new Web3Provider(window.ethereum);\n\t\t- const signer = provider.getSigner();\n\t\t-\n\t\t- const vote = {\n\t\t-     space: 'aave.eth',\n\t\t-     proposal: '0x1234...abcd',\n\t\t-     type: 'single-choice',\n\t\t-     choice: 1,  // Option index\n\t\t-     metadata: JSON.stringify({})\n\t\t- };\n\t\t-\n\t\t- const signature = await signer._signTypedData(\n\t\t-     snapshot.utils.domain,\n\t\t-     snapshot.utils.types,\n\t\t-     vote\n\t\t- );\n\t\t-\n\t\t- // Submit to Snapshot hub\n\t\t- await snapshot.utils.sendVote(vote, signature);\n\t\t- ```\n\t\t-\n\t\t- **Hub (Relayer) Infrastructure**:\n\t\t- Snapshot operates \"hubs\" that receive signed votes, validate signatures, and publish to IPFS:\n\t\t-\n\t\t- ```python\n\t\t- def process_vote(vote, signature):\n\t\t-     # Verify signature authenticity\n\t\t-     signer = recover_signer(vote, signature)\n\t\t-     if signer != vote['from']:\n\t\t-         raise InvalidSignature\n\t\t-\n\t\t-     # Query voting power at snapshot block\n\t\t-     voting_power = get_voting_power(\n\t\t-         voter=vote['from'],\n\t\t-         space=vote['space'],\n\t\t-         proposal=vote['proposal']\n\t\t-     )\n\t\t-\n\t\t-     if voting_power == 0:\n\t\t-         raise NoVotingPower\n\t\t-\n\t\t-     # Store vote on IPFS\n\t\t-     ipfs_hash = ipfs.add(json.dumps({\n\t\t-         'vote': vote,\n\t\t-         'signature': signature,\n\t\t-         'voting_power': voting_power,\n\t\t-         'timestamp': int(time.time())\n\t\t-     }))\n\t\t-\n\t\t-     # Index in database for fast querying\n\t\t-     db.votes.insert({\n\t\t-         'proposal_id': vote['proposal'],\n\t\t-         'voter': vote['from'],\n\t\t-         'choice': vote['choice'],\n\t\t-         'voting_power': voting_power,\n\t\t-         'ipfs': ipfs_hash\n\t\t-     })\n\t\t-\n\t\t-     return ipfs_hash\n\t\t- ```\n\t\t-\n\t\t- **Voting Power Calculation (Strategies)**:\n\t\t- Snapshot uses \"strategies\" to compute voting power from blockchain state. Each strategy is a JavaScript function:\n\t\t-\n\t\t- ```javascript\n\t\t- // Example: ERC20 balance-of strategy\n\t\t- export async function strategy(\n\t\t-     space, network, provider, addresses, options, snapshot\n\t\t- ) {\n\t\t-     const blockTag = typeof snapshot === 'number' ? snapshot : 'latest';\n\t\t-\n\t\t-     const contract = new Contract(options.address, erc20ABI, provider);\n\t\t-\n\t\t-     // Batch fetch balances for all voters\n\t\t-     const balances = await multicall(\n\t\t-         network,\n\t\t-         provider,\n\t\t-         erc20ABI,\n\t\t-         addresses.map(address => [\n\t\t-             options.address,\n\t\t-             'balanceOf',\n\t\t-             [address]\n\t\t-         ]),\n\t\t-         { blockTag }\n\t\t-     );\n\t\t-\n\t\t-     // Return mapping of address -> voting power\n\t\t-     return Object.fromEntries(\n\t\t-         addresses.map((address, i) => [\n\t\t-             address,\n\t\t-             parseFloat(formatUnits(balances[i], options.decimals))\n\t\t-         ])\n\t\t-     );\n\t\t- }\n\t\t- ```\n\t\t-\n\t\t- **IPFS Storage and Pinning**:\n\t\t- All proposals and votes are stored on IPFS for tamper-proof archival:\n\t\t- - Multiple pinning services ensure availability (Pinata, Infura IPFS, Snapshot's nodes)\n\t\t- - Content-addressed storage: hash uniquely identifies data\n\t\t- - Anyone can verify vote authenticity by fetching from IPFS and validating signature\n\t\t-\n\t\t- **GraphQL API for Querying**:\n\t\t- Snapshot exposes GraphQL API for retrieving proposals and votes:\n\t\t-\n\t\t- ```graphql\n\t\t- query {\n\t\t-     proposals(\n\t\t-         where: { space: \"aave.eth\", state: \"closed\" }\n\t\t-         orderBy: \"created\", orderDirection: desc\n\t\t-     ) {\n\t\t-         id\n\t\t-         title\n\t\t-         choices\n\t\t-         start\n\t\t-         end\n\t\t-         snapshot\n\t\t-         state\n\t\t-         scores\n\t\t-         votes\n\t\t-     }\n\t\t- }\n\t\t- ```\n\t\t-\n\t\t- **On-Chain Execution (SafeSnap)**:\n\t\t- SafeSnap module enables binding execution. After Snapshot vote passes:\n\t\t-\n\t\t- 1. Oracle (Reality.eth) posts question: \"Did proposal X pass on Snapshot?\"\n\t\t- 2. Community bonds tokens to answer truthfully; disputes resolved by escalation game\n\t\t- 3. If answer confirmed after dispute period, Safe multi-sig can execute transaction\n\t\t- 4. Execution must match proposal's specified on-chain actions\n\t\t-\n\t\t- ```solidity\n\t\t- function executeProposalWithSnapshot(\n\t\t-     bytes32 proposalHash,\n\t\t-     bytes memory snapshotProof\n\t\t- ) external {\n\t\t-     require(\n\t\t-         reality.resultFor(proposalHash) == bytes32(uint256(1)),\n\t\t-         \"Proposal did not pass Reality oracle\"\n\t\t-     );\n\t\t-\n\t\t-     // Execute transactions specified in proposal\n\t\t-     for (uint i = 0; i < transactions.length; i++) {\n\t\t-         execute(transactions[i]);\n\t\t-     }\n\t\t- }\n\t\t- ```\n\t\t-\n\t- ### Real-World Implementations\n\t  collapsed:: true\n\t\t- **Aave Governance (2020-present)**:\n\t\t- Aave, one of DeFi's largest lending protocols ($5+ billion TVL), uses Snapshot for all governance signalling before on-chain execution via Aave Improvement Proposals (AIPs). The process: community members discuss proposals on governance forum, formal proposals are created on Snapshot with 5-day voting periods, if >500K AAVE votes and majority approval, core team submits AIP on-chain for 3-day on-chain vote, then 2-day timelock before execution. This two-stage process significantly improved participation—early on-chain-only governance saw 2-3% turnout due to gas costs; post-Snapshot adoption, turnout increased to 8-15%. Notable votes include the $16.28 million Aave Grants DAO funding (2021, 99% approval, 1.2M AAVE votes) and v3 deployment decisions across 6 chains. Aave uses weighted voting by AAVE token holdings plus stkAAVE (staked AAVE), with delegation enabling DeFi protocols and large holders to delegate to active community members.\n\t\t-\n\t\t- **Uniswap Governance (2020-present)**:\n\t\t- Uniswap, the leading decentralised exchange ($4+ billion TVL), operates a sophisticated two-tier system: temperature checks on Snapshot (non-binding sentiment), then on-chain votes for binding execution. Snapshot proposals require 2.5M UNI voting power to create (anti-spam), 40M UNI quorum (4% of supply), and run for 5-7 days. The system has processed 200+ proposals including major decisions like the $20 million Uniswap Foundation grants budget and deployment to Polygon and Optimism. Delegation is heavily used—only 7,000-10,000 addresses vote directly, but represent 100M+ delegated UNI. Top delegates (a16z, Dharma, Gauntlet) each control 10M+ UNI in delegated voting power, creating representative democracy. Snapshot's gasless voting enables small UNI holders to participate in temperature checks even if they can't afford on-chain votes.\n\t\t-\n\t\t- **ENS (Ethereum Name Service) (2021-present)**:\n\t\t- ENS uses Snapshot for all DAO proposals with \"executable proposals\" that bind to on-chain actions. Their governance framework includes social proposals (non-binding, simple majority), executable proposals (binding, require 1% quorum and >50% approval), and constitutional amendments (require 5% quorum and 66.67% supermajority). All voting uses a sophisticated strategy combining ENS token holdings, delegated tokens, and wrapped ENS, calculated at the snapshot block. In 2022, ENS processed 47 proposals with average turnout of 7-12% and successful passage of major initiatives including the ENS DAO Constitution ratification (32M ENS voted, 92% yes) and funding allocations totalling $2.5M. ENS pioneered \"gasless delegation\" where token holders sign delegation messages without transactions, further reducing friction.\n\t\t-\n\t\t- **Gitcoin (2021-present)**:\n\t\t- Gitcoin's governance combines Snapshot for decision-making with a 9-of-15 multi-sig for execution verification. All treasury expenditures, grant programme modifications, and governance process changes require Snapshot approval before the multi-sig executes. The system uses tiered quorum: budget proposals <$500K require 2.5M GTC quorum, $500K-$1M require 5M GTC, >$1M require 10M GTC (scaling with financial impact). This created controversy in 2022 when a $1.5M proposal passed with 6M GTC quorum under old rules but was rejected by the multi-sig until quorum was met, demonstrating tensions in hybrid systems. Gitcoin has experimented with quadratic voting via Snapshot's QV strategy for community rounds, allowing voice credit allocation across multiple proposals in a single voting period.\n\t\t-\n\t\t- **Over 10,000 DAOs (2020-present)**:\n\t\t- Beyond major protocols, Snapshot serves the long tail: creator DAOs (FWB, Cabin), protocol DAOs (Balancer, Curve, Yearn), investment DAOs (MetaCartel Ventures, The LAO), social DAOs, and local community groups. The platform's flexibility enables experimentation—some DAOs use NFT-based voting (owning specific NFT grants vote), others use proof-of-attendance (POAP) tokens, and some combine multiple tokens with custom weights. The lowest barrier to entry has democratised DAO creation; any group can launch a Snapshot space in minutes and conduct governance without smart contract deployment costs.\n\t\t-\n\t- ### Advantages and Benefits\n\t  collapsed:: true\n\t\t- **Gasless Voting**: The most significant advantage—voters pay zero gas fees. During Ethereum congestion peaks, on-chain votes cost $100-$500 each, making participation economically irrational for most token holders. Snapshot's signatures require only wallet interaction, taking 5-10 seconds with no cost. This has increased voter turnout by 3-5× compared to gas-requiring systems.\n\t\t-\n\t\t- **Scalability**: Snapshot handles thousands of simultaneous votes across hundreds of proposals without blockchain scalability constraints. The platform processed 100,000+ proposals in 2020-2024, aggregating millions of votes—an impossible load for on-chain systems.\n\t\t-\n\t\t- **Voting Strategy Flexibility**: The strategy system enables governance experimentation. DAOs can implement quadratic voting, conviction weighting, multi-token voting, NFT-gated participation, or completely custom logic—all without smart contract audits or deployment costs. This lowers the barrier for governance innovation from months of development to hours of strategy coding.\n\t\t-\n\t\t- **Delegation Without Transactions**: Token holders can delegate voting power by signing a message, with no gas cost or on-chain transaction. This has enabled liquid democracy where casual holders delegate to active community members, dramatically improving governance quality. In Uniswap, 60%+ of voting power is delegated.\n\t\t-\n\t\t- **Historical Verifiability**: All votes are cryptographically signed and stored on IPFS. Anyone can independently verify that votes are authentic, correctly counted, and aligned with blockchain state at the snapshot block. This creates transparency impossible in traditional organisations.\n\t\t-\n\t\t- **Low Barrier to Entry**: Creating a Snapshot space requires no smart contracts, no deployment costs, no technical expertise. Any community can launch governance in minutes with just an ENS name or Ethereum address as the space identifier. This has democratised DAO creation.\n\t\t-\n\t\t- **Multi-Chain Support**: Snapshot supports 20+ blockchains (Ethereum, Polygon, Arbitrum, Optimism, BNB Chain, etc.), enabling governance across fragmented liquidity. A DAO can aggregate votes from token holders across multiple chains in a single proposal.\n\t\t-\n\t\t- **Privacy Options**: Whilst most votes are public, Snapshot supports shielded voting via zero-knowledge proofs where votes are revealed only after the voting period ends, preventing herd behaviour and last-minute swing votes by whales.\n\t\t-\n\t- ### Limitations and Challenges\n\t  collapsed:: true\n\t\t- **Non-Binding Results**: Snapshot votes are advisory unless integrated with on-chain execution mechanisms like SafeSnap. By default, passing a Snapshot vote requires manual implementation by protocol developers or multi-sig signers, creating opportunities for execution failure, delays, or malicious deviation. Communities must trust that voted outcomes will be honoured.\n\t\t-\n\t\t- **Infrastructure Dependency**: Snapshot relies on centralised infrastructure (snapshot.org, IPFS pinning services, GraphQL API). If Snapshot Labs (the company) disappeared or was compromised, governance could halt. Whilst data is on IPFS and theoretically available, the tooling for vote aggregation and strategy calculation is concentrated. This creates single-point-of-failure risk despite using decentralised storage.\n\t\t-\n\t\t- **Snapshot Block Manipulation**: Sophisticated attackers can exploit the snapshot mechanism. If they know when a proposal will be created and what the snapshot block will be, they can:\n\t\t- - Take flash loans to temporarily inflate token balance at that exact block\n\t\t- - Borrow tokens from lending protocols, vote, then return them\n\t\t- - Coordinate to move tokens between addresses to maximise voting power\n\t\t- Defences include random or delayed snapshot block selection, but these add complexity.\n\t\t-\n\t\t- **Delegation Centralisation**: Whilst delegation improves participation, it can concentrate power. In Uniswap, top 10 delegates control 30%+ of voting power. If these delegates collude or are compromised, they can unilaterally pass proposals. This recreates plutocracy through the backdoor of representative democracy.\n\t\t-\n\t\t- **Low Information Voting**: Gasless voting reduces barrier to participation but also reduces incentive for due diligence. Voters who would have spent time researching a proposal before paying $100 to vote may now vote casually on dozens of proposals with minimal research. This can degrade decision quality, favouring name recognition over substance.\n\t\t-\n\t\t- **Sybil Resistance Challenges**: Token-weighted strategies are naturally Sybil-resistant (splitting tokens across addresses doesn't increase voting power), but one-person-one-vote or quadratic strategies require identity verification. Snapshot doesn't provide this natively; DAOs must integrate external systems like [[Gitcoin Passport]] or BrightID, adding friction.\n\t\t-\n\t\t- **Execution Gap Security**: The time between Snapshot vote conclusion and on-chain execution creates risk. Market conditions may change, making the voted action harmful. Or attackers could frontrun execution if details are public. SafeSnap's Reality.eth oracle adds delays for dispute resolution, further widening this gap.\n\t\t-\n\t\t- **Limited On-Chain Privacy**: Whilst shielded voting hides votes during voting periods, blockchain state (token balances) is public, so sophisticated observers can estimate voting power distribution. True privacy would require zero-knowledge proofs of token ownership, which Snapshot doesn't support comprehensively.\n\t\t-\n\t\t- **Strategy Computation Trust**: Voting power calculation happens off-chain. Whilst strategies are open-source and verifiable, most users trust Snapshot's computation rather than independently verifying. A bug or malicious strategy could miscalculate voting power, skewing results. Community verification is technically possible but rarely performed.\n\t\t-\n\t- ### Comparison with Alternatives\n\t  collapsed:: true\n\t\t- **vs. [[BC-0462-on-chain-voting]]**: On-chain voting (Governor contracts, Compound/Aave on-chain governance) provides binding execution and maximum decentralisation—no reliance on external infrastructure—but is expensive ($50-$500 per vote in gas), slow (block times limit throughput), and inflexible (strategies are hardcoded in contracts). Snapshot is free, scalable, and flexible, but non-binding and infrastructure-dependent. Many protocols use hybrid: Snapshot for signalling and wide participation, on-chain for final binding votes. This combines Snapshot's accessibility with on-chain security.\n\t\t-\n\t\t- **vs. [[BC-0466-quadratic-voting]]**: Snapshot can implement quadratic voting via strategies, offering significant flexibility advantages over standalone QV systems. However, identity verification (crucial for QV) must be integrated separately. Pure QV platforms like Gitcoin Grants include identity by default but only for funding allocation, not general governance. Snapshot+QV enables experimentation but requires DAOs to solve Sybil resistance independently.\n\t\t-\n\t\t- **vs. [[BC-0467-conviction-voting]]**: Conviction voting operates continuously with time-weighted preferences; Snapshot uses discrete voting periods with snapshot-in-time power calculations. Conviction voting is ideal for continuous funding decisions; Snapshot for discrete binary or multi-choice decisions. Hybrid approaches could use Snapshot to poll community, then conviction voting to actually allocate funds based on revealed preferences.\n\t\t-\n\t\t- **vs. [[BC-0468-multi-sig-governance]]**: Multi-sig provides fast, secure execution by small committees; Snapshot enables broad community participation but requires execution through multi-sig or other mechanisms. They're complementary: Snapshot determines what community wants, multi-sig validates and executes. SafeSnap automates this relationship, with multi-sig only able to execute Snapshot-approved actions.\n\t\t-\n\t\t- **Trade-offs Summary**:\n\t\t- - **Cost**: Snapshot (free) >>> On-chain voting ($50-$500)\n\t\t- - **Speed**: Multi-sig > Snapshot ≈ On-chain voting > Conviction voting\n\t\t- - **Binding execution**: On-chain voting > Multi-sig > Snapshot+SafeSnap > Pure Snapshot\n\t\t- - **Decentralisation**: On-chain voting > Conviction > Snapshot > Multi-sig\n\t\t- - **Flexibility**: Snapshot >>> On-chain voting ≈ Conviction ≈ Quadratic > Multi-sig\n\t\t- - **Scalability**: Snapshot >>> Multi-sig > Conviction > Quadratic > On-chain voting\n\t\t- - **Participation barrier**: Snapshot (lowest) > Conviction > Quadratic > Multi-sig > On-chain voting (highest)\n\t\t-\n\t- ### Legal and Regulatory Aspects\n\t  collapsed:: true\n\t\t- **Securities Law and Advisory Votes**: Snapshot's non-binding nature may provide legal protection. If governance tokens are deemed securities, binding on-chain votes could be viewed as shareholder voting requiring SEC registration and proxy rules compliance. Advisory Snapshot votes might be characterised as \"corporate communications\" or \"polls\" rather than official votes, potentially avoiding these requirements. However, if Snapshot+SafeSnap creates binding execution, this distinction collapses, and full securities law compliance may be required.\n\t\t-\n\t\t- **Fiduciary Duties and Execution Gap**: In [[BC-0470-dao-legal-structures]] with legal personality (Wyoming DAO LLC, Cayman Foundation), who is responsible for implementing Snapshot votes? If a vote passes but execution is delayed or botched, can token holders sue? Traditional corporate law imposes fiduciary duties on directors to implement shareholder votes. DAO legal wrappers may create similar duties for multi-sig signers or core teams responsible for execution.\n\t\t-\n\t\t- **Vote Buying and Governance Attacks**: Snapshot's off-chain nature makes governance attacks easier in some ways. An attacker could borrow tokens from lending protocols like Aave (where tokens retain governance rights even when deposited), vote on Snapshot using borrowed power, then return tokens—all without on-chain traces beyond the signature. If this constitutes market manipulation or fraud, regulators might pursue voters. However, attributing intent is difficult when votes are cryptographically anonymous.\n\t\t-\n\t\t- **Data Retention and Privacy Law**: GDPR's right to erasure creates tension with immutable IPFS storage. If an EU citizen votes on Snapshot and later requests data deletion, can their vote be erased from IPFS? Technically no—content-addressed storage is permanent. Snapshot could remove votes from their indexing database, but IPFS pins remain. This may violate GDPR, creating liability for Snapshot Labs and DAOs using the platform.\n\t\t-\n\t\t- **Cross-Border Governance and Jurisdiction**: Snapshot enables global participation—voters from dozens of countries participate in single proposals. If a DAO using Snapshot violates one jurisdiction's laws (e.g., approves payment to sanctioned entity), are all voters liable? What if voters didn't know the recipient's status? International law lacks frameworks for distributed decision-making with participants in 50+ jurisdictions.\n\t\t-\n\t\t- **Delegation and Proxy Voting Rules**: Traditional securities law regulates proxy voting—who can solicit proxies, disclosure requirements, revocation rights. Snapshot delegation resembles proxy voting. Large delegates in Uniswap or Aave arguably \"solicit\" delegation through forum posts and social media. Should they be subject to proxy rules requiring disclosure of conflicts of interest, voting rationale, and fiduciary standards? US securities law hasn't addressed this, but analogy to traditional proxies could bring regulation.\n\t\t-\n\t- ### Best Practices\n\t  collapsed:: true\n\t\t- **Snapshot Block Selection**:\n\t\t- - Set snapshot block 50-100 blocks before proposal creation to prevent frontrunning\n\t\t- - Avoid predictable snapshot times (e.g., always \"block when proposal created\") which enable manipulation\n\t\t- - Consider random snapshot block within a window, disclosed after voting begins\n\t\t- - For major decisions, use multiple snapshot blocks and average voting power to resist flash loan attacks\n\t\t-\n\t\t- **Quorum and Approval Thresholds**:\n\t\t- - Scale quorum with decision importance: routine (<1M budget) 2-3%, significant (1-5M) 5-7%, major (>5M) 10%+\n\t\t- - Use supermajority (66%+) for constitutional changes, simple majority for routine operations\n\t\t- - Implement turnout-weighted approval: require higher approval % if turnout is low (anti-apathy measure)\n\t\t- - Set minimum absolute vote counts (e.g., 100 voters) to prevent tiny active minorities controlling low-turnout votes\n\t\t-\n\t\t- **Voting Strategy Selection**:\n\t\t- - Default to token-weighted for most decisions (aligns with economic stake)\n\t\t- - Use quadratic for public goods funding to amplify broad support over whale preferences\n\t\t- - Implement delegation for complex technical decisions where expertise matters\n\t\t- - Consider whitelist or NFT-gating for sensitive decisions requiring specific qualifications\n\t\t- - Combine multiple tokens/strategies for cross-community decisions (e.g., governance + ecosystem tokens)\n\t\t-\n\t\t- **Proposal Quality and Anti-Spam**:\n\t\t- - Require minimum voting power to create proposals (Uniswap's 2.5M UNI model)\n\t\t- - Implement proposal deposits refunded only if quorum met (economic spam prevention)\n\t\t- - Mandatory proposal templates: clear title, executive summary, detailed specification, implementation plan, budget\n\t\t- - Pre-proposal discussion period on forums (minimum 3-7 days) before Snapshot vote\n\t\t- - Require proposer to specify on-chain actions for executable proposals (no vague \"do something\" votes)\n\t\t-\n\t\t- **Execution and SafeSnap Integration**:\n\t\t- - Use SafeSnap for critical financial decisions requiring trustless execution\n\t\t- - Reality.eth bond sizing: scale with decision value (1-5% of affected funds)\n\t\t- - Post-vote review period (24-48h) before execution to catch errors or changed circumstances\n\t\t- - Multi-sig validation even with SafeSnap—require both oracle confirmation AND multi-sig approval\n\t\t- - Publish detailed execution reports after implementing Snapshot votes (transparency and accountability)\n\t\t-\n\t\t- **Delegation Best Practices**:\n\t\t- - Encourage delegates to publish voting rationale (Delegate Dashboards, forum posts)\n\t\t- - Implement delegate standards of conduct (conflict disclosure, minimum participation rates)\n\t\t- - Enable partial delegation (delegate 50% of voting power, keep 50% for direct voting)\n\t\t- - Periodic delegate refreshment—encourage token holders to review delegations quarterly\n\t\t- - Delegate reputation systems tracking voting participation, alignment with delegators, reasoning quality\n\t\t-\n\t\t- **Security and Verification**:\n\t\t- - Publish snapshot block prominently in proposal to enable independent verification\n\t\t- - Encourage community members to independently verify vote counts using IPFS data\n\t\t- - Use multiple IPFS pinning services (redundancy against data loss)\n\t\t- - Regular security reviews of custom voting strategies (audit complex aggregation logic)\n\t\t- - Monitor for unusual voting patterns (sudden large votes, coordinated timing, borrowed token spikes)\n\t\t-\n\t- ### Future Developments\n\t  collapsed:: true\n\t\t- **Zero-Knowledge Voting**: Snapshot is researching fully private voting using zk-SNARKs where votes remain encrypted until voting ends, then are homomorphically tallied. This prevents herd behaviour, whale signalling, and governance attacks whilst maintaining verifiability. Projects like MACI (Minimal Anti-Collusion Infrastructure) could integrate with Snapshot for high-stakes decisions.\n\t\t-\n\t\t- **Cross-Chain Voting Aggregation**: Future versions may aggregate voting power across chains seamlessly. A user with tokens on Ethereum, Polygon, and Optimism could vote once with combined power calculated via cross-chain state proofs, eliminating need for bridges or manual consolidation.\n\t\t-\n\t\t- **AI-Assisted Governance**: Language models could summarise proposals, highlight conflicts with previous votes, analyse potential impacts, and help voters make informed decisions. Snapshot could integrate GPT-based assistants that answer \"How would this affect me?\" or \"What are risks?\" customised to each voter's positions.\n\t\t-\n\t\t- **Binding L2 Execution**: Integration with Optimism, Arbitrum, and other L2s for native on-chain execution. Snapshot vote results could trigger L2 smart contracts automatically via optimistic verification—L2 assumes vote result is correct, anyone can challenge with L1 fraud proof if incorrect. This achieves binding execution without Snapshot infrastructure trust.\n\t\t-\n\t\t- **Prediction Markets Integration**: Combine Snapshot with prediction markets where outcomes can be bet on. \"Will proposal X pass?\" markets aggregate information about likely outcomes, helping voters coordinate and discouraging frivolous proposals. Polymarket or similar could integrate with Snapshot spaces.\n\t\t-\n\t\t- **Reputation-Weighted Voting**: Future strategies might incorporate on-chain reputation (POAP attendance, previous voting participation, contribution history) to weight votes. This could mitigate plutocracy whilst rewarding engaged community members. Challenge is defining reputation metrics objectively.\n\t\t-\n\t\t- **Modular Governance Frameworks**: Snapshot evolving into a composable governance layer where DAOs mix-and-match: Snapshot for signalling + SafeSnap for execution + Conviction voting for continuous funding + Multi-sig for emergencies. All coordinated through a unified interface, creating specialised governance pipelines.\n\t\t-\n\t- #\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Metaverse platforms continue to evolve with focus on interoperability and open standards\n  - Web3 integration accelerating with decentralised identity and asset ownership\n  - Enterprise adoption growing in virtual collaboration, training, and digital twins\n  - UK companies increasingly active in metaverse development and immersive technologies\n\n- Technical capabilities\n  - Real-time rendering at photorealistic quality levels\n  - Low-latency networking enabling seamless multi-user experiences\n  - AI-driven content generation and procedural world building\n  - Spatial audio and haptics enhancing immersion\n\n- UK and North England context\n  - Manchester: Digital Innovation Factory supports metaverse startups and research\n  - Leeds: Holovis leads in immersive experiences for entertainment and training\n  - Newcastle: University research in spatial computing and interactive systems\n  - Sheffield: Advanced manufacturing using digital twin technology\n\n- Standards and frameworks\n  - Metaverse Standards Forum driving interoperability protocols\n  - WebXR enabling browser-based immersive experiences\n  - glTF and USD for 3D asset interchange\n  - Open Metaverse Interoperability Group defining cross-platform standards\n\n## Metadata\n\n- **Last Updated**: 2025-11-16\n- **Review Status**: Automated remediation with 2025 context\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable\n\n\n## References and Research\n\t  collapsed:: true\n\t\t- **Platform Documentation**:\n\t\t- - Snapshot Labs. (2020-2024). \"Snapshot Documentation.\" docs.snapshot.org\n\t\t- - Snapshot Labs. (2021). \"SafeSnap Documentation: Bridging Snapshot and Safe.\" docs.snapshot.org/plugins/safesnap\n\t\t- - Snapshot Strategies Repository. github.com/snapshot-labs/snapshot-strategies\n\t\t-\n\t\t- **Implementation Case Studies**:\n\t\t- - Aave Governance. \"Aave Improvement Proposals (AIPs).\" governance.aave.com\n\t\t- - Uniswap Governance. \"Governance Process Documentation.\" gov.uniswap.org\n\t\t- - ENS DAO. \"ENS DAO Governance Documentation.\" docs.ens.domains/dao\n\t\t- - Gitcoin DAO. \"Gitcoin Governance Process.\" gov.gitcoin.co\n\t\t-\n\t\t- **Technical Specifications**:\n\t\t- - EIP-712. \"Typed Structured Data Hashing and Signing.\" eips.ethereum.org/EIPS/eip-712\n\t\t- - Reality.eth. \"Decentralised Oracle Documentation.\" reality.eth.link\n\t\t- - IPFS. \"InterPlanetary File System Specification.\" docs.ipfs.io\n\t\t-\n\t\t- **Research and Analysis**:\n\t\t- - Buterin, V. (2021). \"Moving Beyond Coin Voting Governance.\" vitalik.ca\n\t\t- - Snapshot Labs. (2022). \"Snapshot Usage Statistics and Growth.\" snapshot.org/statistics\n\t\t- - a16z Crypto. (2023). \"Delegation and Governance Participation Analysis.\" a16z.com/crypto\n\t\t-\n\t\t- **Related Mechanisms**:\n\t\t- - [[BC-0461-decentralized-autonomous-organization]] - DAO governance frameworks\n\t\t- - [[BC-0462-on-chain-voting]] - Token-weighted on-chain voting\n\t\t- - [[BC-0466-quadratic-voting]] - Alternative voting mechanism\n\t\t- - [[BC-0467-conviction-voting]] - Time-weighted continuous voting\n\t\t- - [[BC-0468-multi-sig-governance]] - Execution mechanism for Snapshot results\n\t\t- - [[IPFS]] - Decentralised storage for votes\n\t\t- - [[EIP-712]] - Structured data signing standard\n\t\t- - [[Aave]] - Major Snapshot user\n\t\t- - [[Uniswap]] - Delegation and governance case study\n\t\t-\n\t- ### Original Content\n\t  collapsed:: true\n\t\t- ```\n\n\t\t  ```",
  "properties": {
    "id": "bc-0469-snapshot-voting-ontology",
    "collapsed": "true",
    "- ontology": "true",
    "- term-id": "BC-0469",
    "- preferred-term": "Snapshot Voting",
    "- source-domain": "blockchain",
    "- status": "stub-needs-content",
    "- public-access": "true",
    "- content-status": "minimal-placeholder-requires-authoring",
    "- definition": "A component of the blockchain ecosystem.",
    "- maturity": "draft",
    "- owl:class": "bc:SnapshotVoting",
    "- owl:physicality": "ConceptualEntity",
    "- owl:role": "Concept",
    "- belongsToDomain": "[[BlockchainDomain]]"
  },
  "backlinks": [
    "BC-0467-conviction-voting",
    "BC-0466-quadratic-voting",
    "BC-0470-dao-legal-structures",
    "BC-0468-multi-sig-governance"
  ],
  "wiki_links": [
    "BC-0466-quadratic-voting",
    "BC-0467-conviction-voting",
    "Gitcoin Passport",
    "BC-0468-multi-sig-governance",
    "BC-0470-dao-legal-structures",
    "BlockchainDomain",
    "Aave",
    "IPFS",
    "BC-0461-decentralized-autonomous-organization",
    "Uniswap",
    "EIP-712",
    "BC-0462-on-chain-voting"
  ],
  "ontology": {
    "term_id": "BC-0469",
    "preferred_term": "Snapshot Voting",
    "definition": "A component of the blockchain ecosystem.",
    "source_domain": "blockchain",
    "maturity_level": null,
    "authority_score": null
  }
}