{
  "title": "Circular Economy",
  "content": "- ### OntologyBlock\n  id:: bc-0449-circular-economy-ontology\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: BC-0449\n\t- preferred-term:: Circular Economy\n\t- source-domain:: blockchain\n\t- status:: stub-needs-content\n\t- public-access:: true\n\t- content-status:: minimal-placeholder-requires-authoring\n\t- public-access:: true\n\t- definition:: A component of the blockchain ecosystem.\n\t- maturity:: draft\n\t- owl:class:: bc:CircularEconomy\n\t- owl:physicality:: ConceptualEntity\n\t- owl:role:: Concept\n\t- belongsToDomain:: [[BlockchainDomain]]\n\n## OWL Formal Semantics\n\n```clojure\n;; OWL Functional Syntax\n\n(Declaration (Class :CircularEconomy))\n\n;; Annotations\n(AnnotationAssertion rdfs:label :CircularEconomy \"Circular Economy\"@en)\n(AnnotationAssertion rdfs:comment :CircularEconomy \"A component of the blockchain ecosystem.\"@en)\n\n;; Data Properties\n(AnnotationAssertion dcterms:identifier :CircularEconomy \"BC-0449\"^^xsd:string)\n```\n\n- ## About Circular Economy\n  id:: circular-economy-about\n\n\t- Circular economy represents a fundamental shift from the traditional linear \"take-make-dispose\" economic model to regenerative systems where products, materials, and resources maintain their value through continuous cycles of use, reuse, and regeneration. In the European Union alone, transitioning to circular economy models could reduce greenhouse gas emissions by 48% by 2030 whilst generating €600 billion in annual economic benefits. However, implementing circular economy principles faces substantial challenges in tracking product lifecycles, verifying material composition, ensuring authentic reuse and recycling, and maintaining transparency across complex value chains involving multiple stakeholders. Traditional systems lack the infrastructure to track a product from initial manufacture through multiple use cycles, repairs, refurbishments, and eventual material recovery. When a smartphone changes hands three times, passes through a repair shop, and eventually reaches a recycling facility, the absence of comprehensive lifecycle records prevents optimal material recovery and creates opportunities for fraud in second-hand markets. Blockchain technology addresses these challenges by creating immutable digital product passports that record every lifecycle event, material composition, ownership transfer, repair intervention, and recycling process. These permanent records enable verification of circular economy claims, prevent greenwashing, facilitate second-hand market trust, and optimise material recovery processes. The European Commission's proposed Digital Product Passport regulation, part of the Circular Economy Action Plan, explicitly envisions blockchain-based systems for tracking products from cradle to cradle. Companies including Fairphone, BMW, and Volvo have implemented blockchain circular economy tracking that documents product journeys across decades, whilst platforms like Circularise and Minespider enable material traceability from raw resource extraction through multiple manufacturing and recycling cycles.\n\n\t- ### Industry Challenge\n\t\t- The transition to circular economy faces fundamental information asymmetries that undermine efforts to extend product life, enable reuse, and recover materials efficiently. Current product documentation rarely survives beyond initial sale, leaving subsequent owners, repair technicians, and recyclers without essential information about material composition, component specifications, previous repairs, or remaining useful life. This information vacuum forces conservative assumptions that result in premature disposal, suboptimal recycling, and lost economic value. The Ellen MacArthur Foundation estimates that poor material tracking results in £40 billion annually in lost value from electronics alone, with less than 20% of electronic waste properly recycled due partly to inadequate material composition data.\n\t\t- Fraud and greenwashing plague circular economy markets. Second-hand product markets, valued at over £500 billion globally, suffer from authenticity concerns and undisclosed damage history that suppress prices and limit market growth. Companies making circular economy claims lack credible verification mechanisms, enabling greenwashing that undermines genuine sustainability efforts. The absence of standardised lifecycle tracking prevents consumers from distinguishing between truly circular products and conventional items with superficial sustainability marketing.\n\t\t- Complex supply chains with multiple actors across different jurisdictions create accountability gaps that prevent effective circular economy implementation. A laptop computer may contain materials from 30 countries, components from 50 suppliers, undergo manufacturing in three locations, be sold and resold multiple times across different continents, receive repairs from independent technicians, and ultimately reach a recycling facility that processes hundreds of products daily. Coordinating information flow across these diverse stakeholders using conventional systems proves impractical, resulting in fragmented data that provides little visibility into true product lifecycle.\n\t\t- Regulatory compliance for extended producer responsibility schemes, take-back obligations, and recycling targets requires documentation that current systems cannot reliably provide. The EU's Battery Regulation mandates minimum recycled content percentages and carbon footprint declarations, requiring traceability infrastructure that doesn't exist for most battery supply chains. Without verifiable lifecycle records, enforcement becomes impossible and regulations remain aspirational rather than actionable.\n\n\t- ### Technical Architecture\n\t\t- Blockchain circular economy systems implement digital product passports that persist throughout product lifecycles, potentially spanning decades. Each product receives a unique identifier, typically an NFC tag, QR code, or RFID chip, linked to a blockchain record containing material composition, manufacturing data, ownership history, repair records, and recycling information. The blockchain architecture uses permissioned networks like [[Hyperledger Fabric]] or hybrid approaches combining public blockchain transparency with private data channels for commercially sensitive information.\n\t\t- Material composition data forms the foundation of circular economy tracking. Digital product passports record the bill of materials including precise specifications for metals, plastics, rare earth elements, and hazardous substances. This data enables recyclers to identify valuable material recovery opportunities and handle hazardous materials appropriately. For complex products like automobiles or electronics, hierarchical data structures represent assemblies and subassemblies, enabling component-level tracking through reuse and remanufacturing processes.\n\t\t- Ownership transfers are recorded as blockchain transactions that create a complete chain of custody. Smart contracts can automate processes including deposit refunds for returned products, royalty payments to original manufacturers when products are resold, and certification that products meet specific criteria for government incentive programmes. The immutable ownership record prevents fraud in second-hand markets and enables new business models including product-as-a-service schemes where manufacturers retain ownership whilst customers pay for usage.\n\t\t- Repair and refurbishment events are documented with details of interventions, replacement parts, and updated condition assessments. This repair history informs future maintenance decisions, extends useful product life, and supports right-to-repair legislation by demonstrating that products can be maintained rather than replaced. Integration with spare parts supply chains ensures that replacement components are tracked similarly to original parts, maintaining traceability through multiple repair cycles.\n\t\t- End-of-life processing records capture recycling outcomes including material recovery rates, proper hazardous waste disposal, and compliance with environmental regulations. These records enable verification of recycling claims, support extended producer responsibility compliance, and provide data for continuous improvement of product design for circularity. Smart contracts can trigger payments to recyclers based on verified material recovery, creating economic incentives for proper processing rather than informal recycling or landfill disposal.\n\n\t- ### Real-World Implementations\n\t\t- **Fairphone Ethical Smartphone Tracking**: Fairphone, a Dutch social enterprise producing modular smartphones, implemented blockchain tracking for its supply chain and product lifecycle in 2020. The system records mineral sourcing from conflict-free mines, component manufacturing across Asia and Europe, assembly in China, distribution to customers, ownership transfers in second-hand markets, and eventual recycling. Each Fairphone has a unique digital identity accessible via QR code, showing its complete material history and carbon footprint. The blockchain verification has increased second-hand Fairphone values by 15-20% due to buyers' confidence in device history and authenticity. Fairphone's modular design enables component replacement, with blockchain records documenting which parts have been upgraded, helping maintain device value through extended lifecycles averaging 5-7 years compared to 2-3 years for conventional smartphones.\n\t\t- **BMW Battery Lifecycle Tracking with VeChain**: BMW's partnership with VeChain implemented blockchain tracking for electric vehicle battery lifecycles from manufacturing through first-life automotive use, second-life energy storage applications, and eventual material recycling. The system records battery chemistry specifications, manufacturing parameters, charging histories, degradation rates, and residual capacity measurements. When EV batteries reach 70-80% of original capacity and are no longer suitable for automotive use, the detailed performance history enables accurate valuation for second-life applications in stationary energy storage. BMW reports that blockchain-verified battery history has increased second-life market values by 25-30%, with buyers willing to pay premiums for batteries with documented performance rather than uncertain condition. The system tracks over 100,000 battery modules across Europe, with projections suggesting the second-life battery market could reach £20 billion by 2030.\n\t\t- **Volvo Cobalt Traceability**: Volvo implemented blockchain traceability for cobalt used in electric vehicle batteries, tracking material from mines in Democratic Republic of Congo through refinement, cell manufacturing, and eventual recycling. The system, built on Oracle Blockchain Platform, provides visibility into labour conditions, environmental practices, and material custody throughout the supply chain. Each battery carries a digital passport documenting cobalt provenance, enabling Volvo to verify compliance with responsible sourcing commitments. The traceability extends to end-of-life processing, with smart contracts ensuring that recycled cobalt returns to the supply chain rather than entering waste streams. The implementation covers over 50,000 tonnes of cobalt annually and has influenced EU discussions on mandatory supply chain due diligence.\n\t\t- **Circularise Polymer Traceability Platform**: Circularise, a Dutch circular economy platform, provides blockchain-based traceability for plastics and other materials through complex supply chains. The system uses zero-knowledge proofs to enable material composition verification whilst protecting proprietary formulations. Major chemical companies including Covestro and Domo Chemicals use the platform to track recycled content percentages in polymers, supporting circular economy claims with verifiable data. The platform has traced over 500,000 tonnes of polymers, including recycled ocean plastics used in consumer products and recycled automotive components. Smart contracts automatically verify that materials meet specified recycled content thresholds, enabling brands to confidently make sustainability claims backed by blockchain evidence.\n\t\t- **Textile Circular Economy Consortium**: The Fashion for Good consortium, including brands like Adidas, Target, and C&A, implemented blockchain tracking for textile circularity. The system records fibre sourcing, fabric production, garment manufacturing, sales, and textile-to-textile recycling. Each garment carries an NFC tag enabling consumers to access complete product history and information about recycling options. The platform integrates with textile recycling facilities to document material recovery and creation of new fibres from old garments. Initial implementation covers 2 million garments across pilot programmes, with blockchain verification increasing consumer willingness to pay for sustainable products by 18% according to consortium research.\n\n\t- ### Standards and Regulations\n\t\t- The European Union's Circular Economy Action Plan, adopted in 2020, establishes ambitious targets including reducing waste by 50% by 2030 and ensuring all packaging is reusable or recyclable. The proposed [[Digital Product Passport]] regulation requires electronic products to carry digital records of material composition, repair information, and recycling instructions. The regulation explicitly envisions distributed ledger technology as an enabling infrastructure, with pilot programmes testing blockchain implementations across multiple product categories.\n\t\t- The EU Battery Regulation, which entered into force in 2023, mandates specific recycled content minimums for new batteries, carbon footprint declarations, and digital battery passports containing manufacturing data, recycled content verification, and end-of-life handling instructions. Blockchain platforms are emerging as the primary technology for battery passport implementation due to requirements for long-term data persistence, multi-party access, and tamper resistance.\n\t\t- Extended Producer Responsibility (EPR) regulations in Europe, North America, and Asia require manufacturers to take responsibility for product end-of-life management. Blockchain systems enable verification of EPR compliance by documenting product collection, proper processing, and material recovery. Several European countries are piloting blockchain-based EPR reporting systems that automate compliance verification and reduce administrative burdens.\n\t\t- The [[GS1]] Digital Link standard provides a framework for connecting physical products to digital information using standard identifiers and web-based resolution. This standard enables interoperability between blockchain platforms and existing product identification systems, supporting gradual circular economy implementation without requiring complete infrastructure replacement. Industry groups including the World Economic Forum's Global Battery Alliance are developing governance frameworks for circular economy blockchain implementations that address data sharing, privacy protection, and cross-border data flows.\n\t\t- Environmental Product Declarations (EPDs) and lifecycle assessments require comprehensive data about material flows, energy consumption, and environmental impacts. Blockchain systems that track products through circular economy loops provide verifiable data sources for EPDs, reducing the cost and time required for sustainability reporting whilst improving accuracy and credibility.\n\n\t- ### Business Impact and ROI\n\t\t- Circular economy blockchain implementations deliver business value through multiple channels. Enhanced product value retention represents a primary benefit, with second-hand markets for blockchain-verified products commanding 15-30% price premiums due to buyer confidence in authenticity and condition. Fairphone's data shows that blockchain-documented devices maintain 65% of original value after three years compared to 40% for comparable smartphones without lifecycle documentation.\n\t\t- Material recovery optimisation generates substantial cost savings for manufacturers. BMW's battery tracking enables recovery of high-value materials including lithium, nickel, and cobalt worth approximately £3,000 per battery pack. The detailed performance history increases second-life battery values by £1,500-2,000 per unit compared to batteries with unknown history, creating significant revenue from assets that would otherwise have minimal residual value.\n\t\t- Compliance cost reduction proves significant for companies subject to extended producer responsibility regulations. Automated blockchain-based reporting reduces compliance administrative costs by 50-70%, with verification that previously required manual audit processes now handled through smart contracts. French electronics manufacturers participating in blockchain EPR pilots report annual savings of £200,000-500,000 per company through reduced compliance overhead.\n\t\t- Brand value enhancement from credible sustainability credentials attracts customers willing to pay premiums for circular economy products. Studies from Fashion for Good show that blockchain-verified sustainable fashion items command average price premiums of 12-18%, with younger consumers particularly responsive to verifiable sustainability claims. This premium translates to significant revenue for brands successfully communicating circular economy commitments.\n\t\t- New circular business models enabled by blockchain tracking create additional revenue streams. Product-as-a-service offerings, enabled by lifecycle tracking that maintains asset value, are growing across multiple industries. Philips Lighting's pay-per-lux service, supported by blockchain asset tracking, has generated over £100 million in annual recurring revenue whilst reducing environmental impact through extended product lifecycles and optimised material recovery.\n\t\t- Implementation costs vary based on product complexity and existing systems integration requirements. Digital product passport implementation costs range from £0.50-5 per product for simple items like textiles to £50-100 for complex electronics requiring detailed material documentation. Platform subscription costs for mid-sized manufacturers typically run £75,000-200,000 annually, with positive ROI generally achieved within 2-3 years through material recovery improvements and premium pricing.\n\n\t- ### Sustainability Benefits\n\t\t- Circular economy blockchain tracking delivers measurable environmental benefits through waste reduction, resource conservation, and carbon emissions mitigation. Extended product lifespans enabled by repair documentation and second-hand market trust reduce the need for new production, which represents the majority of environmental impact for most products. Fairphone's lifecycle analysis shows that extending smartphone life from 2.5 years to 5 years reduces carbon footprint by approximately 40%, equivalent to preventing 50 kg CO2 per device.\n\t\t- Material recovery optimisation prevents valuable resources from entering landfills and reduces demand for virgin material extraction. BMW's battery recycling programme, supported by blockchain tracking, recovers 95% of valuable materials from end-of-life batteries, preventing mining of approximately 20 tonnes of cobalt and 100 tonnes of nickel annually per 10,000 recycled batteries. This material recovery avoids the substantial environmental impact of mining operations including habitat destruction, water pollution, and carbon emissions from extraction and refining processes.\n\t\t- Reduced electronic waste represents a critical environmental benefit. Global e-waste reached 53.6 million tonnes in 2019, with only 17.4% formally recycled. Blockchain circular economy systems increase proper recycling rates by 25-40% through improved material documentation that makes recycling economically viable and ensures hazardous materials receive proper handling. The EU estimates that achieving circular economy targets could prevent 35 million tonnes of CO2 emissions annually by 2030, equivalent to removing 7.5 million cars from roads.\n\t\t- Textile waste reduction addresses one of fashion's most significant environmental challenges. The fashion industry produces 92 million tonnes of waste annually, with only 1% of textiles recycled into new garments. Blockchain-enabled textile-to-textile recycling programmes increase recovery rates by documenting fibre composition, previous treatments, and dye chemistry that inform recycling processes. Fashion for Good projects that blockchain-enabled textile circularity could prevent 25 million tonnes of textile waste annually by 2030, whilst reducing fashion industry carbon emissions by 15-20%.\n\t\t- Water and energy conservation from circular economy practices compound environmental benefits. Manufacturing new products from recycled materials typically requires 60-90% less energy than virgin production, whilst reducing water consumption by similar percentages. Blockchain tracking that optimises material recovery and enables remanufacturing prevents substantial resource consumption across multiple industries.\n\n\t- ### Technology Stack\n\t\t- **Blockchain Platforms**: [[Hyperledger Fabric]] serves many circular economy implementations due to permissioned network capabilities that protect commercially sensitive data whilst enabling supply chain transparency. [[Ethereum]] and [[VeChain]] support applications requiring public transparency and consumer access. Hybrid approaches combining public chains for product registration with private channels for detailed business data are increasingly common.\n\t\t- **Product Identification Technologies**: NFC tags provide convenient consumer access to digital product passports via smartphone scanning, with costs of £0.15-1 per tag. RFID enables automated inventory management and lifecycle tracking without line-of-sight requirements. QR codes offer lowest cost option at £0.01-0.05 per product but require active scanning. Some implementations combine multiple identification technologies to support different use cases throughout product lifecycles.\n\t\t- **Data Standards and Ontologies**: [[GS1]] Digital Link and EPCIS standards enable interoperability between blockchain platforms and existing enterprise systems. Industry-specific ontologies including Battery Passport Data Standard and Digital Product Passport schema ensure consistent data structures across implementations. Semantic web technologies including RDF and OWL enable integration with broader data ecosystems and support complex queries across product lifecycle data.\n\t\t- **IoT Integration**: Connected products including smart appliances, vehicles, and industrial equipment can automatically report usage data, performance metrics, and maintenance needs to blockchain systems. This telemetry enables predictive maintenance, accurate residual value assessment, and optimised second-life applications. Integration with [[IoT]] platforms including AWS IoT, Azure IoT Hub, and Google Cloud IoT Core provides scalable infrastructure for device connectivity.\n\t\t- **Identity and Authentication**: Decentralised identity systems enable secure authentication of supply chain participants, repair technicians, recyclers, and other ecosystem stakeholders. [[Decentralised Identifiers]] (DIDs) and verifiable credentials ensure that lifecycle events are attributed to verified entities, preventing fraudulent data entry whilst protecting privacy. Integration with existing enterprise identity systems including Active Directory and OAuth providers enables seamless user experience.\n\t\t- **Analytics and Visualisation**: Business intelligence tools process blockchain circular economy data to generate insights about material flows, product longevity trends, repair patterns, and recycling performance. Machine learning algorithms identify optimisation opportunities, predict product end-of-life timing, and match end-of-life products with appropriate second-life applications or recycling pathways.\n\n\t- ### Challenges and Limitations\n\t\t- Retrofitting existing products with digital identities presents substantial challenges for circular economy implementation. Whilst new products can incorporate NFC tags or RFID chips during manufacturing, billions of existing products lack digital identification. Retrofitting solutions including adhesive tags or blockchain-linked serial number databases provide partial solutions but cannot match the integration achievable with design-time implementation.\n\t\t- Data quality and completeness depend on accurate information entry throughout product lifecycles. Manual data entry errors, incomplete documentation of repairs, and informal recycling processes that bypass official channels create data gaps that reduce system effectiveness. Ensuring that all supply chain participants, including small repair shops and informal recyclers, participate in blockchain documentation requires significant education, incentive alignment, and user experience optimisation.\n\t\t- Privacy concerns arise from detailed product tracking that may reveal personal information about users, purchasing patterns, and behaviour. Whilst blockchain circular economy systems focus on product rather than person tracking, the line blurs when products remain with individual owners for extended periods. Privacy-preserving technologies including zero-knowledge proofs and selective disclosure enable verification of product claims whilst protecting user privacy, but implementation complexity increases substantially.\n\t\t- Cross-border data flows create regulatory complexity under data protection regulations including [[GDPR]] and various national privacy laws. Circular economy systems must balance transparency requirements with data protection obligations, potentially requiring region-specific data governance frameworks. The global nature of supply chains makes purely jurisdictional approaches impractical, requiring international coordination that progresses slowly.\n\t\t- Standardisation fragmentation across different industries, regions, and initiatives creates interoperability challenges. Multiple competing digital product passport standards, blockchain platforms, and data schemas prevent seamless data exchange. Industry consolidation around common standards will likely take 5-10 years, during which proprietary systems may create lock-in effects and limit circular economy scaling.\n\t\t- Economic viability for low-value products remains questionable. Whilst blockchain tracking proves economically justified for electronics, vehicles, and other high-value items, implementation costs may exceed lifetime value for products like basic textiles, packaging, or low-cost consumer goods. Shared infrastructure and ultra-low-cost identification technologies may address this challenge, but fundamental economics may limit circular economy blockchain applicability to higher-value product categories.\n\n\t- ### Future Developments\n\t\t- Integration of blockchain circular economy systems with [[Artificial Intelligence]] will enable autonomous circular economy decision-making. AI algorithms analysing product condition data, market demand for second-hand items, material prices, and recycling capacities can optimally route products to highest-value next uses. This optimisation could increase material recovery values by 30-50% whilst reducing environmental impact through intelligent lifecycle management.\n\t\t- Augmented reality applications integrated with blockchain product passports will provide repair technicians with interactive guidance for disassembly, component replacement, and reassembly based on specific product history and configuration. This technology could reduce repair costs by 40-60% whilst improving repair quality, making product lifetime extension economically attractive for more product categories.\n\t\t- Tokenisation of circular economy value streams may create new financing mechanisms for circular business models. Tokens representing future material recovery value or certified carbon savings from extended product life could enable innovative financing structures that reduce upfront costs for circular economy transitions. Early experiments with circular economy tokens show potential for creating liquid markets in environmental attributes.\n\t\t- Regulatory mandates for digital product passports will accelerate adoption substantially. The EU's phased implementation beginning with batteries in 2026 and extending to electronics, textiles, and furniture by 2030 will create mandatory blockchain infrastructure affecting billions of products. This regulatory driver will likely establish blockchain circular economy systems as standard practice within developed economies.\n\t\t- Cross-industry circular economy platforms may emerge as shared infrastructure reducing costs through economies of scale. Rather than sector-specific implementations, universal circular economy platforms could track diverse products from smartphones to furniture using common data standards and shared blockchain infrastructure. Such platforms could reduce implementation costs by 60-80% whilst improving interoperability and enabling cross-sector material flows.\n\n\t- #\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Metaverse platforms continue to evolve with focus on interoperability and open standards\n  - Web3 integration accelerating with decentralised identity and asset ownership\n  - Enterprise adoption growing in virtual collaboration, training, and digital twins\n  - UK companies increasingly active in metaverse development and immersive technologies\n\n- Technical capabilities\n  - Real-time rendering at photorealistic quality levels\n  - Low-latency networking enabling seamless multi-user experiences\n  - AI-driven content generation and procedural world building\n  - Spatial audio and haptics enhancing immersion\n\n- UK and North England context\n  - Manchester: Digital Innovation Factory supports metaverse startups and research\n  - Leeds: Holovis leads in immersive experiences for entertainment and training\n  - Newcastle: University research in spatial computing and interactive systems\n  - Sheffield: Advanced manufacturing using digital twin technology\n\n- Standards and frameworks\n  - Metaverse Standards Forum driving interoperability protocols\n  - WebXR enabling browser-based immersive experiences\n  - glTF and USD for 3D asset interchange\n  - Open Metaverse Interoperability Group defining cross-platform standards\n\n## Metadata\n\n- **Last Updated**: 2025-11-16\n- **Review Status**: Automated remediation with 2025 context\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable\n\n\n## References\n\t\t- [[BC-0440-supply-chain-traceability]]\n\t\t- [[BC-0450-carbon-credit-tracking]]\n\t\t- [[BC-0443-luxury-goods-authentication]]\n\t\t- [[BC-0447-product-authenticity]]\n\t\t- [[BC-0025-smart-contracts]]\n\t\t- [[BC-0036-iot-integration]]\n\t\t- [[BC-0266-sustainability]]\n\t\t- [[Digital Product Passport]]\n\t\t- [[VeChain]]\n\t\t- [[Hyperledger Fabric]]\n\t\t- [[GS1]]\n\t\t- [[Extended Producer Responsibility]]",
  "properties": {
    "id": "bc-0449-circular-economy-ontology",
    "collapsed": "true",
    "- ontology": "true",
    "- term-id": "BC-0449",
    "- preferred-term": "Circular Economy",
    "- source-domain": "blockchain",
    "- status": "stub-needs-content",
    "- public-access": "true",
    "- content-status": "minimal-placeholder-requires-authoring",
    "- definition": "A component of the blockchain ecosystem.",
    "- maturity": "draft",
    "- owl:class": "bc:CircularEconomy",
    "- owl:physicality": "ConceptualEntity",
    "- owl:role": "Concept",
    "- belongsToDomain": "[[BlockchainDomain]]"
  },
  "backlinks": [
    "BC-0450-carbon-credit-tracking"
  ],
  "wiki_links": [
    "IoT",
    "VeChain",
    "BC-0447-product-authenticity",
    "BC-0440-supply-chain-traceability",
    "BC-0266-sustainability",
    "BC-0450-carbon-credit-tracking",
    "GDPR",
    "Decentralised Identifiers",
    "BC-0025-smart-contracts",
    "Ethereum",
    "Artificial Intelligence",
    "BC-0443-luxury-goods-authentication",
    "Extended Producer Responsibility",
    "BC-0036-iot-integration",
    "Digital Product Passport",
    "Hyperledger Fabric",
    "BlockchainDomain",
    "GS1"
  ],
  "ontology": {
    "term_id": "BC-0449",
    "preferred_term": "Circular Economy",
    "definition": "A component of the blockchain ecosystem.",
    "source_domain": "blockchain",
    "maturity_level": null,
    "authority_score": null
  }
}