{
  "title": "Decentralized Identifiers",
  "content": "- ### OntologyBlock\n  id:: bc-0457-decentralized-identifiers-ontology\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: BC-0457\n\t- preferred-term:: Decentralized Identifiers\n\t- source-domain:: blockchain\n\t- status:: stub-needs-content\n\t- public-access:: true\n\t- content-status:: minimal-placeholder-requires-authoring\n\t- public-access:: true\n\t- definition:: A component of the blockchain ecosystem.\n\t- maturity:: draft\n\t- owl:class:: bc:DecentralizedIdentifiers\n\t- owl:physicality:: ConceptualEntity\n\t- owl:role:: Concept\n\t- belongsToDomain:: [[BlockchainDomain]]\n\n## OWL Formal Semantics\n\n```clojure\n;; OWL Functional Syntax\n\n(Declaration (Class :DecentralizedIdentifiers))\n\n;; Annotations\n(AnnotationAssertion rdfs:label :DecentralizedIdentifiers \"Decentralized Identifiers\"@en)\n(AnnotationAssertion rdfs:comment :DecentralizedIdentifiers \"A component of the blockchain ecosystem.\"@en)\n\n;; Data Properties\n(AnnotationAssertion dcterms:identifier :DecentralizedIdentifiers \"BC-0457\"^^xsd:string)\n```\n\n- ## About Decentralized Identifiers\n  id:: decentralized-identifiers-about\n\n\t- Decentralised Identifiers (DIDs) constitute the foundational layer of [[BC-0456-self-sovereign-identity|Self-Sovereign Identity]] infrastructure, providing globally unique identifiers that individuals and organisations control independently without relying on centralised registration authorities, domain registrars, or certificate authorities. Published as a [[W3C]] Recommendation in July 2022 with v1.0 and continuing refinement in v1.1 Working Draft, DIDs represent a new type of identifier designed explicitly for verifiable, decentralised digital identity. Unlike traditional identifiers—email addresses tied to service providers, phone numbers allocated by telecommunications authorities, or domain names registered through ICANN-accredited registrars—DIDs enable the subject of the identifier to prove cryptographic control through possession of private keys, update associated metadata without permission from third parties, and persist identifiers indefinitely without ongoing fees or institutional dependencies. The DID specification separates identifier syntax (the URI format) from resolution mechanisms (how to retrieve associated metadata), enabling diverse implementation methods optimised for different use cases, trust models, and performance characteristics. DID methods register identifiers on various substrates including public blockchains like [[Bitcoin]] and [[Ethereum]], permissioned distributed ledgers such as [[BC-0435-hyperledger-indy|Hyperledger Indy]], peer-to-peer networks, and even traditional web infrastructure. This flexibility allows implementers to select appropriate decentralisation, censorship resistance, and performance trade-offs for specific applications. Microsoft's ION network, implementing the Sidetree protocol atop Bitcoin, demonstrates enterprise-scale DID infrastructure capable of processing tens of thousands of operations per second by batching DID state changes into compact transactions anchored on Bitcoin's blockchain whilst storing detailed operational data on IPFS. The [[Sovrin Network]] utilises [[BC-0435-hyperledger-indy|Hyperledger Indy]] for permissioned DID registration with governance frameworks ensuring quality and accountability amongst network stewards. DIDs serve as the identifier layer enabling [[BC-0458-verifiable-credentials|Verifiable Credentials]] to reference issuers, subjects, and schemas in a globally resolvable yet privacy-preserving manner, forming the cryptographic trust infrastructure for [[BC-0459-digital-identity-wallet|digital identity wallets]] and [[BC-0460-identity-verification|identity verification]] systems deployed from government programmes to enterprise applications.\n\n\t- ### Technical Architecture\n\t\t- **DID Syntax and Structure**: The DID specification defines a URI scheme with the format `did:method:method-specific-identifier`, where the method component identifies which DID method specification governs the identifier's creation, resolution, update, and deactivation. For example, `did:sov:5nDyJVP1NrcPAttP3xwMB9` uses the Sovrin method for identifiers registered on the [[Sovrin Network]], whilst `did:ion:EiClkZMDxPKqC9c-umQfTkR8vvZ9JPhl_xLDI9Nfk38w5w` employs the ION method anchoring to Bitcoin. Method-specific identifiers may encode cryptographic key material directly (as in did:key), reference blockchain transaction identifiers, or use opaque strings resolvable through method-specific mechanisms. This separation of concerns enables innovation in underlying infrastructure whilst maintaining consistent identifier semantics and resolution interfaces. The URI structure supports optional paths, queries, and fragments enabling fine-grained reference to specific public keys, service endpoints, or other resources within a DID Document: `did:example:123456/path?query#fragment`.\n\n\t\t- **DID Documents**: Resolving a DID retrieves its associated DID Document, a JSON-LD data structure containing cryptographic public keys, authentication methods, authorisation policies, and service endpoints associated with the DID subject. Public keys listed in the verification method property enable the DID subject to prove control through digital signatures, encrypt communications, or authenticate to services. The authentication property specifies which verification methods are approved for authenticating as the DID subject, whilst assertion method designates keys authorised for issuing [[BC-0458-verifiable-credentials|Verifiable Credentials]]. Service endpoints provide network addresses for communication channels, credential repositories, or other services associated with the DID. This metadata enables relying parties to discover how to interact with the DID subject—which protocols to use, which keys to trust for which purposes, and where to direct communications—without prior coordination or centralised directories.\n\n\t\t- **DID Resolution**: The process of obtaining a DID Document from a DID employs method-specific resolution procedures defined by each DID method specification. Universal resolver implementations provide a standardised interface accepting DIDs and returning DID Documents regardless of underlying method, abstracting resolution complexity from applications. For blockchain-based methods like `did:sov` on [[BC-0435-hyperledger-indy|Hyperledger Indy]], resolution queries the distributed ledger for the most recent DID Document state recorded in transactions signed by the DID controller. For `did:ion`, resolution retrieves batched operations from IPFS referenced by Bitcoin blockchain transactions and applies them chronologically to reconstruct current DID state. The `did:web` method resolves DIDs by fetching DID Documents from HTTPS URLs derived from the DID, leveraging existing web infrastructure whilst sacrificing some decentralisation properties. Resolution metadata accompanies DID Documents providing information about resolution timestamp, method version, and resolution-specific details enabling verifiers to assess freshness and authenticity.\n\n\t\t- **Cryptographic Foundations**: DIDs establish trust through public key cryptography rather than institutional authority. DID subjects prove control by demonstrating possession of private keys corresponding to public keys listed in their DID Documents. Authentication challenges require the subject to sign messages with private keys, producing signatures verifiable against public keys in the DID Document. This cryptographic binding enables strong authentication without passwords, security questions, or shared secrets vulnerable to phishing and database breaches. Key rotation mechanisms allow DID controllers to update verification methods in response to key compromise, cryptographic algorithm advances, or operational changes whilst maintaining persistent identifier continuity. Multi-signature configurations support organisational DIDs requiring threshold numbers of authorised parties to approve updates, implementing separation of duties and reducing single points of failure.\n\n\t- ### DID Methods and Implementations\n\t\t- **did:sov (Sovrin)**: The Sovrin DID method, implemented on [[BC-0435-hyperledger-indy|Hyperledger Indy]], provides a permissioned blockchain-based DID registry with governance frameworks ensuring network quality and legal accountability. Network stewards operate validator nodes under the Sovrin Governance Framework defining operational requirements, technical standards, and legal responsibilities. DID creation transactions write DID Documents to the Sovrin ledger, whilst update transactions modify metadata under cryptographic authorisation from the DID controller. The method supports sophisticated privacy-preserving capabilities including pairwise DIDs—unique identifiers used for individual relationships preventing correlation across contexts. [[BC-0435-hyperledger-indy|Hyperledger Indy]]'s revocation registry mechanisms enable credential issuers to register revocation status whilst preserving holder privacy through cryptographic accumulators. British Columbia's OrgBook leverages did:sov for over 1.4 million organisational identifiers supporting verifiable credential issuance for business registrations and permits.\n\n\t\t- **did:ion (Microsoft ION)**: Microsoft's Identity Overlay Network implements the Sidetree protocol atop Bitcoin, achieving unprecedented scale through operation batching. Rather than writing individual DID operations to Bitcoin—prohibitively expensive at scale—ION aggregates tens of thousands of DID create, update, and deactivate operations into batched transactions. Bitcoin blockchain transactions contain hashes referencing IPFS content-addressed storage holding the complete operational details. ION nodes retrieve, validate, and apply these operations chronologically to maintain current DID state. This architecture achieves tens of thousands of operations per second throughput whilst inheriting Bitcoin's censorship resistance and immutability properties. The network is permissionless—anyone can operate an ION node or create DIDs without approval—whilst remaining trustless through Bitcoin's proof-of-work consensus. Microsoft has registered over 100,000 DIDs on ION, demonstrating enterprise-scale viability. The did:ion method specification defines operation formats, state calculation rules, and resolution procedures ensuring deterministic DID Document reconstruction across independent nodes.\n\n\t\t- **did:ethr (Ethereum)**: The Ethereum DID method leverages [[Ethereum]] smart contracts for DID registration and management, enabling programmable identity with on-chain logic governing identifier updates and delegation. DID controllers interact with the Ethereum DID Registry smart contract to register DIDs, add verification methods, designate delegates authorised to act on the DID's behalf, and configure attributes. The method benefits from Ethereum's extensive infrastructure, developer ecosystem, and composability with decentralised finance and token systems. However, Ethereum's gas fees for on-chain transactions create cost considerations for high-volume DID operations. Layer 2 scaling solutions and side chains offer reduced transaction costs whilst maintaining security properties through periodic settlement to Ethereum mainnet. The method supports ENS (Ethereum Name Service) integration enabling human-readable names resolving to DIDs, bridging user-friendly naming with cryptographic identifier infrastructure.\n\n\t\t- **did:web**: The web DID method sacrifices some decentralisation properties for simplicity and low barrier to entry by hosting DID Documents on traditional web servers. A DID like `did:web:example.com:user:alice` resolves to `https://example.com/user/alice/did.json`, fetching the DID Document via HTTPS. This method requires no blockchain infrastructure, transaction fees, or specialised software beyond standard web hosting, enabling rapid deployment for organisations with existing web infrastructure. However, the method depends on DNS and TLS certificate authorities—centralised systems that can censor, redirect, or impersonate domains. The hosting organisation controls DID persistence and availability, reintroducing dependencies that fully decentralised methods avoid. Despite these trade-offs, did:web serves valuable roles in enterprise deployments where organisational control is acceptable and regulatory compliance requires identified parties responsible for identifier management.\n\n\t\t- **did:key**: The key DID method derives identifiers directly from cryptographic public keys, encoding the key material in the DID itself: `did:key:z6MkpTHR8VNsBxYAAWHut2Geadd9jSwuBV8xRoAnwWsdvktH`. Resolution generates a DID Document containing the encoded public key without querying any registry or network. This method offers maximal simplicity—no blockchain, no server infrastructure, no external dependencies—making it ideal for ephemeral identifiers, testing, and scenarios where permanent identifier persistence is unnecessary. However, did:key identifiers cannot be updated or rotated—compromised keys require generating new identifiers, breaking existing relationships. The method serves specific use cases like short-lived session identifiers and demonstration environments whilst being inappropriate for long-term identity requiring key rotation capabilities.\n\n\t- ### DID Resolution and Dereferencing\n\t\t- **Universal Resolver**: The Universal Resolver project provides a unified interface for resolving DIDs across multiple methods, abstracting method-specific complexity from applications. Implementers deploy resolver drivers for each supported DID method, conforming to standard input/output interfaces. Applications submit DIDs to the universal resolver, which routes requests to appropriate method drivers and returns standardised DID Documents plus resolution metadata. This architecture enables application developers to support diverse DID methods without implementing method-specific resolution logic. The Universal Resolver operates as open-source software deployable locally for privacy-sensitive applications or accessible via hosted instances for convenience. Resolution metadata includes information about which resolver version and driver performed resolution, enabling auditability and debugging.\n\n\t\t- **DID URL Dereferencing**: Beyond resolving DIDs to DID Documents, the specification defines dereferencing processes for DID URLs containing paths, queries, or fragments. A DID URL like `did:example:123#key-1` dereferences to the specific verification method identified by `key-1` within the DID Document. This enables precise reference to individual public keys, service endpoints, or other resources without retrieving and parsing entire DID Documents. Dereferencing protocols support service discovery—applications determine communication endpoints by dereferencing service fragments—and key rotation transparency—referring to keys by identifier rather than by value ensures references automatically resolve to current keys after rotation.\n\n\t\t- **Caching and Performance**: DID resolution may involve blockchain queries, IPFS retrievals, or network requests with latency and availability dependencies. Implementations employ caching strategies balancing performance against freshness requirements. Verifiers performing high-volume credential verification cache DID Documents with time-to-live parameters appropriate to their risk tolerance and operational context. For low-risk scenarios, caching for hours or days provides acceptable performance, whilst high-value transactions might resolve DIDs freshly for each verification. Caching policies consider update frequency—DIDs for long-lived organisational identities change infrequently, whilst individual DIDs might rotate keys more regularly. Resolution metadata includes timestamps enabling cache invalidation strategies based on document age.\n\n\t- ### Standards and Governance\n\t\t- **W3C DID Core Specification**: The W3C Decentralized Identifier v1.0 specification achieved Recommendation status in July 2022 following extensive development, implementation testing, and interoperability validation. The specification defines DID syntax, DID Document data model, DID URL syntax, and resolution/dereferencing interfaces whilst deliberately remaining agnostic about registry implementation. This separation enables diverse DID methods optimised for different requirements. The W3C DID v1.1 Working Draft, governed by the 18 August 2025 W3C Process Document, incorporates refinements based on implementation experience including enhanced privacy considerations, expanded security guidance, and improved interoperability specifications. The DID Working Group coordinates with related W3C efforts including Verifiable Credentials, Web Authentication (WebAuthn), and Decentralized Identifiers Resolution to ensure coherent specifications addressing the complete decentralised identity stack.\n\n\t\t- **DID Method Registry**: The W3C maintains a registry of DID method specifications documenting method names, specification locations, and implementation status. This registry provides discoverable documentation for DID method diversity whilst maintaining minimal barriers to registration—method creators simply submit specifications documenting syntax, operations, and security considerations. The registry includes mature, production-deployed methods like did:sov and did:ion alongside experimental methods exploring novel approaches. This permissionless innovation model enables rapid evolution whilst creating fragmentation challenges—applications must choose which methods to support, and cross-method interoperability requires standardised higher-layer protocols.\n\n\t\t- **Trust Over IP DID Infrastructure**: The [[Trust Over IP Foundation]]'s Layer One specifications address DID infrastructure requirements for production deployments including performance benchmarks, availability requirements, governance frameworks, and incident response procedures. The Foundation's Technology Stack Working Group develops guidelines for selecting appropriate DID methods for different use cases, considering factors including decentralisation requirements, performance characteristics, cost structures, and regulatory compliance needs. Governance Stack specifications define policies for DID method governance including update procedures, dispute resolution, and liability allocation when DID Documents contain errors or when method infrastructure failures impact relying parties.\n\n\t- ### Security and Privacy Considerations\n\t\t- **Key Management**: DIDs place critical importance on cryptographic key security—loss or compromise of private keys controlling DIDs has severe consequences including permanent loss of identifier control or impersonation by attackers. Hardware security modules, trusted execution environments, and secure enclaves provide tamper-resistant key storage for high-value DIDs. Multi-signature schemes requiring threshold numbers of keys reduce single points of failure for organisational DIDs. Key derivation hierarchies enable generating numerous DIDs from master seeds whilst maintaining backup simplicity. Recovery mechanisms balance recoverability against security: social recovery requires trusted contacts to collaborate in key regeneration, encrypted cloud backup enables recovery from credentials users remember, and time-locked recovery ensures even forgotten credentials eventually enable access. The [[Trust Over IP Foundation]] provides key management guidance recognising that appropriate approaches vary dramatically between consumer applications tolerating some recovery friction versus high-assurance government applications requiring maximum security.\n\n\t\t- **DID Correlation and Privacy**: Reusing DIDs across contexts enables observers to correlate activities and build comprehensive profiles tracking individuals' digital behaviour. Privacy-preserving DID architectures employ pairwise DIDs—unique identifiers for each relationship—preventing different verifiers from linking verification events to the same individual. [[BC-0435-hyperledger-indy|Hyperledger Indy]] implements pairwise DID generation protocols enabling unlimited DIDs derived from master keys without blockchain registration for each identifier, achieving privacy without scalability degradation. However, pairwise DIDs complicate key management and increase storage requirements. Implementers balance privacy benefits against operational complexity based on application threat models and user requirements.\n\n\t\t- **DID Document Integrity**: Ensuring DID Documents retrieved during resolution are authentic and unmodified requires various security mechanisms depending on DID method. Blockchain-based methods inherit tamper-evidence from underlying ledgers—modifications require mining new blocks or achieving consensus, detectable by independent verifiers. Digital signatures on DID Documents enable cryptographic verification of authenticity even when retrieved from untrusted sources. Resolution metadata includes cryptographic proofs enabling verifiers to validate DID Document integrity. However, DID methods like did:web rely on TLS and DNS security, inheriting vulnerabilities in certificate authority trust models and DNS infrastructure. Verifiers must assess DID method security properties when determining trust in resolved DID Documents.\n\n\t\t- **Denial of Service and Spam**: Permissionless DID methods accepting unlimited registrations face potential spam and denial-of-service attacks flooding registries with worthless identifiers. Bitcoin-based methods like did:ion impose economic costs through transaction fees creating spam disincentives, whilst methods on proof-of-work blockchains inherit rate limiting from block production intervals. Permissioned methods like did:sov employ governance frameworks restricting who can write to ledgers, preventing spam whilst introducing coordination requirements. Method designers balance openness enabling innovation against sustainability protecting infrastructure from abuse.\n\n\t- ### Real-World Deployments\n\t\t- **Microsoft ION Production Network**: Microsoft launched ION on Bitcoin mainnet in March 2021 after development and testing periods, providing production DID infrastructure for Microsoft's decentralised identity initiatives. The network supports Microsoft Authenticator's verifiable credentials functionality enabling users to receive, store, and present credentials using did:ion identifiers. Over 100,000 DIDs registered on ION demonstrate enterprise-scale viability and Bitcoin's capacity to support identity infrastructure without congestion despite limited blockchain throughput. Microsoft operates public ION nodes whilst encouraging ecosystem participants to deploy independent nodes ensuring decentralisation and censorship resistance. The implementation demonstrates that layer-two protocols atop existing blockchains provide viable paths to scalable DID infrastructure without requiring purpose-built identity blockchains.\n\n\t\t- **Sovrin Network Global Infrastructure**: The [[Sovrin Network]] operates a global permissioned DID infrastructure built on [[BC-0435-hyperledger-indy|Hyperledger Indy]] with steward nodes distributed across continents and jurisdictions. Stewards including governments, universities, and enterprises operate validator nodes under the Sovrin Governance Framework defining technical standards, operational requirements, and legal responsibilities. The network supports production deployments including British Columbia's OrgBook with 1.4 million DIDs for legal entities, educational credential systems, and healthcare verification applications. The Sovrin Foundation coordinates network governance, manages steward onboarding, and publishes trust frameworks defining roles and obligations. This governance approach demonstrates that permissioned DID methods can achieve sufficient decentralisation for trustworthy identity infrastructure whilst maintaining accountability and service level commitments.\n\n\t\t- **European Blockchain Services Infrastructure**: The European Union's EBSI implements DID infrastructure supporting cross-border public services and the European Digital Identity Wallet mandated under eIDAS 2.0. EBSI nodes operated by member state authorities provide permissioned DID registry capabilities aligned with European data protection and privacy regulations. The infrastructure supports use cases including educational credentials portable across member states, notarisation services, and trusted data registries. Over 350 organisations participate in EBSI pilots testing DID implementations for government services, demonstrating jurisdictional-scale deployment preparing for wallet rollout to hundreds of millions of citizens by 2030.\n\n\t- ### Integration with Verifiable Credentials\n\t\t- **Issuer Identification**: [[BC-0458-verifiable-credentials|Verifiable Credentials]] use DIDs to identify issuers, enabling verifiers to resolve issuer DID Documents, retrieve public keys, and cryptographically validate credential signatures without contacting issuers or consulting centralised directories. This architecture enables offline verification in disconnected environments—verifiers cache issuer DID Documents and perform signature validation locally. Credential schemas reference DIDs for schema publishers, enabling discovery of schema definitions and update notifications. Credential revocation registries use DIDs to identify registry controllers, enabling verifiers to locate current revocation status information.\n\n\t\t- **Subject Identification**: Credentials may identify subjects using DIDs, enabling privacy-preserving selective disclosure and preventing correlation through persistent identifiers. Subjects provide different DIDs to different verifiers, preventing collusion-based tracking whilst maintaining cryptographic binding between credentials and subjects through signatures involving DID-associated keys. However, regulatory requirements sometimes mandate persistent subject identifiers for audit trails and compliance verification, creating tensions between privacy and accountability that governance frameworks must address through context-appropriate identifier policies.\n\n\t\t- **Schema and Type Registries**: DID-identified schemas define credential structure and semantics, enabling verifiers to understand credential contents and validation rules. Schema publishers register schemas on verifiable data registries referenced by DID-based identifiers. Updates to schemas receive new DID versions maintaining backward compatibility whilst enabling evolution. Standardised credential types (educational qualifications, professional licences, government-issued identity) benefit from DID-identified canonical schemas maintained by standards organisations, industry consortia, or government authorities. The [[W3C]] Verifiable Credentials specification and [[Trust Over IP Foundation]] guidelines define patterns for DID-schema integration enabling interoperability across ecosystems.\n\n\t- ### Performance and Scalability\n\t\t- **Batch Operations**: Methods like did:ion demonstrate that batching operations dramatically improves throughput and reduces costs. Individual DID operations batched into aggregate transactions amortise blockchain fees across thousands of identifiers whilst maintaining cryptographic integrity. IPFS content addressing enables compact on-chain footprints referencing larger off-chain data structures. This architecture scales to billions of DIDs without blockchain congestion, demonstrating viability for global-scale identity infrastructure.\n\n\t\t- **Light Clients and SPV**: Simplified Payment Verification (SPV) techniques from Bitcoin enable lightweight DID resolution without maintaining complete blockchain copies. Light clients verify DID operations against block headers and Merkle proofs, dramatically reducing storage and bandwidth requirements whilst maintaining cryptographic security. Mobile wallet applications implement light client protocols, enabling DID operations from resource-constrained devices without relying on trusted intermediaries for blockchain access.\n\n\t\t- **Caching Strategies**: Production DID systems implement multi-tier caching balancing freshness, performance, and cost. Edge caches near verifiers reduce resolution latency for frequently accessed DIDs. Content delivery networks distribute DID Documents globally minimising regional latency variations. Time-based cache invalidation policies align cache lifetimes with DID update frequencies—organisational DIDs updated infrequently benefit from long cache times, whilst individual DIDs with regular key rotation require shorter caching. Cache coherency protocols ensure verifiers detect DID updates within acceptable timeframes for their risk tolerances.\n\n\t- ### Interoperability and Standards Alignment\n\t\t- **Cross-Method Compatibility**: Applications supporting multiple DID methods require consistent interfaces abstracting method-specific details. Universal resolvers provide standardised resolution interfaces, whilst common DID Document formats enable uniform parsing regardless of underlying method. However, methods offer different capabilities—some support key rotation whilst others provide immutable identifiers, some offer privacy features whilst others prioritise auditability. Applications must gracefully handle method diversity, potentially restricting acceptable methods for security-critical operations whilst accepting broader method sets for lower-risk contexts.\n\n\t\t- **Integration with Existing PKI**: DIDs complement rather than replace existing Public Key Infrastructure in hybrid deployments. X.509 certificates may reference DIDs in subject alternative name extensions, enabling certificate subjects to prove additional cryptographic bindings. DID Documents may reference traditional certificate chains, leveraging established certificate authority trust for bootstrap purposes. WebAuthn integration enables DIDs to identify relying parties and authenticators, bridging password less authentication with decentralised identity. These integration patterns enable incremental DID adoption without requiring wholesale replacement of functioning infrastructure.\n\n\t- ### Regulatory and Compliance Considerations\n\t\t- **eIDAS Qualified Signatures**: The European eIDAS 2.0 regulation recognises qualified electronic signatures created using qualified electronic signature creation devices meeting technical standards. DID-based signatures may achieve qualified status when keys reside in certified hardware security modules and signature creation follows specified procedures. This legal recognition enables DID-signed credentials and documents to carry equivalent legal weight to handwritten signatures for contracts, government filings, and regulated transactions. Technical specifications define requirements for DID methods, key management, and signature formats ensuring compliance whilst preserving decentralisation properties.\n\n\t\t- **GDPR and Data Protection**: DID Documents potentially contain personal data subject to [[GDPR]] when they include names, organisational affiliations, or other identifying information. Data minimisation principles encourage DIDs containing only cryptographic material without personal data, using Verifiable Credentials to convey identity attributes. Right to erasure requires DID deactivation mechanisms ensuring DID Documents can be removed from registries, though blockchain immutability creates tensions with deletion requirements. Pseudonymous DIDs used exclusively for privacy-preserving interactions may fall outside GDPR scope when insufficient information exists for re-identification. Governance frameworks must clearly allocate data controller and processor responsibilities for DID infrastructure operators.\n\n\t- ### Future Directions\n\t\t- **Quantum-Resistant Cryptography**: Current DID implementations rely on elliptic curve cryptography vulnerable to quantum computer attacks. Transitioning to post-quantum signature schemes requires coordinated DID method updates, cryptographic library migrations, and wallet software upgrades whilst maintaining backward compatibility during transition periods. DID Document flexibility supporting multiple verification methods enables gradual migration—DIDs can advertise both classical and post-quantum keys, with verifiers selecting appropriate algorithms based on their quantum threat assessments. Standards organisations including NIST are finalising post-quantum algorithms informing future DID specification updates.\n\n\t\t- **Layer 2 and Side chain Integration**: Scalability demands drive exploration of layer 2 scaling solutions including state channels, optimistic rollups, and validity rollups for DID operations. These approaches batch numerous operations off-chain with periodic settlement to base layer blockchains, achieving higher throughput and lower costs whilst maintaining security properties through cryptographic proofs. Side chains with different consensus mechanisms optimised for identity workloads may provide specialised DID infrastructure whilst anchoring to general-purpose blockchains for security.\n\n\t\t- **DID Portability**: Enabling DID migration between methods—moving an identifier from did:ethr to did:ion—while maintaining identifier continuity presents technical and governance challenges. Cryptographic proofs demonstrating the same keys control DIDs across methods could enable portability, though method-specific identifier structures complicate direct migration. Meta-methods or bridging protocols may enable identifier portability as the ecosystem matures, reducing lock-in and increasing competition amongst method providers.\n\n\t- ### Related Concepts\n\t\t- [[BC-0456-self-sovereign-identity|Self-Sovereign Identity]]\n\t\t- [[BC-0458-verifiable-credentials|Verifiable Credentials]]\n\t\t- [[BC-0459-digital-identity-wallet|Digital Identity Wallet]]\n\t\t- [[BC-0460-identity-verification|Identity Verification]]\n\t\t- [[BC-0435-hyperledger-indy|Hyperledger Indy]]\n\t\t- [[Sovrin Network]]\n\t\t- [[Trust Over IP Foundation]]\n\t\t- [[W3C]]\n\t\t- [[Bitcoin]]\n\t\t- [[Ethereum]]\n\t\t- [[GDPR]]\n\t\t- [[eIDAS]]\n\n\t- ### Original Content\n\t  collapsed:: true\n\t\t- ```\n\n\t\t  ```\n\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Metaverse platforms continue to evolve with focus on interoperability and open standards\n  - Web3 integration accelerating with decentralised identity and asset ownership\n  - Enterprise adoption growing in virtual collaboration, training, and digital twins\n  - UK companies increasingly active in metaverse development and immersive technologies\n\n- Technical capabilities\n  - Real-time rendering at photorealistic quality levels\n  - Low-latency networking enabling seamless multi-user experiences\n  - AI-driven content generation and procedural world building\n  - Spatial audio and haptics enhancing immersion\n\n- UK and North England context\n  - Manchester: Digital Innovation Factory supports metaverse startups and research\n  - Leeds: Holovis leads in immersive experiences for entertainment and training\n  - Newcastle: University research in spatial computing and interactive systems\n  - Sheffield: Advanced manufacturing using digital twin technology\n\n- Standards and frameworks\n  - Metaverse Standards Forum driving interoperability protocols\n  - WebXR enabling browser-based immersive experiences\n  - glTF and USD for 3D asset interchange\n  - Open Metaverse Interoperability Group defining cross-platform standards\n\n## Metadata\n\n- **Last Updated**: 2025-11-16\n- **Review Status**: Automated remediation with 2025 context\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable",
  "properties": {
    "id": "bc-0457-decentralized-identifiers-ontology",
    "collapsed": "true",
    "- ontology": "true",
    "- term-id": "BC-0457",
    "- preferred-term": "Decentralized Identifiers",
    "- source-domain": "blockchain",
    "- status": "stub-needs-content",
    "- public-access": "true",
    "- content-status": "minimal-placeholder-requires-authoring",
    "- definition": "A component of the blockchain ecosystem.",
    "- maturity": "draft",
    "- owl:class": "bc:DecentralizedIdentifiers",
    "- owl:physicality": "ConceptualEntity",
    "- owl:role": "Concept",
    "- belongsToDomain": "[[BlockchainDomain]]"
  },
  "backlinks": [
    "BC-0491-healthcare-records",
    "BC-0494-property-registry",
    "BC-0495-voting-systems"
  ],
  "wiki_links": [
    "Trust Over IP Foundation",
    "BC-0458-verifiable-credentials|Verifiable Credentials",
    "Bitcoin",
    "BC-0435-hyperledger-indy|Hyperledger Indy",
    "BC-0459-digital-identity-wallet|Digital Identity Wallet",
    "BC-0456-self-sovereign-identity|Self-Sovereign Identity",
    "BC-0460-identity-verification|Identity Verification",
    "eIDAS",
    "BC-0460-identity-verification|identity verification",
    "Ethereum",
    "BlockchainDomain",
    "W3C",
    "Sovrin Network",
    "BC-0459-digital-identity-wallet|digital identity wallets",
    "GDPR"
  ],
  "ontology": {
    "term_id": "BC-0457",
    "preferred_term": "Decentralized Identifiers",
    "definition": "A component of the blockchain ecosystem.",
    "source_domain": "blockchain",
    "maturity_level": null,
    "authority_score": null
  }
}