{
  "title": "Cryptography",
  "content": "- ### OntologyBlock\n  id:: cryptography-ontology\n  collapsed:: true\n\n  - **Identification**\n    - ontology:: true\n    - term-id:: BC-0026\n    - preferred-term:: Cryptography\n    - source-domain:: blockchain\n    - status:: complete\n    - public-access:: true\n    - version:: 1.0.0\n    - last-updated:: 2025-10-28\n\n  - **Definition**\n    - definition:: Cryptography is the mathematical science of securing information through techniques that transform data into unintelligible forms for unauthorized parties whilst enabling authorized parties to reverse the transformation, providing confidentiality, integrity, authentication, and non-repudiation in blockchain systems.\n    - maturity:: mature\n    - source:: [[ISO/IEC 18033]], [[NIST FIPS]], [[NIST SP]]\n    - authority-score:: 1.0\n\n  - **Semantic Classification**\n    - owl:class:: bc:Cryptography\n    - owl:physicality:: VirtualEntity\n    - owl:role:: Object\n    - owl:inferred-class:: bc:VirtualObject\n    - belongsToDomain:: [[CryptographicDomain]]\n    - implementedInLayer:: [[SecurityLayer]]\n\n  - #### Relationships\n    id:: cryptography-relationships\n    - is-subclass-of:: [[Mathematical Science]], [[Security Technology]], [[Information Protection]]\n\n  - #### OWL Axioms\n    id:: cryptography-owl-axioms\n    collapsed:: true\n    - ```clojure\n      Prefix(:=<http://metaverse-ontology.org/blockchain#>)\nPrefix(owl:=<http://www.w3.org/2002/07/owl#>)\nPrefix(xsd:=<http://www.w3.org/2001/XMLSchema#>)\nPrefix(rdfs:=<http://www.w3.org/2000/01/rdf-schema#>)\n\nOntology(<http://metaverse-ontology.org/blockchain/BC-0026>\n\n  ## Class Declaration\n  Declaration(Class(:Cryptography))\n\n  ## Subclass Relationships\n  SubClassOf(:Cryptography :MathematicalScience)\n  SubClassOf(:Cryptography :SecurityTechnology)\n  SubClassOf(:Cryptography :InformationProtection)\n\n  ## Essential Properties\n  SubClassOf(:Cryptography\n    (ObjectSomeValuesFrom :provides :Confidentiality))\n\n  SubClassOf(:Cryptography\n    (ObjectSomeValuesFrom :provides :Integrity))\n\n  SubClassOf(:Cryptography\n    (ObjectSomeValuesFrom :provides :Authentication))\n\n  SubClassOf(:Cryptography\n    (ObjectSomeValuesFrom :provides :NonRepudiation))\n\n  SubClassOf(:Cryptography\n    (ObjectSomeValuesFrom :uses :MathematicalPrimitive))\n\n  ## Cryptographic Primitives\n  SubClassOf(:Cryptography\n    (ObjectSomeValuesFrom :implements :HashFunction))\n\n  SubClassOf(:Cryptography\n    (ObjectSomeValuesFrom :implements :DigitalSignature))\n\n  SubClassOf(:Cryptography\n    (ObjectSomeValuesFrom :implements :EncryptionScheme))\n\n  ## Data Properties\n  DataPropertyAssertion(:securityStrength :Cryptography xsd:positiveInteger)\n  DataPropertyAssertion(:quantumResistant :Cryptography xsd:boolean)\n  DataPropertyAssertion(:computationalComplexity :Cryptography xsd:string)\n\n  ## Object Properties\n  ObjectPropertyAssertion(:secures :Cryptography :Data)\n  ObjectPropertyAssertion(:enablesFeature :Cryptography :SecurityProperty)\n  ObjectPropertyAssertion(:basedOn :Cryptography :MathematicalProblem)\n\n  ## Annotations\n  AnnotationAssertion(rdfs:label :Cryptography \"Cryptography\"@en)\n  AnnotationAssertion(rdfs:comment :Cryptography\n    \"Mathematical science securing blockchain data and operations\"@en)\n  AnnotationAssertion(:termID :Cryptography \"BC-0026\")\n\n  ## Disjoint Classes\n  DisjointClasses(:Cryptography :Steganography)\n)\n      ```\n\n- ## About Cryptography\n  id:: cryptography-about\n\n  - Cryptography is the mathematical science of securing information through techniques that transform data into unintelligible forms for unauthorized parties whilst enabling authorized parties to reverse the transformation, providing confidentiality, integrity, authentication, and non-repudiation in blockchain systems.\n  -\n  - ### Key Characteristics\n    id:: cryptography-characteristics\n    - 1. **Confidentiality**: Protecting data from unauthorized access\n    - 2. **Integrity**: Detecting unauthorized modifications\n    - 3. **Authentication**: Verifying identity and origin\n    - 4. **Non-Repudiation**: Preventing denial of actions\n    - 5. **Forward Secrecy**: Past sessions remain secure\n  -\n  - ### Technical Components\n    id:: cryptography-components\n    - **Computational Security**: Based on hard mathematical problems\n    - **Provable Security**: Formal reduction to known hard problems\n    - **Key Management**: Generation, storage, distribution, revocation\n    - **Algorithm Agility**: Ability to replace compromised algorithms\n  -\n  - ### Use Cases\n    id:: cryptography-use-cases\n    - **1. Transaction Authentication**\n    - **Application**: Proving transaction authorization\n    - **Mechanism**: Digital signatures (ECDSA on secp256k1)\n    - **Example**: Bitcoin transaction signing\n    - **Security**: 128-bit security level\n  -\n  - ### 2024-2025: Post-Quantum Cryptography Transition\n    id:: cryptography-recent-developments\n\n    The period from 2024 through 2025 marked a watershed moment in cryptographic infrastructure: the finalisation and deployment of **post-quantum cryptography (PQC)** standards designed to resist attacks from quantum computers, fundamentally reshaping security assumptions underpinning blockchain systems and digital communications.\n\n    #### NIST PQC Standards Finalised (August 2024)\n    On 13th August 2024, NIST published the first three finalised post-quantum cryptography standards:\n    - **FIPS 203** (ML-KEM, formerly CRYSTALS-Kyber): Key encapsulation mechanism\n    - **FIPS 204** (formerly CRYSTALS-Dilithium): Digital signature algorithm\n    - **FIPS 205** (SPHINCS+): Hash-based digital signature algorithm\n\n    These standards represented the culmination of NIST's multi-year PQC standardisation project, providing quantum-resistant algorithms ready for immediate deployment. The transition timeline became urgent as quantum computing capabilities advanced—whilst large-scale quantum computers capable of breaking RSA and ECC remained years away, \"harvest now, decrypt later\" attacks incentivised early adoption of quantum-resistant cryptography.\n\n    #### Fifth Algorithm Selected (March 2025)\n    On 11th March 2025, NIST selected **HQC (Hamming Quasi-Cyclic)** as the fifth algorithm for post-quantum encryption. HQC was chosen specifically as a backup standard based on different mathematical foundations than ML-KEM, providing cryptographic diversity against potential mathematical breakthroughs. Following a 90-day comment period, NIST planned to finalise the standard for release in 2027.\n\n    #### Transition Guidance and Fourth Round\n    NIST published draft guidance in November 2024 describing expected approaches to transitioning from quantum-vulnerable cryptographic algorithms to post-quantum alternatives. By October 2024, NIST down-selected to **15 second-round signature candidates** for further analysis from 40 initially accepted submissions, demonstrating continued refinement of PQC capabilities.\n\n    #### Blockchain Implications\n    Post-quantum cryptography posed existential questions for blockchain systems relying on ECDSA signatures (Bitcoin, Ethereum) and public-key cryptography. Whilst quantum computers capable of deriving private keys from public keys remained theoretical, the \"Q-Day\" threat—when quantum computers could break current cryptography—required proactive migration strategies. Bitcoin's cryptographic community, including Pieter Wuille, Gregory Maxwell, Andrew Poelstra, and Jonas Nick, began exploring quantum-resistant signature schemes whilst preserving backwards compatibility.\n\n    Bitcoin's core cryptographic protocols (ECDSA on secp256k1, SHA-256, RIPEMD-160) had withstood scrutiny since 2009 despite enormous financial incentives for breaking them, demonstrating security through time-testing. However, the quantum threat represented a qualitatively different challenge requiring algorithmic replacement rather than parameter tuning.\n\n    The cryptographic transition required coordinated ecosystem-wide upgrades: wallets, exchanges, nodes, and protocols all needed quantum-resistant signature verification. The complexity of this migration—potentially the largest coordinated cryptographic upgrade in history—underscored the importance of NIST's standards and ongoing academic research published at IEEE S&P, ACM CCS, Financial Cryptography, and Real World Crypto conferences.\n  -\n  - ### Standards & References\n    id:: cryptography-standards\n    - [[ISO/IEC 18033]] - Blockchain and distributed ledger technologies\n    - [[NIST FIPS]] - Blockchain and distributed ledger technologies\n    - [[NIST SP]] - Blockchain and distributed ledger technologies\n  -\n\n\t - ### Who is involved:\n\t\t\t\t- Pieter Wuille, Gregory Maxwell, and Andrew Poelstra are some of the most prominent Bitcoin Core developers and cryptographers. Their extensive experience and contributions to Bitcoin speak to  their credentials.\n\t\t\t\t- Jonas Nick is a cryptography researcher who has published analyses of Bitcoin’s ECDSA signature scheme.\n\t\t\t\t- Tim Ruffing, Pedro Moreno-Sanchez, and Yannick Seurin are cryptographers who have published academic papers analysing and improving Bitcoin’s cryptographic constructions.\n\t\t\t\t- Tadge Dryja is one of the original Lightning developers and an MIT DCI researcher focused on Bitcoin’s cryptography.\n\t\t\t\t- Arvind Narayanan is a professor at Princeton who has published seminal works on Bitcoin and cryptocurrency cryptography.\n\t\t\t\t- Aviv Zohar at the University of Jerusalem has helped identify [still extant](https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2023-October/021999.html) vulnerabilities in the Lightning network.[[harris2020flood]]\n\t\t\t\t- There are likely many other credentialed cryptographers working on Bitcoin, but these are some of the most well-known examples. The common thread is a strong academic background in cryptography.\n\n\t - ### Where critical analysis is published:\n\t\t\t\t- Many analyses have been published at top cryptography and security conferences like IEEE S&P, ACM CCS, Financial Cryptography, and Real World Crypto. These are generally highly regarded venues.\n\t\t\t\t- Academic journals like Journal of Cryptography, Ledger, and Journal of Cryptographic Engineering have also published peer-reviewed papers. The impact factors are not as high as broader CS journals however.\n\t\t\t\t- Bitcoin Improvement Proposals (BIPs) also undergo scrutiny by expert reviewers.\n\t\t\t\t- There is still room for more peer review in top journals, but publication venue credibility is generally decent.\n\n\t - ### Test of time:\n\t\t\t\t- Bitcoin has been live since 2009 and its core cryptographic protocols have stood the test of time so far, with no major breaks of ECDSA, SHA256, RIPEMD160, etc despite enormous incentives.\n\t\t\t\t- That being said, 13 years is short in cryptography timescales. Continued analysis over decades is ideal.\n\t\t\t\t- Some newer proposals like Taproot have undergone less time testing but build on proven constructions.\n\n\t - ### Academic acceptance:\n\t\t\t\t- Acceptance has been increasing steadily, with a growing number of peer-reviewed academic papers, PhD dissertations, and university courses on Bitcoin cryptography.\n\t\t\t\t- Funding remains limited but is increasing through organizations like Square Crypto that fund open source work.\n\t\t\t\t- Controversy around Bitcoin’s social implications persists but its technical merit and cryptography seem to be gaining more mainstream academic respect.\n\n- # Cyber security and cryptography are coproximate.\n\n\t\t- ##### Bitcoin collapse system shock\n\t\t\t- In the event of an existential collapse of the Bitcoin network the erasure of so much capital would certainly have a contagion effect on the whole global financial system. It’s hard to imagine what such an event could be, this being the nature of “black swans”. One cited example is the unravelling of cryptography by quantum computing. Some conspiracy theorists in the past have even speculated that Bitcoin isi tself a canary in the coal mine, engineered by the NSA to warn about emergent quantum computing somewhere in the world. It’s all pretty silly because without cryptography Bitcoin would be the least of humanities problems. The risk of ‘something’ does exist though. The same anti-fragile feature can’t be said about the technologies around Bitcoin, which gives us:\n\n- # A Cypherpunk's Manifesto\n\t- [A Cypherpunk's Manifesto (activism.net)](https://www.activism.net/cypherpunk/manifesto.html) by [Eric Hughes](ftp://soda.berkeley.edu/pub/cypherpunks/people/hughes.html)\n\t-\n\t- Privacy is necessary for an open society in the electronic age. Privacy is not secrecy. A private matter is something one doesn't want the whole world to know, but a secret matter is something one doesn't want anybody to know. Privacy is the power to selectively reveal oneself to the world.\n\t- If two parties have some sort of dealings, then each has a memory of their interaction. Each party can speak about their own memory of this; how could anyone prevent it? One could pass laws against it, but the freedom of speech, even more than privacy, is fundamental to an open society; we seek not to restrict any speech at all. If many parties speak together in the same forum, each can speak to all the others and aggregate together knowledge about individuals and other parties. The power of electronic communications has enabled such group speech, and it will not go away merely because we might want it to.\n\t- Since we desire privacy, we must ensure that each party to a transaction have knowledge only of that which is directly necessary for that transaction. Since any information can be spoken of, we must ensure that we reveal as little as possible. In most cases personal identity is not salient. When I purchase a magazine at a store and hand cash to the clerk, there is no need to know who I am. When I ask my electronic mail provider to send and receive messages, my provider need not know to whom I am speaking or what I am saying or what others are saying to me; my provider only need know how to get the message there and how much I owe them in fees. When my identity is revealed by the underlying mechanism of the transaction, I have no privacy. I cannot here selectively reveal myself; I must *always* reveal myself.\n\t- Therefore, privacy in an open society requires anonymous transaction systems. Until now, cash has been the primary such system. An anonymous transaction system is not a secret transaction system. An anonymous system empowers individuals to reveal their identity when desired and only when desired; this is the essence of privacy.\n\t- Privacy in an open society also requires cryptography. If I say something, I want it heard only by those for whom I intend it. If the content of my speech is available to the world, I have no privacy. To encrypt is to indicate the desire for privacy, and to encrypt with weak cryptography is to indicate not too much desire for privacy. Furthermore, to reveal one's identity with assurance when the default is anonymity requires the cryptographic signature.\n\t- We cannot expect governments, corporations, or other large, faceless organizations to grant us privacy out of their beneficence. It is to their advantage to speak of us, and we should expect that they will speak. To try to prevent their speech is to fight against the realities of information. Information does not just want to be free, it longs to be free. Information expands to fill the available storage space. Information is Rumor's younger, stronger cousin; Information is fleeter of foot, has more eyes, knows more, and understands less than Rumor.\n\t- We must defend our own privacy if we expect to have any. We must come together and create systems which allow anonymous transactions to take place. People have been defending their own privacy for centuries with whispers, darkness, envelopes, closed doors, secret handshakes, and couriers. The technologies of the past did not allow for strong privacy, but electronic technologies do.\n\t- We the Cypherpunks are dedicated to building anonymous systems. We are defending our privacy with cryptography, with anonymous mail forwarding systems, with digital signatures, and with electronic money.\n\t- Cypherpunks write code. We know that someone has to write software to defend privacy, and since we can't get privacy unless we all do, we're going to write it. We publish our code so that our fellow Cypherpunks may practice and play with it. Our code is free for all to use, worldwide. We don't much care if you don't approve of the software we write. We know that software can't be destroyed and that a widely dispersed system can't be shut down.\n\t- Cypherpunks deplore regulations on cryptography, for encryption is fundamentally a private act. The act of encryption, in fact, removes information from the public realm. Even laws against cryptography reach only so far as a nation's border and the arm of its violence. Cryptography will ineluctably spread over the whole globe, and with it the anonymous transactions systems that it makes possible.\n\t- For privacy to be widespread it must be part of a social contract. People must come and together deploy these systems for the common good. Privacy only extends so far as the cooperation of one's fellows in society. We the Cypherpunks seek your questions and your concerns and hope we may engage you so that we do not deceive ourselves. We will not, however, be moved out of our course because some may disagree with our goals.\n\t- The Cypherpunks are actively engaged in making the networks safer for privacy. Let us proceed together apace.\n\t- Onward.\n\t-\n\t\t- 9 March 1993\n\n\t - ### Where critical analysis is published:\n\t\t\t\t- Many analyses have been published at top cryptography and security conferences like IEEE S&P, ACM CCS, Financial Cryptography, and Real World Crypto. These are generally highly regarded venues.\n\t\t\t\t- Academic journals like Journal of Cryptography, Ledger, and Journal of Cryptographic Engineering have also published peer-reviewed papers. The impact factors are not as high as broader CS journals however.\n\t\t\t\t- Bitcoin Improvement Proposals (BIPs) also undergo scrutiny by expert reviewers.\n\t\t\t\t- There is still room for more peer review in top journals, but publication venue credibility is generally decent.\n\n- # Cyber security and cryptography are coproximate.\n\n\t\t- ### Adobe integrates everything to Premier\n\t\t\t- {{video https://www.youtube.com/watch?v=6de4akFiNYM&t=1s}}\n\t\t- https://research.nvidia.com/labs/toronto-ai/AlignYourGaussians/\n\t\t- [Mosaic-SDF for 3D Generative Models (connectedpapers.com)](https://www.connectedpapers.com/main/a7d6d07fdb631ce263ec2ddad72df269587fd3c9/Mosaic%20SDF-for-3D-Generative-Models/graph)\n\t\t- https://lioryariv.github.io/msdf/\n\n\t\t- ### Adobe integrates everything to Premier\n\t\t\t- {{video https://www.youtube.com/watch?v=6de4akFiNYM&t=1s}}\n\t\t- https://research.nvidia.com/labs/toronto-ai/AlignYourGaussians/\n\t\t- [Mosaic-SDF for 3D Generative Models (connectedpapers.com)](https://www.connectedpapers.com/main/a7d6d07fdb631ce263ec2ddad72df269587fd3c9/Mosaic%20SDF-for-3D-Generative-Models/graph)\n\t\t- https://lioryariv.github.io/msdf/\n\n- # What we can expect\n\t- The potential of AI to dominate warfare in the next decade, exacerbating issues of disinformation and misinformation.\n\t- The accessibility of AI tools for creating realistic content, enhancing the capabilities of bad actors in misinformation campaigns.\n\t- The critical need for investment in data infrastructure and preparation to counter the threats posed by AI in warfare.\n\n\t- ### Hypothetical Technical Reasons\n\t\t- CrowdStrike provided detailed workaround steps to mitigate the issue:\n\t\t\t- **Workaround Steps**: Instructions included rebooting hosts, deleting problematic files, and rolling back to previous snapshots ([CrowdStrike Blog](https://www.crowdstrike.com/blog/statement-on-falcon-content-update-for-windows-hosts/)).\n\t\t- Includes key ML methods, lifecycle stages of attacks, attacker goals, and capabilities in the learning process.\n\t- Topics: Security and Privacy (advanced persistent threats, botnets, information sharing, intrusion detection & prevention, malware), Technologies (artificial intelligence).\n\t  \n\t  If you need further assistance or a specific focus on any aspect, feel free to ask.\n\n\t\t- ### Adobe integrates everything to Premier\n\t\t\t- {{video https://www.youtube.com/watch?v=6de4akFiNYM&t=1s}}\n\t\t- https://research.nvidia.com/labs/toronto-ai/AlignYourGaussians/\n\t\t- [Mosaic-SDF for 3D Generative Models (connectedpapers.com)](https://www.connectedpapers.com/main/a7d6d07fdb631ce263ec2ddad72df269587fd3c9/Mosaic%20SDF-for-3D-Generative-Models/graph)\n\t\t- https://lioryariv.github.io/msdf/\n\n- ## Title: U.S. Treasury Report on DeFi: Fiat Still Preferred by Criminals Over Crypto\n\n- ## Title: U.S. Treasury Report on DeFi: Fiat Still Preferred by Criminals Over Crypto\n\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Metaverse platforms continue to evolve with focus on interoperability and open standards\n  - Web3 integration accelerating with decentralised identity and asset ownership\n  - Enterprise adoption growing in virtual collaboration, training, and digital twins\n  - UK companies increasingly active in metaverse development and immersive technologies\n\n- Technical capabilities\n  - Real-time rendering at photorealistic quality levels\n  - Low-latency networking enabling seamless multi-user experiences\n  - AI-driven content generation and procedural world building\n  - Spatial audio and haptics enhancing immersion\n\n- UK and North England context\n  - Manchester: Digital Innovation Factory supports metaverse startups and research\n  - Leeds: Holovis leads in immersive experiences for entertainment and training\n  - Newcastle: University research in spatial computing and interactive systems\n  - Sheffield: Advanced manufacturing using digital twin technology\n\n- Standards and frameworks\n  - Metaverse Standards Forum driving interoperability protocols\n  - WebXR enabling browser-based immersive experiences\n  - glTF and USD for 3D asset interchange\n  - Open Metaverse Interoperability Group defining cross-platform standards\n\n## Metadata\n\n- **Last Updated**: 2025-11-16\n- **Review Status**: Automated remediation with 2025 context\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable",
  "properties": {
    "id": "cryptography-standards",
    "collapsed": "true",
    "- ontology": "true",
    "- term-id": "BC-0026",
    "- preferred-term": "Cryptography",
    "- source-domain": "blockchain",
    "- status": "complete",
    "- public-access": "true",
    "- version": "1.0.0",
    "- last-updated": "2025-10-28",
    "- definition": "Cryptography is the mathematical science of securing information through techniques that transform data into unintelligible forms for unauthorized parties whilst enabling authorized parties to reverse the transformation, providing confidentiality, integrity, authentication, and non-repudiation in blockchain systems.",
    "- maturity": "mature",
    "- source": "[[ISO/IEC 18033]], [[NIST FIPS]], [[NIST SP]]",
    "- authority-score": "1.0",
    "- owl:class": "bc:Cryptography",
    "- owl:physicality": "VirtualEntity",
    "- owl:role": "Object",
    "- owl:inferred-class": "bc:VirtualObject",
    "- belongsToDomain": "[[CryptographicDomain]]",
    "- implementedInLayer": "[[SecurityLayer]]",
    "- is-subclass-of": "[[Mathematical Science]], [[Security Technology]], [[Information Protection]]"
  },
  "backlinks": [],
  "wiki_links": [
    "NIST FIPS",
    "Information Protection",
    "CryptographicDomain",
    "Security Technology",
    "harris2020flood",
    "NIST SP",
    "ISO/IEC 18033",
    "SecurityLayer",
    "Mathematical Science"
  ],
  "ontology": {
    "term_id": "BC-0026",
    "preferred_term": "Cryptography",
    "definition": "Cryptography is the mathematical science of securing information through techniques that transform data into unintelligible forms for unauthorized parties whilst enabling authorized parties to reverse the transformation, providing confidentiality, integrity, authentication, and non-repudiation in blockchain systems.",
    "source_domain": "blockchain",
    "maturity_level": null,
    "authority_score": 1.0
  }
}