{
  "title": "BlockchainDomain",
  "content": "- ### OntologyBlock\n  id:: blockchaindomain-ontology\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: mv-979290550934\n\t- preferred-term:: BlockchainDomain\n\t- source-domain:: metaverse\n\t- status:: active\n\t- public-access:: true\n\t- definition:: A component of the metaverse ecosystem focusing on blockchaindomain.\n\t- maturity:: mature\n\t- authority-score:: 0.85\n\t- owl:class:: mv:Blockchaindomain\n\t- owl:physicality:: ConceptualEntity\n\t- owl:role:: Concept\n\t- belongsToDomain:: [[MetaverseDomain]]\n\t- #### Relationships\n\t  id:: blockchaindomain-relationships\n\t\t- enables:: [[ImmersiveExperience]], [[Presence]], [[SpatialComputing]]\n\t\t- requires:: [[DisplayTechnology]], [[TrackingSystem]], [[RenderingEngine]]\n\t\t- bridges-to:: [[HumanComputerInteraction]], [[ComputerVision]], [[Robotics]]\n\n\t- #### OWL Axioms\n\t  id:: blockchaindomain-owl-axioms\n\t  collapsed:: true\n\t\t- ```clojure\n\t\t  Declaration(Class(mv:Blockchaindomain))\n\n\t\t  # Classification\n\t\t  SubClassOf(mv:Blockchaindomain mv:ConceptualEntity)\n\t\t  SubClassOf(mv:Blockchaindomain mv:Concept)\n\n\t\t  # Domain classification\n\t\t  SubClassOf(mv:Blockchaindomain\n\t\t    ObjectSomeValuesFrom(mv:belongsToDomain mv:MetaverseDomain)\n\t\t  )\n\n\t\t  # Annotations\n\t\t  AnnotationAssertion(rdfs:label mv:Blockchaindomain \"BlockchainDomain\"@en)\n\t\t  AnnotationAssertion(rdfs:comment mv:Blockchaindomain \"A component of the metaverse ecosystem focusing on blockchaindomain.\"@en)\n\t\t  AnnotationAssertion(dcterms:identifier mv:Blockchaindomain \"mv-979290550934\"^^xsd:string)\n\t\t  ```\n\n- ### MetaOntologyBlock\n  id:: blockchain-domain-meta\n  collapsed:: true\n\n  - **Classification**\n    - meta-ontology:: true\n    - classification-type:: domain\n    - name:: BlockchainDomain\n    - scope:: Comprehensive domain encompassing all blockchain, distributed ledger technology, cryptographic primitives, consensus mechanisms, and decentralized system concepts\n    - version:: 1.0.0\n    - last-updated:: 2025-11-08\n\n  - **Definition**\n    - definition:: The BlockchainDomain represents the comprehensive knowledge domain of blockchain and distributed ledger technologies. This domain encompasses the foundational concepts, cryptographic primitives, consensus mechanisms, network architectures, smart contract systems, and economic models that constitute blockchain technology. It includes both theoretical concepts and practical implementations of distributed, cryptographically-secured data structures that enable decentralized consensus without trusted intermediaries. The domain spans from low-level cryptographic operations to high-level decentralized applications, covering blockchain fundamentals, data structures, transaction models, consensus protocols, network topologies, virtual machine architectures, token economics, and enterprise blockchain solutions. This domain serves as the primary classification for all blockchain-related ontological concepts, providing a unified framework for organizing and understanding the complex ecosystem of distributed ledger technologies.\n    - purpose:: To provide a comprehensive, hierarchical classification system for all blockchain and distributed ledger technology concepts, enabling systematic organization, cross-referencing, and knowledge discovery within the blockchain technology ecosystem\n    - coverage:: This domain covers 505+ distinct blockchain concepts organized into sub-domains including cryptographic primitives (hashing, digital signatures, zero-knowledge proofs), consensus mechanisms (Proof-of-Work, Proof-of-Stake, Byzantine Fault Tolerance), blockchain fundamentals (blocks, transactions, ledgers), smart contract systems (Ethereum, EVM, Solidity), token economics (cryptocurrencies, tokenomics, DeFi), network architectures (peer-to-peer, sharding, layer-2), and enterprise solutions (Hyperledger, permissioned chains, supply chain applications)\n\n  - **Taxonomy**\n    - parent-classification:: RootDomain\n    - peer-classifications:: [[AIEthicsDomain]], [[MetaverseDomain]], [[InfrastructureDomain]]\n    - sub-domains:: [[CryptographicDomain]], [[ConsensusDomain]], [[TokenEconomicsDomain]]\n\n  - **Member Concepts**\n    - concept-count:: 505\n    - foundational-concepts:: [[Blockchain]], [[Distributed Ledger]], [[Block]], [[Transaction]], [[Smart Contract]], [[Decentralization]]\n    - cryptographic-concepts:: [[Cryptography]], [[Hash Function]], [[SHA-256]], [[Merkle Tree]], [[Digital Signature]], [[Public-Key Cryptography]]\n    - consensus-concepts:: [[BC-0040-consensus-mechanism]], [[BC-0041-proof-of-work]], [[BC-0042-proof-of-stake]], [[Miner]], [[BC-0055-validator]], [[BC-0056-byzantine-fault-tolerance]]\n    - token-concepts:: [[Token]], [[Cryptocurrency]], [[Coin]], [[Native Token]], [[Gas]], [[BC-0101-token-standard]]\n    - smart-contract-concepts:: [[Smart Contract]], [[BC-0071-ethereum-virtual-machine]], [[BC-0072-solidity]], [[BC-0073-gas-fee]]\n    - network-concepts:: [[Decentralization]], [[BC-0011-peer-to-peer-network]], [[BC-0012-node]], [[BC-0013-full-node]], [[BC-0014-light-node]]\n    - key-ontologies:: BC-0001 through BC-0505 comprising blockchain fundamentals, cryptographic foundations, consensus protocols, smart contract systems, token economics, network architecture, DeFi primitives, NFT standards, layer-2 solutions, interoperability protocols, privacy technologies, governance mechanisms, and enterprise blockchain applications\n\n  - ## About BlockchainDomain\n    id:: blockchain-domain-about\n    - The BlockchainDomain represents the most comprehensive classification of blockchain and distributed ledger technology concepts within this ontological framework. As a foundational technology domain, it encompasses the entire spectrum of concepts, mechanisms, protocols, and systems that constitute modern blockchain technology. This domain emerged from the convergence of cryptography, distributed systems, game theory, and economics, crystallizing with Bitcoin's introduction in 2008 and expanding dramatically with Ethereum's smart contract capabilities and subsequent innovations in consensus mechanisms, scalability solutions, and decentralized applications.\n\n    - The domain is structured around several core conceptual pillars. First, the **cryptographic foundation** provides the mathematical primitives that ensure security, immutability, and verifiability: hash functions (SHA-256, Keccak-256), digital signatures (ECDSA, Schnorr), Merkle trees, and advanced cryptographic protocols like zero-knowledge proofs and threshold signatures. Second, the **distributed systems architecture** defines how blockchain networks achieve coordination without central authority: peer-to-peer networking, gossip protocols, state replication, and eventual consistency models. Third, the **consensus layer** establishes mechanisms for achieving agreement in adversarial environments: Proof-of-Work, Proof-of-Stake, Byzantine Fault Tolerance variants, and hybrid consensus protocols. Fourth, the **data structure and transaction model** defines how blockchain systems organize and process information: block structures, transaction formats, UTXO vs account models, and state management.\n\n    - Beyond these technical foundations, the BlockchainDomain extends into **smart contract systems** that enable programmable blockchain logic, **token economics** that model incentive structures and economic mechanisms, **decentralized applications** that leverage blockchain for various use cases, and **enterprise blockchain solutions** that adapt distributed ledger technology for organizational needs. The domain also encompasses emerging areas including layer-2 scaling solutions (Lightning Network, rollups), cross-chain interoperability protocols, decentralized identity systems, decentralized finance (DeFi) primitives, non-fungible tokens (NFTs), and decentralized governance mechanisms.\n\n    - The BlockchainDomain contains 505 distinct ontological concepts organized systematically from BC-0001 to BC-0505, making it one of the most comprehensive blockchain ontologies available. These concepts are further organized into specialized sub-domains that provide finer-grained classification: CryptographicDomain for cryptographic primitives and security mechanisms, ConsensusDomain for consensus protocols and agreement mechanisms, and TokenEconomicsDomain for economic models and incentive structures. This hierarchical organization enables both broad domain-level classification and precise sub-domain specialization.\n\n    - ### Scope and Boundaries\n      - **Included:** All concepts related to blockchain technology, distributed ledger systems, cryptographic foundations of blockchain, consensus mechanisms, smart contracts, token economics, decentralized applications, enterprise blockchain, blockchain security, privacy technologies, interoperability protocols, scalability solutions, blockchain governance, and blockchain-specific data structures and algorithms.\n\n      - **Excluded:** General-purpose cryptography not specific to blockchain (covered in CryptographicDomain when blockchain-specific), distributed systems concepts not related to blockchain, general database technologies, traditional financial systems, pure game theory or economics without blockchain application, and AI/ML concepts (covered in AIEthicsDomain).\n\n      - **Boundary Clarifications:** Concepts must have direct relevance to blockchain or distributed ledger technology. For example, \"Hash Function\" belongs here when used in blockchain context for block linking and Merkle trees, while general cryptographic hash functions might belong in a broader cryptography domain. Smart contracts belong here entirely, while the programming languages used to write them (e.g., general-purpose aspects of Solidity) may span multiple domains. Token economics and cryptocurrency concepts belong here, while broader economic theories belong elsewhere unless specifically applied to blockchain systems.\n\n    - ### Relationship to Other Classifications\n      - **Peer Relationship with AIEthicsDomain:** While BlockchainDomain focuses on the technical infrastructure and mechanisms of distributed ledger technology, AIEthicsDomain addresses governance, ethics, fairness, and accountability in AI systems. These domains intersect in areas like decentralized AI, blockchain-based AI governance, algorithmic transparency through blockchain, and cryptographic approaches to AI fairness. Both domains emphasize decentralization and trustless systems, though through different mechanisms.\n\n      - **Hierarchical Relationships:** BlockchainDomain serves as the parent domain for three specialized sub-domains: CryptographicDomain (cryptographic primitives and security mechanisms specific to blockchain), ConsensusDomain (consensus protocols and distributed agreement mechanisms), and TokenEconomicsDomain (economic models, incentive structures, and tokenomics). These sub-domains provide finer-grained classification while maintaining coherent membership in the broader blockchain ecosystem.\n\n      - **Cross-Domain Interactions:** BlockchainDomain concepts frequently interact with concepts from other domains. Infrastructure domains provide the physical and network layers on which blockchains operate. Metaverse domains leverage blockchain for virtual economies and digital asset ownership. Enterprise domains apply blockchain for supply chain, healthcare, and financial services. These cross-domain relationships are typically captured through layer classifications (e.g., a concept might belong to BlockchainDomain but be implemented in ApplicationLayer, indicating a practical application).\n\n    - ### Design Rationale\n      - **Comprehensive Coverage:** The BlockchainDomain was designed to provide complete coverage of the blockchain technology landscape, from foundational concepts to emerging innovations. With 505+ concepts systematically organized from BC-0001 to BC-0505, it represents one of the most extensive blockchain ontologies available, enabling comprehensive knowledge management and discovery.\n\n      - **Hierarchical Organization:** The domain structure supports both broad classification (membership in BlockchainDomain) and specialized categorization (membership in sub-domains like CryptographicDomain). This allows ontology users to navigate at multiple levels of granularity, from high-level domain browsing to precise sub-domain exploration.\n\n      - **Standardization and Interoperability:** All concepts in this domain reference authoritative sources including ISO/IEC standards (23257:2021, 23455:2019), IEEE standards (2418.1), NIST publications, and ITU-T recommendations. This grounding in standards ensures interoperability with other blockchain ontologies and alignment with industry best practices.\n\n      - **Evolution and Extensibility:** The domain structure accommodates both mature, well-established blockchain concepts (e.g., Proof-of-Work, hash functions) and emerging innovations (e.g., zero-knowledge rollups, decentralized identity). The systematic numbering system (BC-0001 to BC-0505) allows for future expansion while maintaining organizational coherence.\n\n      - **Multi-Dimensional Classification:** BlockchainDomain works in concert with layer classifications to provide two-dimensional concept organization. A concept's domain indicates its subject matter area (blockchain), while its layer indicates its abstraction level or implementation context (conceptual, protocol, security, economic). This multi-dimensional approach enables richer semantic relationships and more nuanced ontological queries.\n\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Metaverse platforms continue to evolve with focus on interoperability and open standards\n  - Web3 integration accelerating with decentralised identity and asset ownership\n  - Enterprise adoption growing in virtual collaboration, training, and digital twins\n  - UK companies increasingly active in metaverse development and immersive technologies\n\n- Technical capabilities\n  - Real-time rendering at photorealistic quality levels\n  - Low-latency networking enabling seamless multi-user experiences\n  - AI-driven content generation and procedural world building\n  - Spatial audio and haptics enhancing immersion\n\n- UK and North England context\n  - Manchester: Digital Innovation Factory supports metaverse startups and research\n  - Leeds: Holovis leads in immersive experiences for entertainment and training\n  - Newcastle: University research in spatial computing and interactive systems\n  - Sheffield: Advanced manufacturing using digital twin technology\n\n- Standards and frameworks\n  - Metaverse Standards Forum driving interoperability protocols\n  - WebXR enabling browser-based immersive experiences\n  - glTF and USD for 3D asset interchange\n  - Open Metaverse Interoperability Group defining cross-platform standards\n\n## Metadata\n\n- **Last Updated**: 2025-11-16\n- **Review Status**: Automated remediation with 2025 context\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable",
  "properties": {
    "id": "blockchain-domain-about",
    "collapsed": "true",
    "- ontology": "true",
    "- term-id": "mv-979290550934",
    "- preferred-term": "BlockchainDomain",
    "- source-domain": "metaverse",
    "- status": "active",
    "- public-access": "true",
    "- definition": "The BlockchainDomain represents the comprehensive knowledge domain of blockchain and distributed ledger technologies. This domain encompasses the foundational concepts, cryptographic primitives, consensus mechanisms, network architectures, smart contract systems, and economic models that constitute blockchain technology. It includes both theoretical concepts and practical implementations of distributed, cryptographically-secured data structures that enable decentralized consensus without trusted intermediaries. The domain spans from low-level cryptographic operations to high-level decentralized applications, covering blockchain fundamentals, data structures, transaction models, consensus protocols, network topologies, virtual machine architectures, token economics, and enterprise blockchain solutions. This domain serves as the primary classification for all blockchain-related ontological concepts, providing a unified framework for organizing and understanding the complex ecosystem of distributed ledger technologies.",
    "- maturity": "mature",
    "- authority-score": "0.85",
    "- owl:class": "mv:Blockchaindomain",
    "- owl:physicality": "ConceptualEntity",
    "- owl:role": "Concept",
    "- belongsToDomain": "[[MetaverseDomain]]",
    "- enables": "[[ImmersiveExperience]], [[Presence]], [[SpatialComputing]]",
    "- requires": "[[DisplayTechnology]], [[TrackingSystem]], [[RenderingEngine]]",
    "- bridges-to": "[[HumanComputerInteraction]], [[ComputerVision]], [[Robotics]]",
    "- meta-ontology": "true",
    "- classification-type": "domain",
    "- name": "BlockchainDomain",
    "- scope": "Comprehensive domain encompassing all blockchain, distributed ledger technology, cryptographic primitives, consensus mechanisms, and decentralized system concepts",
    "- version": "1.0.0",
    "- last-updated": "2025-11-08",
    "- purpose": "To provide a comprehensive, hierarchical classification system for all blockchain and distributed ledger technology concepts, enabling systematic organization, cross-referencing, and knowledge discovery within the blockchain technology ecosystem",
    "- coverage": "This domain covers 505+ distinct blockchain concepts organized into sub-domains including cryptographic primitives (hashing, digital signatures, zero-knowledge proofs), consensus mechanisms (Proof-of-Work, Proof-of-Stake, Byzantine Fault Tolerance), blockchain fundamentals (blocks, transactions, ledgers), smart contract systems (Ethereum, EVM, Solidity), token economics (cryptocurrencies, tokenomics, DeFi), network architectures (peer-to-peer, sharding, layer-2), and enterprise solutions (Hyperledger, permissioned chains, supply chain applications)",
    "- parent-classification": "RootDomain",
    "- peer-classifications": "[[AIEthicsDomain]], [[MetaverseDomain]], [[InfrastructureDomain]]",
    "- sub-domains": "[[CryptographicDomain]], [[ConsensusDomain]], [[TokenEconomicsDomain]]",
    "- concept-count": "505",
    "- foundational-concepts": "[[Blockchain]], [[Distributed Ledger]], [[Block]], [[Transaction]], [[Smart Contract]], [[Decentralization]]",
    "- cryptographic-concepts": "[[Cryptography]], [[Hash Function]], [[SHA-256]], [[Merkle Tree]], [[Digital Signature]], [[Public-Key Cryptography]]",
    "- consensus-concepts": "[[BC-0040-consensus-mechanism]], [[BC-0041-proof-of-work]], [[BC-0042-proof-of-stake]], [[Miner]], [[BC-0055-validator]], [[BC-0056-byzantine-fault-tolerance]]",
    "- token-concepts": "[[Token]], [[Cryptocurrency]], [[Coin]], [[Native Token]], [[Gas]], [[BC-0101-token-standard]]",
    "- smart-contract-concepts": "[[Smart Contract]], [[BC-0071-ethereum-virtual-machine]], [[BC-0072-solidity]], [[BC-0073-gas-fee]]",
    "- network-concepts": "[[Decentralization]], [[BC-0011-peer-to-peer-network]], [[BC-0012-node]], [[BC-0013-full-node]], [[BC-0014-light-node]]",
    "- key-ontologies": "BC-0001 through BC-0505 comprising blockchain fundamentals, cryptographic foundations, consensus protocols, smart contract systems, token economics, network architecture, DeFi primitives, NFT standards, layer-2 solutions, interoperability protocols, privacy technologies, governance mechanisms, and enterprise blockchain applications"
  },
  "backlinks": [
    "Energy Consumption Blockchain",
    "BC-0491-healthcare-records",
    "BC-0485-tax-treatment-crypto",
    "BC-0498-carbon-footprint-measurement",
    "BC-0001-blockchain",
    "Luxury Goods Authentication",
    "BC-0493-real-estate-tokenization",
    "AML KYC Compliance",
    "Provenance Tracking",
    "Consensus Mechanism",
    "BC-0018-transaction-pool",
    "Enterprise Blockchain Architecture",
    "BC-0013-block-size",
    "Travel Rule",
    "Compliance Monitoring",
    "BC-0003-block",
    "Technology Adoption",
    "Ethical Sourcing",
    "BC-0447-anti-counterfeiting",
    "BC-0483-us-regulatory-framework",
    "Securities Regulation",
    "BC-0499-green-blockchain-initiatives",
    "Chain Reorganization",
    "BC-0474-grant-programs",
    "Transaction Confirmation",
    "Blockchain Entity",
    "TELE-250-blockchain-collaboration",
    "Block Height",
    "x402 and l402 payment protocols",
    "BC-0465-proposal-system",
    "BC-0431-privacy-preserving-blockchain",
    "BC-0494-property-registry",
    "BC-0022-output",
    "BC-0009-smart-contract",
    "BC-0437-r3-corda",
    "Conflict Mineral Tracking",
    "BC-0455-product-recall-management",
    "BC-0489-consumer-protection",
    "Blockchain Interoperability",
    "TELE-253-cryptocurrency-remuneration",
    "Consortium Blockchain",
    "Chain State",
    "Transaction",
    "Food Safety Blockchain",
    "BC-0454-waste-management",
    "BC-0477-travel-rule",
    "Virtual Production",
    "Voting Systems",
    "Asia Pacific Regulation",
    "Customs Trade Facilitation",
    "BC-0467-conviction-voting",
    "BC-0004-block-header",
    "Cryptographic System",
    "Sustainable Consensus",
    "On Chain Voting",
    "Healthcare Records",
    "Distributed Protocol",
    "Environmental Impact Assessment",
    "UTXO Model",
    "BC-0023-script",
    "BC-0476-aml-kyc-compliance",
    "Enterprise Token Standards",
    "Account Model",
    "Quorum Blockchain",
    "Privacy Preserving Blockchain",
    "Orphan Block",
    "Circular Economy",
    "BC-0486-regulatory-reporting",
    "Fault Tolerance System",
    "BC-0462-on-chain-voting",
    "BC-0016-orphan-block",
    "BC-0015-chain-reorganization",
    "TELE-251-smart-contract-coordination",
    "BC-0501-esg-reporting",
    "BC-0448-cold-chain-monitoring",
    "BC-0490-cross-border-compliance",
    "Decentralized Autonomous Organization",
    "BC-0010-decentralization",
    "Verifiable Credentials",
    "BC-0436-hyperledger-iroha",
    "Multi Sig Governance",
    "BC-0024-opcodes",
    "Stablecoin Regulation",
    "BC-0481-fatf-recommendations",
    "BC-0492-clinical-trials",
    "BC-0451-logistics-optimization",
    "ESG Reporting",
    "BC-0484-asia-pacific-regulation",
    "US Regulatory Framework",
    "BC-0505-carbon-neutral-blockchain",
    "BC-0446-supply-chain-traceability",
    "Permissioned Blockchain",
    "Cold Chain Monitoring",
    "Money",
    "BC-0449-circular-economy",
    "Block",
    "Carbon Credit Tracking",
    "BC-0503-sustainable-consensus",
    "Script",
    "BC-0433-enterprise-token-standards",
    "Green Blockchain Initiatives",
    "BC-0435-hyperledger-indy",
    "Block Reward",
    "BC-0430-private-channels",
    "Mempool",
    "Block Header",
    "BC-0450-carbon-credit-tracking",
    "Logistics Optimization",
    "Snapshot Voting",
    "BC-0007-utxo-model",
    "Governance Token",
    "BC-0466-quadratic-voting",
    "BC-0020-transaction-confirmation",
    "Distributed Data Structure",
    "Runes and Glyphs",
    "Input",
    "PrivateBlockchain",
    "Identity Verification",
    "Property Registry",
    "BC-0488-licensing-requirements",
    "BC-0475-dao-analytics",
    "CBDC Frameworks",
    "BC-0460-identity-verification",
    "Blockchain As A Service",
    "Decentralization",
    "BC-0504-environmental-impact-assessment",
    "BC-0458-verifiable-credentials",
    "BC-0482-eu-mica-regulation",
    "Supply Chain Traceability",
    "Carbon Footprint Measurement",
    "ontology-properties",
    "BC-0479-stablecoin-regulation",
    "DAO Legal Structures",
    "BC-0445-conflict-mineral-tracking",
    "BC-0428-enterprise-blockchain-architecture",
    "BC-0470-dao-legal-structures",
    "BC-0025-chain-state",
    "Agreement Protocol",
    "Tokenomics Governance",
    "Anti Counterfeiting",
    "BC-0452-customs-trade-facilitation",
    "Treasury Management",
    "BC 0109 priority fee",
    "BC-0469-snapshot-voting",
    "BC-0478-securities-regulation",
    "BC-0432-consortium-blockchain",
    "BC-0461-decentralized-autonomous-organization",
    "BC-0438-quorum-blockchain",
    "BC-0002-distributed-ledger",
    "BC-0441-provenance-tracking",
    "BC-0444-luxury-goods-authentication",
    "Waste Management",
    "FATF Recommendations",
    "BC-0502-climate-action-dao",
    "BC 0104 supply cap",
    "BC-0434-blockchain-as-a-service",
    "Grant Programs",
    "CryptographicDomain",
    "Delegate Democracy",
    "Bitcoin",
    "Testnet",
    "Hyperledger Besu",
    "BC-0471-tokenomics-governance",
    "BC-0453-ethical-sourcing",
    "BC-0473-delegate-democracy",
    "Conviction Voting",
    "AIEthicsDomain",
    "Regulatory Reporting",
    "Decentralized Identifiers",
    "BC-0017-timestamp",
    "Cross Border Compliance",
    "BC-0464-treasury-management",
    "SmartContract",
    "TELE-0000-telepresence-domain",
    "Economic Mechanism",
    "BC-0472-dao-tooling",
    "Carbon Neutral Blockchain",
    "BC-0500-renewable-energy-certificates",
    "Pharmaceutical Traceability",
    "BC-0459-digital-identity-wallet",
    "R3 Corda",
    "Real Estate Tokenization",
    "BC-0006-transaction",
    "Private Channels",
    "Telecollaboration and Telepresence",
    "BC-0012-block-reward",
    "Opcodes",
    "Block Time",
    "Enterprise Smart Contracts",
    "Climate Action DAO",
    "BC-0497-proof-of-stake-sustainability",
    "Proof Of Stake Sustainability",
    "Output",
    "Value Transfer",
    "Hyperledger Iroha",
    "BC-0487-compliance-monitoring",
    "BC-0457-decentralized-identifiers",
    "BC-0019-mempool",
    "BC-0440-blockchain-interoperability",
    "BC-0456-self-sovereign-identity",
    "BC-0463-governance-token",
    "Product Recall Management",
    "Timestamp",
    "BC-0426-hyperledger-fabric",
    "TokenEconomicsDomain",
    "BC-0439-enterprise-smart-contracts",
    "Hyperledger Indy",
    "Oracle",
    "TELE-252-dao-governance-telecollaboration",
    "Genesis Block",
    "DAO Tooling",
    "Renewable Energy Certificates",
    "Clinical Trials",
    "BC-0427-hyperledger-besu",
    "BC-0014-block-time",
    "BC-0005-genesis-block",
    "BC-0480-cbdc-frameworks",
    "Licensing Requirements",
    "BC-0442-pharmaceutical-traceability",
    "BC-0495-voting-systems",
    "Block Size",
    "Hyperledger Fabric",
    "BC-0429-permissioned-blockchain",
    "Self Sovereign Identity",
    "EU MiCA Regulation",
    "Proposal System",
    "Consumer Protection",
    "BC-0021-input",
    "Quadratic Voting",
    "DAO Analytics",
    "ProofOfStake",
    "Transaction Pool",
    "BC 0119 economic security",
    "BC-0468-multi-sig-governance",
    "TELE-002-telecollaboration",
    "Tax Treatment Crypto",
    "BC-0443-food-safety-blockchain",
    "BC-0496-energy-consumption-blockchain",
    "ConsensusDomain",
    "BC-0011-block-height",
    "BC-0008-account-model"
  ],
  "wiki_links": [
    "Smart Contract",
    "BC-0073-gas-fee",
    "InfrastructureDomain",
    "BC-0041-proof-of-work",
    "RenderingEngine",
    "Robotics",
    "HumanComputerInteraction",
    "BC-0101-token-standard",
    "Block",
    "ConsensusDomain",
    "AIEthicsDomain",
    "Gas",
    "Cryptocurrency",
    "BC-0011-peer-to-peer-network",
    "Hash Function",
    "BC-0072-solidity",
    "BC-0014-light-node",
    "Coin",
    "SHA-256",
    "Presence",
    "Transaction",
    "Token",
    "ImmersiveExperience",
    "ComputerVision",
    "Miner",
    "BC-0056-byzantine-fault-tolerance",
    "SpatialComputing",
    "Public-Key Cryptography",
    "BC-0012-node",
    "TokenEconomicsDomain",
    "Cryptography",
    "Distributed Ledger",
    "Decentralization",
    "DisplayTechnology",
    "BC-0042-proof-of-stake",
    "TrackingSystem",
    "Digital Signature",
    "BC-0055-validator",
    "CryptographicDomain",
    "BC-0040-consensus-mechanism",
    "Blockchain",
    "Merkle Tree",
    "Native Token",
    "MetaverseDomain",
    "BC-0013-full-node",
    "BC-0071-ethereum-virtual-machine"
  ],
  "ontology": {
    "term_id": "mv-979290550934",
    "preferred_term": "BlockchainDomain",
    "definition": "A component of the metaverse ecosystem focusing on blockchaindomain.",
    "source_domain": "metaverse",
    "maturity_level": null,
    "authority_score": 0.85
  }
}