{
  "title": "Call Centres",
  "content": "- ### OntologyBlock\n  id:: call-centres-ontology\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: mv-342482445679\n\t- preferred-term:: Call Centres\n\t- source-domain:: metaverse\n\t- status:: active\n\t- public-access:: true\n\t- definition:: A component of the metaverse ecosystem focusing on call centres.\n\t- maturity:: mature\n\t- authority-score:: 0.85\n\t- owl:class:: mv:CallCentres\n\t- owl:physicality:: ConceptualEntity\n\t- owl:role:: Concept\n\t- belongsToDomain:: [[MetaverseDomain]]\n\t- #### Relationships\n\t  id:: call-centres-relationships\n\t\t- enables:: [[ImmersiveExperience]], [[Presence]], [[SpatialComputing]]\n\t\t- requires:: [[DisplayTechnology]], [[TrackingSystem]], [[RenderingEngine]]\n\t\t- bridges-to:: [[HumanComputerInteraction]], [[ComputerVision]], [[Robotics]]\n\n\t- #### OWL Axioms\n\t  id:: call-centres-owl-axioms\n\t  collapsed:: true\n\t\t- ```clojure\n\t\t  Declaration(Class(mv:CallCentres))\n\n\t\t  # Classification\n\t\t  SubClassOf(mv:CallCentres mv:ConceptualEntity)\n\t\t  SubClassOf(mv:CallCentres mv:Concept)\n\n\t\t  # Domain classification\n\t\t  SubClassOf(mv:CallCentres\n\t\t    ObjectSomeValuesFrom(mv:belongsToDomain mv:MetaverseDomain)\n\t\t  )\n\n\t\t  # Annotations\n\t\t  AnnotationAssertion(rdfs:label mv:CallCentres \"Call Centres\"@en)\n\t\t  AnnotationAssertion(rdfs:comment mv:CallCentres \"A component of the metaverse ecosystem focusing on call centres.\"@en)\n\t\t  AnnotationAssertion(dcterms:identifier mv:CallCentres \"mv-342482445679\"^^xsd:string)\n\t\t  ```\n\npublic:: true\n\n-\n- # **Innovating AI Tools for Call Center Operators, Including Agentic Systems**\n  \n  The call center industry is rapidly evolving, with artificial intelligence (AI) playing an increasingly important role in enhancing customer experience and streamlining operations 1. This article explores the innovative AI tools available to call center operators, with a particular focus on agentic systems. These advanced AI systems are transforming the way call centers operate, enabling automation, personalization, and improved efficiency.\n- ## **AI in Call Centers: An Overview**\n  \n  AI is revolutionizing call centers by automating tasks, providing valuable insights, and improving customer interactions. Research indicates a growing acceptance of AI in customer service. A Forbes 2024 report revealed that 27% of customers believe AI-powered self-service or automated support can deliver a customer experience comparable to human agents 1. The increasing sophistication of AI technology suggests that this trend will likely persist. AI tools are proving effective in handling simple questions and repetitive tasks, allowing human agents to focus on more complex issues 1. However, it's important to acknowledge that AI may sometimes struggle with complex requests that require a deeper understanding of customer emotions and context 4. In such cases, human intervention remains crucial to ensure customer satisfaction.\n  \n  A survey by A Closer Look found that while customers appreciate the efficiency of AI, they still value human interaction for empathy and personalized service 5. This highlights the need for a balanced approach, where AI complements human agents rather than replacing them entirely. It's also worth noting that some customers express discomfort and lack of trust in AI to handle their personal issues effectively 6. Addressing these concerns through transparency and clear communication will be essential for the successful adoption of AI in customer service.\n  \n  One notable example of AI in action is the use of AI-powered OpenQuestion IVR. This technology has been shown to reduce misdirected calls, decrease wait times, and increase customer satisfaction 2. In one instance, a company utilizing OpenQuestion IVR observed a 42% increase in calls being correctly routed to the right agents, resulting in an annual savings of $6 million 2. Furthermore, AI can empower agents by providing them with relevant customer information, leading to increased job satisfaction and reduced customer frustration 2.\n- ## **Research Methodology**\n  \n  The information presented in this article is based on a comprehensive research process that involved several key steps:\n  \n  1. **Identifying relevant research papers and articles:** We reviewed academic publications and industry reports to understand the current state of AI in call centers and the emergence of agentic systems.  \n  2. **Analyzing industry reports:** We examined reports from leading market research firms to gather data on market trends, customer perceptions, and the adoption of AI solutions in call centers.  \n  3. **Examining case studies:** We analyzed real-world examples of companies using AI and agentic systems in their call centers to understand the benefits, challenges, and best practices.\n  \n  This multi-faceted approach ensured that the information presented in this article is accurate, comprehensive, and grounded in real-world evidence.\n- ## **Agentic Systems: The Next Generation of AI**\n  \n  Agentic AI represents a significant advancement in AI technology. Unlike traditional AI systems that rely on predefined rules, agentic systems are more autonomous and capable of decision-making 7. They can perceive their environment, adapt to changes, and make decisions to achieve specific goals 8. This allows for more personalized, efficient, and dynamic customer interactions. The ability of agentic AI to adapt in real-time allows for more dynamic and personalized customer interactions, leading to increased satisfaction and improved problem resolution 7.\n  \n  Agentic AI differs from generative AI, which focuses on creating content like text and code. Agentic AI, on the other hand, is designed to perform actions and make decisions based on real-time data and pre-set goals 7. For example, an agentic system can monitor customer interactions, identify dissatisfaction, and automatically escalate the issue to a supervisor or offer a refund without human intervention 7.\n  \n  One of the key advantages of agentic AI is its ability to provide a cohesive customer view across a range of channels 9. By integrating data from various sources, such as previous calls, emails, and social media interactions, agentic AI can offer a complete picture of the customer's journey. This enables a consistent and personalized experience, regardless of the channel the customer chooses to interact with the company 9.\n- ## **Companies Offering AI Solutions for Call Centers**\n  \n  The market for AI solutions in call centers is rapidly expanding, with a variety of companies offering innovative tools to enhance customer experience and streamline operations. Here's a breakdown of some key players, categorized by their primary AI solution type:\n  \n  | Company Name | AI Solution Type | Key Features |\n  | :---- | :---- | :---- |\n  | Cognigy | Conversational AI | Automates customer support processes, streamlines communication, integrates with existing systems. |\n  | Freshdesk | Conversational AI | Offers Freddy AI, automates customer service through chat and email, suggests new ticket fields for efficient routing. |\n  | Google Contact Center AI | Conversational AI | Suite of tools including virtual agents, agent assist, and a platform for building conversational interfaces. |\n  | Balto | Agent Assist | Real-time call guidance and coaching, AI-powered recommendations, performance tracking. |\n  | Convin.ai | Agent Assist | Real-time conversation intelligence, agent coaching, performance analytics. |\n  | Dialpad AI | Agent Assist | Real-time transcription, post-call summaries, virtual speech coach. |\n  | Talkdesk | Agent Assist | AI-powered customer service automation, agent assist, conversation analytics. |\n  | CallMiner Eureka | Analytics | Interaction analytics, trend analysis, customer delight assessment. |\n  | Gong | Analytics | Conversation intelligence, sales strategy optimization, real-time feedback. |\n  | Level AI | Analytics | Next-generation AI for customer service and quality management. |\n  | NICE | Analytics | Workforce optimization, analytics, and automation. |\n  | Observe.AI | Analytics | AI-powered platform for quality assurance teams. |\n  | Qualtrics XM Platform | Analytics | Bots and analytics for QA teams and service managers, customer behavior analysis. |\n  | Sybill.ai | Analytics | Behavioral analytics, sales call analysis, predictive insights. |\n  | Verint | Analytics | Speech analytics, sentiment analysis, compliance tracking. |\n  | VoiceBase | Analytics | AI solutions for contact centers, cost reduction, customer experience improvement. |\n  | Aircall | Cloud-based Phone System | Call routing, IVR, analytics. |\n  | CloudTalk | Cloud-based Phone System | Call monitoring, reporting. |\n  | CxCloud365 | Cloud-based Solutions & Services | Innovative technology solutions for customer experience. |\n  | Fathom | Transcription & Keyword Extraction | Real-time transcription, keyword extraction. |\n  | Fireflies.ai | Transcription & Note-taking | Automated note-taking, transcription for meetings and CRM updates. |\n  | Invoca | Conversation Intelligence | Captures data from every customer interaction, personalizes experiences, improves revenue generation. |\n  | Zoho Desk | AI Assistant | Offers Zia, a contextual AI assistant that improves customer interactions and streamlines support processes. |\n- ## **Types of Agentic Systems in Call Centers**\n  \n  Agentic systems can be categorized based on their capabilities and outcomes. One framework for classifying AI agents is based on levels of autonomy, similar to the levels used for self-driving cars 10. A Level 5 agentic system would be capable of completing knowledge work tasks fully autonomously with minimal human intervention 10.\n  \n  Some examples of agentic systems used in call centers include:\n  \n  * **Conversational assistants:** These AI agents can understand natural language and engage in conversations with customers, providing support and resolving simple issues11.  \n  * **AI supervisors:** These agents can monitor interactions, analyze customer sentiment, and escalate issues to human supervisors when necessary7.  \n  * **Smart transfer bots:** These agents optimize call routing by analyzing the context of an interaction and directing the customer to the most appropriate resource12.  \n  * **Agent virtual assistants:** These agents provide human agents with real-time information and guidance during customer interactions12.  \n  * **Fraud monitoring systems:** In industries like banking, agentic AI can be used to continuously monitor account activity and flag potentially fraudulent transactions in real-time11.  \n  * **Zoom Virtual Agent and Zoom Contact Centre:** These solutions exemplify the power of agentic AI to transform customer service by enhancing self-service capabilities, personalizing interactions, enabling proactive support, and unifying communication across multiple channels7.\n  \n  Real-world examples demonstrate the versatility of agentic AI in addressing various call center needs. For instance, Bud Financial, a leader in banking technology, utilizes agentic AI to automate customer experiences and provide personalized financial guidance 13. Another example is Alfred, an AI agent integrated into Slack, which provides employees with a straightforward way to resolve common IT issues without human intervention 13.\n- ## **Benefits and Challenges of Using Agentic Systems**\n  \n  Agentic systems offer several benefits for call centers, including:\n  \n  * **Increased efficiency:** Agentic AI can perform tasks faster and more accurately than humans, leading to increased productivity and reduced wait times14.  \n  * **Improved customer service:** AI-powered assistants and chatbots can provide instant responses to customer inquiries, improving customer satisfaction14.  \n  * **Smarter decision-making:** AI systems can analyze data in real-time, providing insights that enable businesses to make informed decisions14.  \n  * **Lower operational costs:** By automating routine processes, businesses can reduce staffing needs and lower operational costs14.  \n  * **24/7 availability:** Agentic AI can operate continuously, providing uninterrupted customer service14.  \n  * **Proactive customer service:** AI can predict customer needs and offer assistance before they even ask for it15. Agentic AI has the potential to significantly improve customer satisfaction and first contact resolution rates by proactively addressing customer needs and resolving issues autonomously 15.  \n  * **Personalized customer interactions:** AI can analyze customer data and behavior to provide tailored recommendations and support16.\n  \n  However, there are also challenges associated with using agentic systems:\n  \n  * **Unforeseen consequences:** Due to their adaptability and learning capabilities, agentic AI systems can sometimes engage in unforeseen actions or decisions17.  \n  * **Limited understanding of internal workings:** The complex decision-making processes of agentic AI can be difficult to understand, making it challenging to identify the root cause of errors17.  \n  * **Transparency in data usage:** Concerns exist regarding the potential misuse of user data by agentic AI systems17.  \n  * **Bias:** AI systems can inherit biases from their training data, leading to discriminatory outcomes17.  \n  * **High attrition rates:** The call center industry faces high attrition rates, which can disrupt service continuity and increase costs18. AI can potentially help in reducing attrition rates by automating tasks and improving agent satisfaction.  \n  * **Ensuring customer satisfaction:** Maintaining high customer satisfaction can be challenging due to long wait times and inconsistent service quality19. AI can help address these challenges by reducing wait times and improving service consistency.  \n  * **Agent burnout:** High-stress environments and repetitive tasks can lead to agent burnout, impacting performance and increasing absenteeism19. AI can help mitigate burnout by automating repetitive tasks and allowing agents to focus on more engaging interactions.\n- ## **Ethical Considerations**\n  \n  The use of agentic systems in call centers raises ethical considerations that need to be addressed:\n  \n  * **Transparency:** Customers should be informed when they are interacting with an AI system20.  \n  * **Data privacy:** Businesses need to ensure the responsible use of customer data and protect it from unauthorized access21. This includes being mindful of potential surveillance and behavior manipulation concerns 21.  \n  * **Bias mitigation:** Steps should be taken to identify and mitigate biases in AI systems to prevent discriminatory outcomes22.  \n  * **Accountability:** Mechanisms should be in place to ensure accountability for the actions and decisions of agentic AI systems23. This includes addressing the opacity of AI decision-making and ensuring that the reasoning behind AI actions is understandable and explainable 21.  \n  * **Addressing ethical considerations in AI is crucial for businesses, not only to maintain customer trust but also to avoid potential legal and reputational risks 21.**\n- ## **Future Trends of AI in Call Centers**\n  \n  The future of AI in call centers is likely to be shaped by the following trends:\n  \n  * **Increased automation:** AI will continue to automate more tasks, freeing up human agents to focus on more complex and strategic activities3. This includes the increasing use of process automation, which is expected to be the most prominent application of AI in contact centers 24.  \n  * **Hyper-personalization:** AI will enable even more personalized customer interactions, tailoring support and offers to individual needs and preferences25.  \n  * **Enhanced self-service options:** AI-powered chatbots and virtual assistants will become more sophisticated, providing customers with more comprehensive self-service options25.  \n  * **Advanced analytics:** AI will provide deeper insights into customer behavior and call center performance, enabling data-driven decision-making3. This includes the use of voice authentication and speech analytics to enhance security and improve customer understanding 24.  \n  * **Generative AI integration:** Generative AI will be used to create more human-like interactions and automate tasks like summarizing conversations and generating reports26.  \n  * **Addressing data scarcity:** AI-powered contact center solutions will help overcome the challenge of limited data analysis by enabling the examination of a larger proportion of customer interactions26.  \n  * **Robotic Process Automation (RPA):** RPA will continue to play a significant role in automating routine tasks and streamlining workflows in call centers27.  \n  * **AI Predictive Auto Dialing:** AI will be used to optimize dialing strategies and improve contact rates in outbound call centers27.\n- ## **Conclusion**\n  \n  AI is transforming the call center industry, and agentic systems are at the forefront of this transformation. By automating tasks, personalizing interactions, and providing valuable insights, agentic AI is enabling call centers to operate more efficiently and deliver better customer experiences. However, it is crucial to address the challenges and ethical considerations associated with these advanced AI systems to ensure their responsible and beneficial use. By leveraging the capabilities of AI and agentic systems, call centers can effectively address challenges such as agent burnout, high attrition rates, and the increasing demand for personalized customer service. As AI technology continues to evolve, we can expect even more innovative applications in the call center industry, leading to further improvements in customer service and operational efficiency. Businesses that embrace these advancements and proactively address the ethical considerations will be well-positioned to thrive in the evolving landscape of customer service.\n- #### **Works cited**\n  \n  1\\. Is This the Year AI Dominates the Call Center? \\- CMSWire.com, accessed on January 14, 2025, [https://www.cmswire.com/contact-center/is-this-the-year-ai-dominates-the-call-center/](https://www.cmswire.com/contact-center/is-this-the-year-ai-dominates-the-call-center/)  \n  2\\. Artificial Intelligence in Call Centers: Boost Efficiency & Cut Costs \\- Teneo.Ai, accessed on January 14, 2025, [https://www.teneo.ai/blog/artificial-intelligence-in-call-centers](https://www.teneo.ai/blog/artificial-intelligence-in-call-centers)  \n  3\\. Impact of AI on Call Centers: 7 Key Impacts in 2025 \\- Invensis, accessed on January 14, 2025, [https://www.invensis.net/blog/impact-of-ai-on-call-centers](https://www.invensis.net/blog/impact-of-ai-on-call-centers)  \n  4\\. Voice‐based AI in call center customer service: A natural field experiment \\- ResearchGate, accessed on January 14, 2025, [https://www.researchgate.net/publication/367362952\\_Voice-based\\_AI\\_in\\_call\\_center\\_customer\\_service\\_A\\_natural\\_field\\_experiment](https://www.researchgate.net/publication/367362952_Voice-based_AI_in_call_center_customer_service_A_natural_field_experiment)  \n  5\\. Striking the Balance: Leveraging AI in Call Centers While Maintaining the Human Touch, accessed on January 14, 2025, [https://a-closer-look.com/market-research/striking-the-balance-leveraging-ai-in-call-centers-while-maintaining-the-human-touch/](https://a-closer-look.com/market-research/striking-the-balance-leveraging-ai-in-call-centers-while-maintaining-the-human-touch/)  \n  6\\. Call Center: The Perceived Risks of Using AI to Improve CX \\- SQM Group, accessed on January 14, 2025, [https://www.sqmgroup.com/resources/library/blog/the-perceived-risks-of-using-ai-to-improve-cx](https://www.sqmgroup.com/resources/library/blog/the-perceived-risks-of-using-ai-to-improve-cx)  \n  7\\. How Agentic AI is Transforming Customer Service and Contact Centres | by Acceleraate, accessed on January 14, 2025, [https://medium.com/@acceleraate/how-agentic-ai-is-transforming-customer-service-and-contact-centres-13e244a9835b](https://medium.com/@acceleraate/how-agentic-ai-is-transforming-customer-service-and-contact-centres-13e244a9835b)  \n  8\\. Agentic AI: Redefining Customer Experience \\- Talkdesk, accessed on January 14, 2025, [https://www.talkdesk.com/blog/redefining-customer-experience-agentic-ai/](https://www.talkdesk.com/blog/redefining-customer-experience-agentic-ai/)  \n  9\\. What Is Agentic AI? \\- CX Today, accessed on January 14, 2025, [https://www.cxtoday.com/contact-centre/what-is-agentic-ai/](https://www.cxtoday.com/contact-centre/what-is-agentic-ai/)  \n  10\\. The Five Levels of Agentic Automation \\- Sema4.ai, accessed on January 14, 2025, [https://sema4.ai/blog/the-five-levels-of-agentic-automation/](https://sema4.ai/blog/the-five-levels-of-agentic-automation/)  \n  11\\. How agentic AI is driving the next evolution of enterprise AI \\- Moveworks, accessed on January 14, 2025, [https://www.moveworks.com/us/en/resources/blog/agentic-ai-the-next-evolution-of-enterprise-ai](https://www.moveworks.com/us/en/resources/blog/agentic-ai-the-next-evolution-of-enterprise-ai)  \n  12\\. 5 Agentic AI Examples: Inspiring Use Cases Shaping the Future \\- ThoughtSpot, accessed on January 14, 2025, [https://www.thoughtspot.com/data-trends/ai/agentic-ai-examples](https://www.thoughtspot.com/data-trends/ai/agentic-ai-examples)  \n  13\\. Here's 6 Agentic AI Examples and Use Cases Transforming Businesses | Moveworks, accessed on January 14, 2025, [https://www.moveworks.com/us/en/resources/blog/agentic-ai-examples-use-cases](https://www.moveworks.com/us/en/resources/blog/agentic-ai-examples-use-cases)  \n  14\\. What is agentic AI and what are its benefits and use cases? \\- Softweb Solutions, accessed on January 14, 2025, [https://www.softwebsolutions.com/resources/benefits-and-use-cases-of-agentic-ai.html](https://www.softwebsolutions.com/resources/benefits-and-use-cases-of-agentic-ai.html)  \n  15\\. 18 Use Cases for Agentic AI in Customer Experience \\- CX Today, accessed on January 14, 2025, [https://www.cxtoday.com/crm/18-use-cases-for-agentic-ai-in-customer-experience/](https://www.cxtoday.com/crm/18-use-cases-for-agentic-ai-in-customer-experience/)  \n  16\\. Agentic AI: What it is and what it looks like in the retail world \\- Clientbook, accessed on January 14, 2025, [https://www.clientbook.com/blog/agentic-ai-what-it-is-and-what-it-looks-like-in-the-retail-world](https://www.clientbook.com/blog/agentic-ai-what-it-is-and-what-it-looks-like-in-the-retail-world)  \n  17\\. Agentic AI Systems: Opportunities, Challenges, and the Need for Robust Governance, accessed on January 14, 2025, [https://community.nasscom.in/communities/analytics/agentic-ai-systems-opportunities-challenges-and-need-robust-governance](https://community.nasscom.in/communities/analytics/agentic-ai-systems-opportunities-challenges-and-need-robust-governance)  \n  18\\. 12 Major Challenges Faced by the Call Center Industry \\- Flatworld Solutions, accessed on January 14, 2025, [https://www.flatworldsolutions.com/call-center/articles/major-challenges-callcenter-industry.php](https://www.flatworldsolutions.com/call-center/articles/major-challenges-callcenter-industry.php)  \n  19\\. 12 Major Call Center Challenges & Ways to Resolve Them \\- Knowmax, accessed on January 14, 2025, [https://knowmax.ai/blog/call-center-challenges/](https://knowmax.ai/blog/call-center-challenges/)  \n  20\\. 5 important considerations for responsible AI use in contact centers \\- Talkdesk, accessed on January 14, 2025, [https://www.talkdesk.com/blog/responsible-ai-use-in-contact-centers/](https://www.talkdesk.com/blog/responsible-ai-use-in-contact-centers/)  \n  21\\. Security and Ethics of Contact Center AI: When is AI Creepy? \\- NICE, accessed on January 14, 2025, [https://www.nice.com/blog/security-and-ethics-of-contact-center-ai-when-is-ai-creepy](https://www.nice.com/blog/security-and-ethics-of-contact-center-ai-when-is-ai-creepy)  \n  22\\. What Ethical Issues Does Agentforce AI Bring to the Table for CIOs? \\- Inclusion Cloud, accessed on January 14, 2025, [https://inclusioncloud.com/insights/blog/ethical-issues-agentforce-cios/](https://inclusioncloud.com/insights/blog/ethical-issues-agentforce-cios/)  \n  23\\. New Ethics Risks Courtesy of AI Agents? Researchers Are on the Case | IBM, accessed on January 14, 2025, [https://www.ibm.com/think/insights/ai-agent-ethics](https://www.ibm.com/think/insights/ai-agent-ethics)  \n  24\\. Contact Center Automation Trends: What to Expect in 2025 \\- Invoca, accessed on January 14, 2025, [https://www.invoca.com/blog/contact-center-automation-trends](https://www.invoca.com/blog/contact-center-automation-trends)  \n  25\\. 5 AI-Powered Contact Center Automation Trends for 2024 \\- Apizee, accessed on January 14, 2025, [https://www.apizee.com/contact-center-automation-trends.php](https://www.apizee.com/contact-center-automation-trends.php)  \n  26\\. The Future of the Call Center: Predictions for 2024 and Beyond \\- Level AI, accessed on January 14, 2025, [https://thelevel.ai/blog/future-of-the-call-center-2024/](https://thelevel.ai/blog/future-of-the-call-center-2024/)  \n  27\\. Contact Center Automation Trends for 2025 and Beyond \\- VoiceSpin, accessed on January 14, 2025, [https://www.voicespin.com/blog/call-center-automation-trends/](https://www.voicespin.com/blog/call-center-automation-trends/)\n-\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Metaverse platforms continue to evolve with focus on interoperability and open standards\n  - Web3 integration accelerating with decentralised identity and asset ownership\n  - Enterprise adoption growing in virtual collaboration, training, and digital twins\n  - UK companies increasingly active in metaverse development and immersive technologies\n\n- Technical capabilities\n  - Real-time rendering at photorealistic quality levels\n  - Low-latency networking enabling seamless multi-user experiences\n  - AI-driven content generation and procedural world building\n  - Spatial audio and haptics enhancing immersion\n\n- UK and North England context\n  - Manchester: Digital Innovation Factory supports metaverse startups and research\n  - Leeds: Holovis leads in immersive experiences for entertainment and training\n  - Newcastle: University research in spatial computing and interactive systems\n  - Sheffield: Advanced manufacturing using digital twin technology\n\n- Standards and frameworks\n  - Metaverse Standards Forum driving interoperability protocols\n  - WebXR enabling browser-based immersive experiences\n  - glTF and USD for 3D asset interchange\n  - Open Metaverse Interoperability Group defining cross-platform standards\n\n## Metadata\n\n- **Last Updated**: 2025-11-16\n- **Review Status**: Automated remediation with 2025 context\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable",
  "properties": {
    "id": "call-centres-owl-axioms",
    "collapsed": "true",
    "- ontology": "true",
    "- term-id": "mv-342482445679",
    "- preferred-term": "Call Centres",
    "- source-domain": "metaverse",
    "- status": "active",
    "- public-access": "true",
    "- definition": "A component of the metaverse ecosystem focusing on call centres.",
    "- maturity": "mature",
    "- authority-score": "0.85",
    "- owl:class": "mv:CallCentres",
    "- owl:physicality": "ConceptualEntity",
    "- owl:role": "Concept",
    "- belongsToDomain": "[[MetaverseDomain]]",
    "- enables": "[[ImmersiveExperience]], [[Presence]], [[SpatialComputing]]",
    "- requires": "[[DisplayTechnology]], [[TrackingSystem]], [[RenderingEngine]]",
    "- bridges-to": "[[HumanComputerInteraction]], [[ComputerVision]], [[Robotics]]",
    "public": "true"
  },
  "backlinks": [],
  "wiki_links": [
    "TrackingSystem",
    "ImmersiveExperience",
    "ComputerVision",
    "RenderingEngine",
    "SpatialComputing",
    "Robotics",
    "HumanComputerInteraction",
    "MetaverseDomain",
    "DisplayTechnology",
    "Presence"
  ],
  "ontology": {
    "term_id": "mv-342482445679",
    "preferred_term": "Call Centres",
    "definition": "A component of the metaverse ecosystem focusing on call centres.",
    "source_domain": "metaverse",
    "maturity_level": null,
    "authority_score": 0.85
  }
}