{
  "title": "civil service job",
  "content": "- ### OntologyBlock\n  id:: civil-service-job-ontology\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: mv-200985713212\n\t- preferred-term:: civil service job\n\t- source-domain:: metaverse\n\t- status:: active\n\t- public-access:: true\n\t- definition:: A component of the metaverse ecosystem focusing on civil service job.\n\t- maturity:: mature\n\t- authority-score:: 0.85\n\t- owl:class:: mv:CivilServiceJob\n\t- owl:physicality:: ConceptualEntity\n\t- owl:role:: Concept\n\t- belongsToDomain:: [[MetaverseDomain]]\n\t- #### Relationships\n\t  id:: civil-service-job-relationships\n\t\t- enables:: [[ImmersiveExperience]], [[Presence]], [[SpatialComputing]]\n\t\t- requires:: [[DisplayTechnology]], [[TrackingSystem]], [[RenderingEngine]]\n\t\t- bridges-to:: [[HumanComputerInteraction]], [[ComputerVision]], [[Robotics]]\n\n\t- #### OWL Axioms\n\t  id:: civil-service-job-owl-axioms\n\t  collapsed:: true\n\t\t- ```clojure\n\t\t  Declaration(Class(mv:CivilServiceJob))\n\n\t\t  # Classification\n\t\t  SubClassOf(mv:CivilServiceJob mv:ConceptualEntity)\n\t\t  SubClassOf(mv:CivilServiceJob mv:Concept)\n\n\t\t  # Domain classification\n\t\t  SubClassOf(mv:CivilServiceJob\n\t\t    ObjectSomeValuesFrom(mv:belongsToDomain mv:MetaverseDomain)\n\t\t  )\n\n\t\t  # Annotations\n\t\t  AnnotationAssertion(rdfs:label mv:CivilServiceJob \"civil service job\"@en)\n\t\t  AnnotationAssertion(rdfs:comment mv:CivilServiceJob \"A component of the metaverse ecosystem focusing on civil service job.\"@en)\n\t\t  AnnotationAssertion(dcterms:identifier mv:CivilServiceJob \"mv-200985713212\"^^xsd:string)\n\t\t  ```\n\n- Cookies on Civil Service Jobs\n  We use some essential cookies to make this website work.\n- To understand how you use Civil Service Jobs and improve the website we'd like to set some additional cookies.\n  Skip to content\n  Civil Service Jobs\n  Beta Your feedback will help us to improve.\n  Home Applications View applicationJob descriptionBooked InterviewsSign out\n  Table of Contents - Advert\n  Advert\n  ​\n  Principal Technologist - OCTO  \n  Government Digital Service\n  Vacancy Details\n  Job title\n  Principal Technologist - OCTO\n- Application closing date\n  21/09/2025, 23:55\n- Reference number\n  426739\n- Department\n  Government Digital Service\n  Business area\n  GDS - Office of the Chief Technology Officer\n- Currency\n  GBP (£)\n- Salary minimum\n  69523\n- Salary maximum\n  103924\n  Salary details\n  £76,420 - £103,924 (London) / £69,523 - £91,453 (National) Based on capability. The base salary of this grade is £71,370 for London and £67,126 for other locations. Offers made above this will be made up with a specialist pay allowance.\n- Grade\n  Grade 6\n- Contract type\n  Permanent\n- Type of role\n  Digital, Information Technology\n- Working pattern\n  Full-time, Part-time, Flexible working, Job share, Compressed Hours\n- Number of posts\n  3\n- Location\n- City / Town\n  Bristol , London , Manchester\n- About the job\n- Job summary\n  The Government Digital Service (GDS) is the digital centre of government. We are responsible for setting, leading and delivering the vision for a modern digital government.\n- Our priorities are to drive a modern digital government, by:\n- joining up public sector services\n  harnessing the power of AI for the public good\n  strengthening and extending our digital and data public infrastructure\n  elevating leadership and investing in talent\n  funding for outcomes and procuring for growth and innovation\n  committing to transparency and driving accountability\n  We are home to the Incubator for Artificial Intelligence (I.AI), the world-leading GOV.UK and at the forefront of coordinating the UK’s geospatial strategy and activity. We lead the Government Digital and Data function and champion the work of digital teams across government.\n- We’re part of the Department for Science, Innovation and Technology (DSIT) and employ more than 1,000 people all over the UK, with hubs in Manchester, London and Bristol.\n- The Government Digital Service is where talent translates into impact. From your first day, you’ll be working with some of the world’s most highly-skilled digital professionals, all contributing their knowledge to make change on a national scale.\n- Join us for rewarding work that makes a difference across the UK. You'll solve some of the nation’s highest-priority digital challenges, helping millions of people access services they need\n- Within GDS, you will join the Office of the Chief Technology Officer (OCTO), a directorate comprising 85 staff and aiming to grow to 140 staff by the end of financial year 2025/26. The directorate is led by David Knott and four Deputy Directors.\n- The directorate has recently overseen a number of key departmental priorities, ranging from delivering the State of Digital Government Review, to the AI Playbook, to strengthening how Government does digital procurement, and protecting public sector website domains, amongst other priorities.\n- Job description\n  The Principal Technologists in GDS’s Office of the Government CTO function exist to make building great technology easier in the UK Public Sector. In this role you can help central and local government, the NHS, Police, as well as 1,000+ agencies and other bodies. By setting strategies, principles, standards and identifying best practice, as well as supporting the adoption and embedding of these into the public sector, you’ll help your 100,000+ digital and data colleagues in these organisations deliver transformational change.\n- In particular we are looking for individuals in the following teams:\n- technology management, where you will be focussed on the development of the Legacy IT strategy and implementation across Government\n  engineering excellence, where you will work as part of the team making the UK Public Sector an industry leader in Software Engineering and Development\n  digital workplace, where we are looking for individuals who have a strong End User Computing background\n  You may manage and mentor a Lead Technologist aligned to you and your team, who can support you when you need to rapidly deep-dive into a topic to achieve your team’s outcomes.\n- As Principal Technologist you may already be aligned to Architecture, Data, IT Operations or Software Development specialisms within the Government Digital and Date Framework.\n- You will be part of a team including lead technologists, engagement leads and a delivery manager to:\n- Set a 10-year intent and strategy for the field you are aligned to, and gain endorsement for this\n  Identify and develop existing principles, standards and best practice and promote them, or form and lead a group of technologists from across UK Public Sector to create these\n  Work with vendors to maximise their offer to UK Public Sector, and with Government Commercial Function in commercial engagements with vendors\n  Build a network of peers across UK Public Sector to regularly engage with\n  Promote your work through content written for GOV.UK, speaking engagements and hosting community events\n  Help upskill others across UK Public Sector in your specialist area\n  The above list of job duties is not exclusive or exhaustive and the post holder will be required to undertake such tasks as may reasonably be expected within the scope and grading of the post.\n- These roles have a scale and impact unlike many others: we are routinely involved in commercial engagements worth £billions, respond to pan-Government technology questions from ministers, and provide advice to other international governments.\n- Person specification\n  This role requires:\n- you must have experience setting a vision and leading digital and data change\n  you must have experience designing and building technology and be able to use this to build credibility with others, evaluate proposals and decide an execution approach\n  you should have experience engaging with suppliers/vendors both formally and informally\n  communication in this role is key: you should be comfortable in creating written content and presenting to senior stakeholders, both technical (such as CTOs / CDOs across Government) and non-technical (including ministers and permanent secretaries)\n  learning should be embedded in the way you approach your working week, and you should be keen to share your learning with those around you through coaching and mentoring\n  Technical skills\n- you should be at the top skill levels in your Digital & Data specialism, most likely from the Architecture, Data, IT Operations or Software Development groups.\n  you should hold relevant industry certifications for your technical specialism\n  Offered benefits\n  There are many benefits of working at GDS, including:\n- flexible hybrid working with flexi-time and the option to work part-time or condensed hours\n  a Civil Service Pension with an average employer contribution of 28.97%\n  25 days of annual leave, increasing by a day each year up to a maximum of 30 days\n  an extra day off for the King’s birthday\n  an in-year bonus scheme to recognise high performance\n  career progression and coaching, including a training budget for personal development\n  paid volunteering leave\n  a focus on wellbeing with access to an employee assistance programme\n  job satisfaction from making government services easier to use and more inclusive for people across the UK\n  advances on pay, including for travel season tickets\n  death in service benefits\n  cycle to work scheme and facilities\n  access to an employee discounts scheme\n  10 learning days per year\n  volunteering opportunities (5 special leave days per year)\n  access to a suite of learning activities through Civil Service learning\n- Any move to Government Digital Service from another employer will mean you can no longer access childcare vouchers. This includes moves between government departments. You may however be eligible for other government schemes, including Tax Free Childcare. Determine your eligibility at https://www.childcarechoices.gov.uk\n- Office attendance\n  The Department operates a discretionary hybrid working policy, which provides for a combination of working hours from your place of work and from your home in the UK. The current expectation for staff is to attend the office or non-home based location for 40-60% of the time over the accounting period.\n  DSIT does not normally offer full home working (i.e. working at home); but we do offer a variety of flexible working options (including occasionally working from home).\n- Selection process details\n  The standard selection process for roles at GDS consists of:\n  a simple application screening process - We only ask for a CV and for you to answer 2 application questions.\n  following the initial sift, shortlisted candidates will be asked to provide a 2 minute video responding to a set question.\n  a 60 minute video interview\n  Depending on how many applications we get, there might also be an extra stage before the video interview, for example a phone interview or a technical exercise.\n  In order to assist candidates with this role, we will be holding a virtual recruitment event on Friday 19th September at 9:30am - 10:30am to go through the role in more detail. To attend the virtual recruitment event please use the link below and use the following details to join:\n- Join the meeting now\n- Meeting ID: 362 486 792 924 7\n- Passcode: cA9Cz3vD\n- Artificial Intelligence can be a useful tool to support your application, however, all examples and statements provided must be truthful, factually accurate and taken directly from your own experience. Where plagiarism has been identified (presenting the ideas and experiences of others, or generated by artificial intelligence, as your own) applications may be withdrawn and internal candidates may be subject to disciplinary action.  Please see our candidate guidance for more information on appropriate and inappropriate use.\n- In the event we receive a high volume of applications, we will conduct the initial sift against the lead criteria which is:\n- Our priority vacancies are in our Technology Management, Engineering Excellence and Digital Workplace teams (see job description for more detail about these teams). Using an example related to one of these areas, describe a time when you used your technical background to set a long-term vision and strategic priorities. Use “I” rather than “we” language, and you should use the STAR format. This question will be assessed based on the Civil Service Behaviour Seeing the Bigger Picture\n  In the Civil Service, we use Success Profiles to evaluate your skills and ability. This gives us the best possible chance of finding the right person for the job, increases performance and improves diversity and inclusivity. We’ll be assessing your technical abilities, skills, experience and behaviours that are relevant to this role.\n- For this role we’ll be assessing you against the following Civil Service Behaviours:\n- Seeing the big picture\n  Communicating and influencing\n  Making effective decisions\n  Working together\n  We’ll also be assessing your experience and specialist technical skills against the following skills defined in the Government Digital and Data Capability Framework for the Principal Technical Architect role:\n- strategy Design\n  making architectural decisions\n  architecture communication\n  architect for the whole context\n  Recruitment Timeline\n  Virtual recruitment event: Friday 19th September 2025 at 9:30am - 10:30am\n- Sift completion: Monday 29th September 2025\n- Panel interviews: starting Friday 17th October 2025\n- Candidates that do not pass the interview but have demonstrated an acceptable standard may be considered for similar roles at a lower grade.\n- A reserve list will be held for a period of 12 months, from which further appointments can be made.\n- Please note that this role requires SC clearance, which would normally need 5 years’ UK residency in the past 5 years. This is not an absolute requirement, but supplementary checks may be needed where individuals have not lived in the UK for that period. This may mean your security clearance (and therefore your appointment) will take longer or, in some cases, not be possible.\n- For meaningful checks to be carried out, you will need to have lived in the UK for a sufficient period of time, to enable appropriate checks to be carried out and produce a result which provides the required level of assurance. Whilst a lack of UK residency in itself is not necessarily a bar to a security clearance, and expectation of UK residency may range from 3 to 5 years. Failure to meet the residency requirements needed for the role may result in the withdrawal of provisional jobs offers.\n- The Civil Service is committed to attract, retain and invest in talent wherever it is found. To learn more please see the Civil Service People Plan and the Civil Service D&I Strategy.\n- Sponsorship\n- DSIT cannot offer Visa sponsorship to candidates through this campaign. DSIT holds a Visa sponsorship licence but this can only be used for certain roles and this campaign does not qualify.\n- Things you need to know\n- Security\n  Successful candidates must pass a disclosure and barring security check.\n  Successful candidates must meet the security requirements before they can be appointed. The level of security needed is Security check\n  Selection process details\n  This vacancy is using Success Profiles (opens in a new window) and will assess the following areas: Experience.\n- Feedback will only be provided if you attend an interview or assessment.\n- Nationality requirements\n  Open to UK, Commonwealth (opens in a new window) and European Economic Area (EEA) (opens in a new window) and certain non EEA nationals. Further information on whether you are able to apply is available here (opens in a new window).\n  Working for the Civil Service\n  The Civil Service code (opens in a new window) sets out the standards of behaviour expected of civil servants.\n- We recruit by merit on the basis of fair and open competition, as outlined in the Civil Service Commission's recruitment principles (opens in a new window).\n- The Civil Service embraces diversity and promotes equal opportunities. As such, we run a Disability Confident Scheme (DCS) for candidates with disabilities who meet the minimum selection criteria.\n- Further information\n- Contact point for applicants\n  Name\n  gdsrecruitment@dsit.gov.uk\n- Email\n  gdsrecruitment@dsit.gov.uk\n- Recruitment team email\n  gdsrecruitment@dsit.gov.uk\n- Online test instructions\n  Complaints process\n  If you feel your application has not been treated in accordance with the Recruitment Principles and you wish to make a complaint, you should contact GDS-Complaints@dsit.gov.uk in the first instance.\n- If you are not satisfied with the response you receive you can contact the Civil Service Commission by email: info@csc.gov.uk Or in writing: Civil Service Commission, Room G/8 1 Horse Guards Road, London, SW1A 2HQ.\n- Attachments\n  Supporting linksHelp Terms and conditions Privacy Notice Cookies Careers\n  Built by Cabinet Office\n  Open Government Licence\n  All content is available under the Open Government Licence v3.0, except where otherwise stated\n- © Crown copyright\n- Menu\n- HomeGovernmentSuccess Profiles\n  Cabinet Office\n  Guidance\n  Success Profiles: Candidate overview\n  Updated 29 January 2025\n- Contents\n  How the elements are assessed\n  Reasonable adjustments\n  Civil Service assessment methods\n  Print this page\n  The Civil Service recruits using Success Profiles. This means for each role we advertise, we consider what you will need to demonstrate to be successful.\n- This gives us the best possible chance of:\n- finding the right person for the job\n  improving performance\n  improving diversity and inclusion\n  Our Success Profiles are made up of five elements:\n  Ability - the aptitude or potential to perform to the required standard\n  Technical - the actions and activities that people do which result in effective performance in a job\n  Behaviours - the actions and activities that people do which result in effective performance in a job\n  Strengths - the things we do regularly, do well and that motivate us\n  Experience - the knowledge or mastery of an activity or subject gained through involvement in or exposure to it\n  Not all of the elements are relevant to every role. They will vary depending on the profession, level and type of role. You should read the job description carefully. It will tell you what elements you need for the job you are applying for.\n- There are separate guides to each of the elements. They provide more information about what you need and how you can demonstrate specific requirements.\n- How the elements are assessed\n  The Civil Service assesses candidates in a number of different ways. This depends on the type of role and level you are applying for. Using a range of assessment methods helps us match people to the essential requirements of the job. For example, you may be asked to complete an application form or to provide a CV and supporting statement.\n- They may help us assess your experiences, technical qualifications and behaviours. Or, you may be asked to attend an assessment centre or complete an online test to assess your abilities. Often a combination of these will be used. More than one element may be tested within the same assessment method.\n- Details of which elements will be assessed and how we will assess you are included in the job advert.\n- Reasonable adjustments\n  The Civil Service is a diverse and inclusive workplace. We want to help you show your full potential whatever type of assessment is used.\n- Examples of adjustments can include:\n- providing documents in large print or braille\n  allowing more time for a test or interview\n  providing assistance at an assessment centre\n  If you need any reasonable adjustments, tell us when you submit your application that you need an adjustment and how it will help.\n- Civil Service assessment methods\n  Application form\n  You will usually be asked to complete an application form as part of the assessment process. In addition to your personal information you may also be asked to give examples of times when you have shown certain behaviours. Behaviours are the actions and activities that people do which result in effective performance in a job. The Civil Service has defined a set of behaviours that, when demonstrated, are associated with job success.\n- Civil Service behaviours are tailored to the grade level of the job role. However, you will not be asked to demonstrate all the behaviours for one role. Use the examples given in the Civil Service behaviours to think about times when you have shown the behaviour described. This might be at work or somewhere else such as:\n- work experience\n  volunteering\n  in connection with a hobby\n  Do not assume the recruiting manager will know or understand the situation you were facing. You need to be clear how your example meets the behaviour being assessed.\n- Consider using the STAR method which allows you to set the scene, show what and how you did and the overall outcome.\n- CV and or supporting statement\n  You may be asked to submit a CV (and sometimes a supporting statement) as well as, or instead of, an application form. Your CV is one of the first opportunities you have to demonstrate your:\n- skills\n  experience\n  achievements\n  and may be used to shortlist applicants for further recruitment stages.\n- We may ask you to provide your CV in an anonymised format. This will omit information that could identify you, such as your name, age or gender.\n- You may also be asked to only include educational qualifications which are relevant to the role you are applying. For example, professional qualifications. This is to make sure that:\n- the process is fair\n  irrelevant information is not taken into account during the selection process\n  If you need to provide a supporting statement\n  You should use this to further highlight how you meet the essential criteria required to do the role. You may wish to include examples of how you have\n- tackled similar tasks\n  demonstrated the skills outlined in the job advert\n  Consider using the STAR method which allows you to set the scene, show what and how you did and the overall outcome.\n- Online tests\n  You may need to complete one or more online tests as part of the recruitment process. You will usually be given a link to a website where you can do the tests. These tests help us to:\n- identify if you have the skills needed for the role\n  assess your suitability for the type of work the Civil Service usually does\n  The number and type of tests you may need to complete depends on the type of role you are applying for.\n- You can usually take the tests at any time within a specific number of days. The email sent to you will explain this. There will also be some practice questions you can try before taking the test. The tests may be timed. Make sure you can give them your full attention before starting the assessment.\n- Interview\n  Part of the assessment process will usually involve an interview. This may be face to face but sometimes we use telephone, video or recorded interviews.\n- The purpose of all the interviews is the same: to assess your suitability for the role. It will usually last 30-60 minutes. We may ask you to describe specific times when you have shown a certain skill or behaviour.\n- Before you attend an interview, look carefully at the job description. Think about examples you can give of times when you have shown the behaviours outlined in the job advert. You may also wish to think about how you would handle similar situations in the future.\n- We may ask you questions about your interests and what you enjoy doing. These questions help assess your strengths and preferred style of working.\n- The Civil Service Strengths Dictionary will give you an idea of the strengths we look for. However, you will never be expected to demonstrate them all for one job.\n- Before your interview it would be helpful to reflect on what you feel are your personal strengths and preferred ways of working.\n- Presentation\n  You may be asked to do a presentation as part of the assessment process. You may be told the subject of the presentation in advance to allow you to prepare, or it could be given to you on the day. The subject of the presentation may or may not be an area you are familiar with. You might be given some additional materials to help you prepare.\n- The email inviting you to the assessment will tell you:\n- the format the presentation will take\n  the time allowed for the exercise\n  if handouts or presentation slides are expected\n  In the invitation you might also expect to see:\n- what topic or behaviour the presentation will assess\n  how the presentation should be structured\n  It is likely that the assessors will ask you questions about your presentation. These may focus on the subject matter but may also be about how you prepared for the assessment.\n- Assessment centre\n  An assessment centre will usually be a combination of different selection methods. For example, an interview, a presentation and an online test. The email inviting you to the assessment centre will tell you:\n- which selection methods will be used\n  what to expect on the day\n  Back to top\n  Is this page useful?\n  Yes\n  No\n  Report a problem with this page\n  Services and information\n  Benefits Births, death, marriages and care Business and self-employed Childcare and parenting Citizenship and living in the UK Crime, justice and the law Disabled people Driving and transport Education and learning Employing people Environment and countryside Housing and local services Money and tax Passports, travel and living abroad Visas and immigration Working, jobs and pensions\n  Government activity\n  Departments News Guidance and regulation Research and statistics Policy papers and consultations Transparency How government works Get involved\n  Help Privacy Cookies Accessibility statement Contact Terms and conditions Rhestr o Wasanaethau Cymraeg Government Digital Service\n  All content is available under the Open Government Licence v3.0, except where otherwise stated\n  © Crown copyright\n- Menu\n- HomeGovernmentSuccess Profiles\n  Cabinet Office\n  Guidance\n  Success Profiles: Experience\n  Updated 29 January 2025\n- Contents\n  Experience\n  Why we assess experience\n  How we assess experience\n  Reasonable adjustments\n  Print this page\n  The Civil Service recruits using Success Profiles. They help give us the best possible chance of finding the right person for the job. For each role we advertise, we consider what you will need to demonstrate to be successful.\n- Our Success Profiles are made of five elements:\n  Ability - the aptitude or potential to perform to the required standard\n  Technical - the actions and activities that people do which result in effective performance in a job\n  Behaviours - the actions and activities that people do which result in effective performance in a job\n  Strengths - the things we do regularly, do well and that motivate us\n  Experience - the knowledge or mastery of an activity or subject gained through involvement in or exposure to it\n  Not all elements are relevant to every role. The makeup of the Success Profile should be different for different types of job. This helps us to improve the chances of getting the best person for the job.\n- Experience\n  Experience is the knowledge or mastery of an activity or subject by involvement in or exposure to it.\n- In the Civil Service experience is most often needed when we recruit to:\n- senior roles\n  roles in the Civil Service Professions\n  Why we assess experience\n  When looking at your experience, we are looking for:\n  previous examples of things you have achieved\n  your knowledge in a particular field which is relevant to the job role\n  How you performed in a particular field - not how long you served\n  Sometimes experience from outside work can be transferable from a non-work context. Skills gained through voluntary work or a hobby can show the experience you may need for a role. For example, teamwork or communication.\n- How we assess experience\n  We will look at your experience, career history and achievements, relevant to the job role.\n- Some of the assessment methods we may use to understand your experience include:\n- application form\n  CV\n  interview\n  Consider using the STAR method which allows you to set the scene, show what and how you did and the overall outcome.\n- We may assess your experience along with other elements of the Success Profile. This is to get a more rounded picture of your suitability for the role.\n- The job advert will describe the elements you need for a role and the selection method(s) that we will use.\n- Reasonable adjustments\n  The Civil Service is a diverse and inclusive workplace. We want to help you show your full potential whatever type of assessment we use.\n- Examples of adjustments can include:\n- providing documents in large print or braille\n  allowing more time for a test or interview or\n  providing assistance at an assessment centre\n  If you need any reasonable adjustments, tell us when you submit your application that you need an adjustment and how it will help.\n- Back to top\n  Is this page useful?\n  Yes\n  No\n  Report a problem with this page\n  Services and information\n  Benefits Births, death, marriages and care Business and self-employed Childcare and parenting Citizenship and living in the UK Crime, justice and the law Disabled people Driving and transport Education and learning Employing people Environment and countryside Housing and local services Money and tax Passports, travel and living abroad Visas and immigration Working, jobs and pensions\n  Government activity\n  Departments News Guidance and regulation Research and statistics Policy papers and consultations Transparency How government works Get involved\n  Help Privacy Cookies Accessibility statement Contact Terms and conditions Rhestr o Wasanaethau Cymraeg Government Digital Service\n  All content is available under the Open Government Licence v3.0, except where otherwise stated\n  © Crown copyright\n- Menu\n- HomeGovernmentSuccess Profiles\n  Cabinet Office\n  Guidance\n  Success Profiles: Civil Service behaviours\n  Updated 29 January 2025\n- Contents\n  Why we assess behaviours\n  How we assess behaviours\n  Reasonable adjustments\n  Definitions of behaviours\n  Administrative Assistant (AA) and Administrative Officer (AO) grade or equivalent\n  Executive Officer (EO) grade or equivalent\n  Higher Executive Officer (HEO) and Senior Executive Officer (SEO) grades or equivalent\n  Grade 7 and Grade 6 or equivalent\n  Deputy Director or equivalent\n  Director and Director General\n  Print this page\n  The Civil Service recruits using Success Profiles. They help give us the best possible chance of finding the right person for the job. For each role we advertise, we consider what you will need to demonstrate to be successful.\n- Our Success Profiles are made of five elements:\n  Ability - the aptitude or potential to perform to the required standard\n  Technical - the actions and activities that people do which result in effective performance in a job\n  Behaviours - the actions and activities that people do which result in effective performance in a job\n  Strengths - the things we do regularly, do well and that motivate us\n  Experience - the knowledge or mastery of an activity or subject gained through involvement in or exposure to it\n  The Civil Service has defined a set of behaviours that, when demonstrated, are associated with job success. Civil Service Behaviours are specific to the grade level of the job role.\n- It is important to remember that recruiting managers will choose a selection of behaviours which are best suited to the specific job role.\n- You will not be asked to demonstrate all Civil Service Behaviours for one role.\n- Why we assess behaviours\n  When looking at behaviours, we want to get an understanding of the actions and activities that you have done (or would do) that result in effective performance in a job.\n- As behaviours can be observed and measured, they can help us to predict what your performance in the role could be.\n- If a recruiting manager wishes to assess behaviours they will review the Civil Service Behaviours to determine which are most relevant to the job role. Read the job description carefully to see which behaviours are required for the job you are applying for.\n- How we assess behaviours\n  Behaviours can be assessed in a number of ways and at various stages of the recruitment process, including:\n- application form requiring written examples\n  Civil Service judgement test\n  personality test\n  interview\n  assessment centre\n  job related simulations such as:\n- presentation\n  in-tray exercise\n  written analysis/exercise\n  group exercise/discussion\n  role-play\n  oral briefing\n  Depending on the type of assessment, for example in an application form or at an interview, you may be asked to give examples of when you have demonstrated a particular behaviour.\n- This might be at work or somewhere else such as:\n- work experience\n  volunteering\n  in connection with a hobby\n  Alternatively, you may be asked how you would behave in a given situation. For example by using Situational Judgement Tests or through situational interview questions. You could also be asked to demonstrate a behaviour in real-time, for example during a structured behavioural assessment.\n- Your behaviours may be assessed alongside other elements of the Success Profile to get a more rounded picture of your suitability for the role. The job description will outline the elements required for the role and the selection method(s) that will be used.\n- Reasonable adjustments\n  The Civil Service is a diverse and inclusive workplace. We want to help you demonstrate your full potential whatever type of assessment is used. Examples of adjustments include:\n- providing documents in large print or braille\n  allowing more time for a test or interview\n  providing assistance at an assessment centre\n  If you need any reasonable adjustments to our recruitment process please let the recruiting manager know.\n- Definitions of behaviours\n  Behaviour\tDefinition\n  Seeing the big picture\tUnderstand how your role fits with and supports organisational objectives. Recognise the wider Civil Service priorities and ensure work is in the national interest.\n  Changing and improving\tSeek out opportunities to create effective change and suggest innovative ideas for improvement. Review ways of working, including seeking and providing feedback.\n  Making effective decisions\tUse evidence and knowledge to support accurate, expert decisions and advice. Carefully consider alternative options, implications and risks of decisions.\n  Leadership\tShow pride and passion for public service. Create and engage others in delivering a shared vision. Value difference, diversity and inclusion, ensuring fairness and opportunity for all.\n  Communicating and influencing\tCommunicate purpose and direction with clarity, integrity and enthusiasm. Respect the needs, responses and opinions of others.\n  Working together\tForm effective partnerships and relationships with people both internally and externally, from a range of diverse backgrounds, sharing information, resources and support.\n  Developing self and others\tFocus on continuous learning and development for self, others and the organisation as a whole.\n  Managing a quality service\tDeliver service objectives with professional excellence, expertise and efficiency, taking account of diverse customer needs.\n  Delivering at pace\tTake responsibility for delivering timely and quality results with focus and drive.\n  The following examples of the behaviours are designed to give an overview of what is expected of individuals at each level. In your own examples, consider using the STAR method which allows you to set the scene, show what and how you did and the overall outcome.\n- There is no expectation that you need to demonstrate every part of each example to be successful.\n- Administrative Assistant (AA) and Administrative Officer (AO) grade or equivalent\n  These examples of behaviours give an overview of what we expect at Administrative Assistant (AA) and Administrative Officer (AO) grade or equivalent.\n- Seeing the big picture\n  Examples of seeing the big picture at AA and AO grade or equivalent are when you:\n- understand what your responsibilities are and how these contribute to the priorities of your team\n  consider the varied impact your work could have on individuals with different needs and from other backgrounds\n  gather information from both inside and outside of the organisation to inform your area of work\n  Changing and improving\n  Examples of changing and improving at AA and AO grade or equivalent are when you:\n- review ways of working and suggest improvements, including how to make full use of new digital technologies\n  learn new procedures and help colleagues to do the same\n  query any issues that arise from changes in a suitable way\n  respond in an effective and appropriate manner when emergencies arise\n  Making effective decisions\n  Examples of making effective decisions at AA and AO grade or equivalent are when you:\n- use guidance, analyse relevant information and ask colleagues for input to support decision making\n  identify and deal with any errors or gaps in information before making a decision\n  consider the diverse needs of those affected by decisions and how it will impact them\n  provide advice and feedback to support others in making accurate decisions\n  ask others to clarify decisions when confused and query any issues that arise constructively\n  Leadership\n  Examples of leadership at AA and AO grade or equivalent are when you:\n- show enthusiasm for your work and take personal accountability for your role\n  demonstrate responsibility for your own objectives\n  act in a fair, inclusive and respectful way when dealing with others\n  be considerate and understanding of other people’s points of view\n  understand and support the objectives of the wider team\n  demonstrate consideration of the wider consequences of own actions\n  Communicating and influencing\n  Examples of communicating and influencing at AA and AO grade or equivalent are when you:\n  put forward your views in a clear, constructive and considerate manner\n  use an appropriate method of communication for each person - for example an email, phone call, face-to-face - taking into consideration their individual needs\n  use plain and simple language, being careful to check written work for errors\n  consider the impact of language used on different groups of stakeholders\n  remain honest and truthful when explaining opinions\n  listen and ask questions to ensure your understanding\n  Working together\n  Examples of working together at AA and AO grade or equivalent are when you:\n- proactively contribute to the work of the whole team and remain open to taking on new and different roles\n  get to know your colleagues and build supportive relationships\n  listen to alternative perspectives and needs, responding sensitively and checking understanding where necessary\n  ask for help when needed and support others when the opportunity arises\n  are aware of the need to consider your own wellbeing and that of your colleagues\n  understand that bullying, harassment and discrimination are unacceptable\n  Developing self and others\n  Examples of developing yourself and others at AA and AO grade or equivalent are when you:\n- identify gaps in your skills and knowledge and make plans of how to develop these\n  take time to achieve development objectives\n  listen to and act on feedback from colleagues to find areas you can develop\n  share knowledge and skills learnt with colleagues to contribute to the learning and development of the whole team\n  Managing a quality service\n  Examples of managing a quality service at AA and AO grade or equivalent are when you:\n- gain a clear understanding of customers’ needs and expectations\n  plan, organise and manage your own time to deliver a high quality service which gives taxpayers a good return for their money\n  act to prevent problems by identifying issues, reporting them and providing solutions\n  keep customers and all colleagues up to date with progress\n  show customers where to access relevant information and support that will help them to use services more effectively\n  Delivering at pace\n  Examples of delivering at pace at AA and AO grade or equivalent are when you:\n- always work with focus and pace to get the job done on time and to a high standard\n  follow the relevant policies, procedures and rules that apply to the job\n  use own knowledge and expertise to organise work\n  keep focused on delivery and take responsibility for the quality of work produced\n  keep a consistent level of personal performance\n  keep managers and stakeholders updated on how work is progressing\n  Executive Officer (EO) grade or equivalent\n  These examples of behaviours give an overview of what we expect at Executive Officer (EO) grade or equivalent.\n- Seeing the big picture\n  Examples of seeing the big picture at EO grade or equivalent are when you:\n- understand how your work and the work of your team supports wider objectives and meets the diverse needs of stakeholders\n  keep up to date with the issues that affect your work area\n  take a keen interest in expanding knowledge in areas related to your work\n  focus on overall goals and not just specific tasks to meet priorities\n  Changing and improving\n  Examples of changing and Improving at EO grade or equivalent are when you:\n- regularly review own and team’s work and take the initiative to suggest ideas to make improvements\n  give feedback on changes in a constructive manner\n  take a positive, open approach to the possibility of change and encourage others to do the same\n  help others to understand changes and the reasons they are being put in place\n  identify and act on the effects changes are having on your role and that of the team\n  look for ways to use technology to achieve efficient and effective results\n  consider accessibility needs of the diverse range of end users\n  Making effective decisions\n  Examples of making effective decisions at EO grade or equivalent are when you:\n- take responsibility for making effective and fair decisions, in a timely manner\n  analyse and research further information to support decisions\n  talk to relevant people to get advice and information when unsure how to proceed\n  explain how decisions have been reached in a clear and concise way, both verbally and in writing\n  demonstrate the consideration of all options, costs, risks and wider implications, including the diverse needs of end users and any accessibility requirements\n  Leadership\n  Examples of leadership at EO grade or equivalent are when you:\n  show pride and passion for your work and positive, inclusive engagement with your team\n  understand your areas of responsibility and display awareness of the wider impact of your actions\n  proactively role model and promote an inclusive workplace, promptly dealing with inappropriate language and behaviours when they arise - including any instances of discrimination or misconduct\n  give praise and credit to colleagues and stakeholders where appropriate\n  Communicating and influencing\n  Examples of communicating and influencing at EO grade or equivalent are when you:\n- communicate clearly and concisely both orally and in writing\n  take time to consider the best communication channel to use for the audience, including making the best of digital resources and considering value for money\n  interact with others in an enthusiastic way\n  express ideas clearly and with respect for others\n  listen to and value different ideas, views and ways of working\n  respond constructively and objectively to comments and questions\n  handle challenging conversations with confidence and sensitivity\n  Working together\n  Examples of working together at EO grade or equivalent are when you:\n- develop a range of contacts outside own team and identify opportunities to share knowledge, information and learning\n  show genuine interest when listening to others\n  contribute to an inclusive working environment where all opinions and challenges are listened to and all individual needs are taken into account\n  ensure it is clear that bullying, harassment and discrimination are unacceptable\n  offer support and help to colleagues when in need, including consideration of your own and their wellbeing\n  change ways of working to aid cooperation within and between teams in order to achieve results\n  Developing self and others\n  Examples of developing yourself and others at EO grade or equivalent are when you:\n- identify gaps in own and team’s skills and knowledge\n  set and consistently meet development objectives\n  seek learning opportunities\n  support the development plans of all colleagues, recognising how diversity of experience/background can help to build an inclusive team culture\n  consider the contributions of all team members and delegate work to aid the learning and development of all\n  encourage and listen to developmental feedback from colleagues\n  Managing a quality service\n  Examples of managing a quality service at EO grade or equivalent are when you:\n- work with customers to understand their needs and expectations\n  create clear plans and set priorities which meet the needs of both the customer and the business\n  clearly explain to customers what can be done\n  keep colleagues and stakeholders fully informed of plans, possibilities and progress\n  identify common problems that affect service, report them and find possible solutions\n  deliver good customer service which balances quality and cost effectiveness\n  Delivering at pace\n  Examples of delivering at pace at EO grade or equivalent are when you:\n- regularly review the success of activities in the team to identify barriers to progress or challenging objectives\n  identify who and what is required to ensure success, set clear goals and areas of responsibility and continually assess workloads considering individual needs\n  follow relevant policies, procedures and legislation to complete your work\n  ensure colleagues have the correct tools and resources available to them to do their jobs\n  have a positive and focused attitude to achieving outcomes, despite any setbacks\n  regularly check performance against objectives, making suggestions for improvement or taking corrective action where necessary\n  ensure that colleagues are supported where tasks are challenging\n  Higher Executive Officer (HEO) and Senior Executive Officer (SEO) grades or equivalent\n  These examples of behaviours give an overview of what we expect at Higher Executive Officer (HEO) and Senior Executive Officer (SEO) grades or equivalent.\n- Seeing the big picture\n  Examples of seeing the big picture at HEO and SEO grades or equivalent are when you:\n- understand the strategic drivers for your area of work\n  align activities to contribute to wider organisational priorities\n  remain alert to emerging issues and trends which might impact your work area\n  seek out and share experiences to develop knowledge of the team’s business area\n  understand how the strategies and activities of the team create value and meet the diverse needs of all stakeholders\n  Changing and improving\n  Examples of changing and improving at HEO and SEO grades or equivalent are when you:\n- work with others to identify areas for improvement and simplify processes to use fewer resources\n  use technology where possible to increase efficiency\n  encourage ideas for change from a wide range of sources\n  clearly explain the reasons for change to colleagues and how to implement them, supporting individuals with different needs to adapt to change\n  encourage an environment where colleagues know that they can challenge decisions and issues safely\n  take managed risks by fully considering the varied impacts changes could have on the diverse range of end users\n  Making effective decisions\n  Examples of making effective decisions at HEO and SEO grades or equivalent are when you:\n- understand your own level of responsibility and empower others to make decisions where appropriate\n  analyse and use a range of relevant, credible information from internal and external sources to support decisions\n  invite challenge and where appropriate involve others in decision making\n  display confidence when making difficult decisions, even if they prove to be unpopular\n  consult with others to ensure the potential impacts on end users have been considered\n  present strong recommendations in a timely manner outlining the consideration of other options, costs, benefits and risks\n  Leadership\n  Examples of leadership at HEO and SEO grades or equivalent are when you:\n- ensure colleagues and stakeholders have a clear understanding of objectives, activities and time-frames\n  take into account different individual needs, views, and ideas, championing inclusion and equality of opportunity for all\n  consider the impacts of own and team’s activities on stakeholders and end users\n  role-model commitment and satisfaction with role\n  recognise and praise the achievements of others to drive positivity within the team\n  effectively manage conflict, misconduct and non-inclusive behaviour, raising with senior managers where appropriate\n  Communicating and influencing\n  Examples of communicating and influencing at HEO and SEO grades or equivalent are when you:\n  communicate in a straightforward, honest and engaging manner - choosing appropriate styles to maximise understanding and impact\n  encourage the use of different communication methods, including digital resources and highlight the benefits, including ensuring cost effectiveness\n  ensure communication has a clear purpose and takes into account people’s individual needs\n  share information as appropriate and check understanding\n  show positivity and enthusiasm towards work, encouraging others to do the same\n  ensure that important messages are communicated with colleagues and stakeholders respectfully, taking into consideration the diversity of interests\n  Working together\n  Examples of working together at HEO and SEO grades or equivalent are when you:\n- encourage joined up team work within your own team and across other groups\n  establish professional relationships with a range of stakeholders\n  collaborate with these to share information, resources and support\n  invest time to develop a common focus and genuine positive team spirit where colleagues feel valued and respect one another\n  put in place support for the wellbeing of individuals within the team, including consideration of your own needs\n  make it clear to all team members that bullying, harassment and discrimination are unacceptable\n  actively seek and consider input of people from diverse backgrounds and perspectives\n  Developing self and others\n  Examples of developing yourself and others at HEO and SEO grades or equivalent are when you:\n- identify capability gaps for yourself and your team\n  ensure development objectives are set and achieved to address any gaps and enable delivery of current and future work\n  take time to coach, mentor and develop other colleagues to support succession planning\n  promote inclusiveness by respecting different personal needs in the team and use these to develop others\n  reflect on your own work, continuously seek and act on feedback to improve own and team’s performance\n  Managing a quality service\n  Examples of managing a quality service at HEO and SEO grades or equivalent are when you:\n- develop, implement, maintain and review systems and services to ensure delivery of professional excellence\n  work with stakeholders to set priorities, objectives and timescales\n  successfully deliver high quality outcomes that meet the customers’ needs and gives value for money\n  identify risks and resolve issues efficiently\n  involve a diverse range of colleagues, stakeholders and delivery partners in developing suggestions for improvements\n  establish ways to find and respond to feedback from customers about the services provided\n  Delivering at pace\n  Examples of delivering at pace at HEO and SEO grades or equivalent are when you:\n- show a positive approach to keeping the whole team’s efforts focused on the top priorities\n  promote a culture of following the appropriate procedures to ensure results are achieved on time whilst still enabling innovation\n  ensure the most appropriate resources are available for colleagues to use to do their job effectively\n  regularly monitor your own and team’s work against milestones ensuring individual needs are considered when setting tasks\n  act promptly to reassess workloads and priorities when there are conflicting demands to maintain performance\n  allow individuals the space and authority to meet objectives, providing additional support where necessary, whilst keeping overall responsibility\n  Grade 7 and Grade 6 or equivalent\n  These examples of behaviours give an overview of what we expect at Grade 7 and Grade 6 or equivalent.\n- Seeing the big picture\n  Examples of seeing the big picture at Grade 6 and Grade 7 or equivalent are when you:\n- develop and maintain an understanding of economic, social, political, environmental and technological developments to ensure activity is relevant\n  ensure plans and activities in your area of work reflect wider strategic priorities and communicate effectively with senior leaders to influence future strategies\n  adopt a government wide perspective to ensure alignment of activity and policy\n  bring together views, perspectives and diverse needs of stakeholders to gain a broader understanding of the issues surrounding policies and activities\n  Changing and improving\n  Examples of changing and improving at Grade 6 and Grade 7 or equivalent are when you:\n- encourage, recognise and share innovative ideas from a diverse range of colleagues and stakeholders\n  give people space to take initiative and praise them for their creativity\n  create an environment where people feel safe to challenge and know their voice will be heard\n  make changes which add value and clearly articulate how changes will benefit the business\n  understand and identify the role of technology in public service delivery and policy implementation\n  consider the full impact of implementing changes on culture, structure, morale and the impacts on the diverse range of end users, including accessibility needs\n  identify early signs that things are going wrong and respond promptly\n  provide constructive challenge to senior management on change proposals\n  Making effective decisions\n  Examples of making effective decisions at Grade 6 and Grade 7 or equivalent are when you:\n- clarify your own understanding and stakeholder needs and expectations, before making decisions\n  ensure decision making happens at the right level, not allowing unnecessary bureaucracy to hinder delivery\n  encourage both innovative suggestions and challenge from others, to inform decision making\n  analyse and accurately interpret data from various sources to support decisions\n  find the best option by identifying positives, negatives, risks and implications\n  present reasonable conclusions from a wide range of complex and sometimes incomplete evidence\n  make decisions confidently even when details are unclear or if they prove to be unpopular\n  Leadership\n  Examples of leadership at Grade 6 and Grade 7 or equivalent are when you:\n- promote diversity, inclusion and equality of opportunity, respecting difference and external experience\n  welcome and respond to views and challenges from others, despite any conflicting pressures to ignore or give in to them\n  stand by, promote or defend your own and your team’s actions and decisions where needed\n  seek out shared interests beyond your own area of responsibility, understanding the extent of the impact actions have on the organisation\n  inspire and motivate teams to be fully engaged in their work and dedicated to their role\n  Communicating and influencing\n  Examples of communicating and influencing at Grade 6 and Grade 7 or equivalent are when you:\n- communicate with others in a clear, honest and enthusiastic way in order to build trust.\n  explain complex issues in a way that is easy to understand\n  take into account people’s individual needs\n  deliver difficult messages with clarity and sensitivity, being persuasive when required\n  consider the impact of the language used\n  remain open-minded and impartial in discussions, whilst respecting the diverse interests and opinions of others\n  introduce different methods for communication, including making the most of digital resources whilst getting value for money\n  monitor the effectiveness of own and team communications and take action to improve where necessary\n  Working Together\n  Examples of working together at Grade 6 and Grade 7 or equivalent are when you:\n- actively build and maintain a network of colleagues and contacts to achieve progress on shared objectives\n  challenge assumptions while being willing to compromise if beneficial to progress\n  build strong interpersonal relationships and show genuine care for colleagues\n  ensure consideration and support for the wellbeing of yourself and individuals throughout the team\n  understand the varying needs of the team to ensure they are supported and their experiences are utilised\n  create an inclusive working environment where all opinions and challenges are taken into account and bullying, harassment and discrimination are unacceptable\n  remain available and approachable to all colleagues and be receptive to new ideas\n  Developing self and others\n  Examples of developing yourself and others at Grade 6 and Grade 7 or equivalent are when you:\n- prioritise and role-model continuous self-learning and development\n  identify areas individuals and teams need to develop in order to achieve future objectives\n  support colleagues to take responsibility for their own learning and development\n  ensure that development opportunities are available for all individuals regardless of their background or desire to achieve promotion\n  ensure individuals take full advantage of learning and development opportunities available to them, including workplace based learning\n  encourage discussions within and between teams to learn from each other’s experiences and change organisational plans and processes accordingly\n  Managing a quality service\n  Examples of managing a quality service at Grade 6 and Grade 7 or equivalent are when you:\n- demonstrate positive customer service by understanding the complexity and diversity of customer needs and expectations\n  deliver a high quality, efficient and cost effective service by considering a broad range of methods for delivery\n  ensure full consideration of new technologies, accessibility and costings\n  make clear, practical and manageable plans for service delivery\n  ensure adherence to legal, regulatory and security requirements in service delivery\n  proactively manage risks and identify solutions\n  establish how the business area compares to industry best practice\n  create regular opportunities for colleagues, stakeholders, delivery partners and customers to help improve the quality of service\n  Delivering at pace\n  Examples of delivering at pace at Grade 6 and Grade 7 or equivalent are when you:\n- ensure everyone clearly understands and owns their roles, responsibilities and business priorities\n  give honest, motivating and enthusiastic messages about priorities, objectives and expectations to get the best out of people\n  comply with legal, regulatory and security requirements in service delivery\n  set out clear processes and standards for managing performance at all levels\n  ensure delivery of timely quality outcomes, through providing the right resources to do the job, reviewing and adjusting performance expectations and rewarding success\n  maintain your own levels of performance in challenging circumstances and encourage others to do the same\n  Deputy Director or equivalent\n  These examples of behaviours give an overview of what we expect at Deputy Director or equivalent.\n- Seeing the big picture\n  Examples of seeing the big picture at Deputy Director grade or equivalent are when you:\n- anticipate the long-term impact on the department of economic, political, environmental, social and technological developments, at both national and international levels\n  create joined up strategies that put into practice and support the government’s vision for the future\n  identify and shape how your work area fits within and supports the priorities of the organisation\n  develop an in-depth insight into customers, services, communities and markets affected by your work areas and the wider public sector context\n  ensure work is in the national interest whilst meeting the diverse needs of all end users\n  Changing and improving\n  Examples of changing and improving at Deputy Director grade or equivalent are when you:\n- challenge the way things have always been done and suggest improvements, learning from experience\n  seek, encourage and recognise initiative and imaginative ideas from a wide range of people\n  promote an environment where all colleagues feel safe to challenge\n  encourage measured risk taking and innovation to deliver better approaches and services\n  implement changes that transform flexibility, responsiveness and quality of service\n  ensure changes add value to the business and express clearly how and why changes are necessary\n  lead the transformation towards using digital technologies ensuring full consideration of accessibility needs and the diverse range of end users\n  manage change effectively and respond promptly to critical events\n  constructively challenge changes which are unhelpful\n  Making effective decisions\n  Examples of making effective decisions at Deputy Director grade or equivalent are when you:\n- act decisively and make bold, unbiased decisions at a strategic level\n  make sense of a wide range of political and national pressures and influences to develop strategies which meet organisational goals\n  clearly communicate the purpose and reasons for recommendations and decisions\n  consult with others where necessary to ensure decisions meet the diverse needs of the end users\n  accept and respond to challenge constructively\n  clearly recommend the best option articulating risks and impacts on economic, environmental, political and social factors\n  Leadership\n  Examples of leadership at Deputy Director grade or equivalent are when you:\n- remain visible and approachable to all colleagues and stakeholders\n  actively promote the reputation of the organisation with pride, both internally and externally\n  display passion and enthusiasm for the work, helping to inspire colleagues and stakeholders to fully engage with the aims and long term vision\n  embed a culture of inclusion and equal opportunity for all, where the diversity of individuals’ backgrounds and experiences are valued and respected\n  work to influence the strategy, direction and culture to increase effectiveness\n  Communicating and influencing\n  Examples of communicating and influencing at Deputy Director grade or equivalent are when you:\n- implement communication strategies which ensure effective communications are embedded and take account of people’s individual needs\n  embed a culture where there is a wide ranging use of the infrastructure in place to support varied communication methods which deliver value for money\n  communicate in a straightforward, honest and truthful way with consideration for the impact of the method used\n  communicate with conviction and clarity in the face of tough negotiations or challenges\n  respect and consider the diversity of the audience when giving messages and deliver these appropriately\n  influence external partners, stakeholders and customers successfully securing mutually beneficial outcomes\n  Working together\n  Examples of working together at Deputy Director grade or equivalent are when you:\n- proactively create, maintain and promote a strong network of contacts across the organisation and externally\n  embed an inclusive culture of creating positive and supportive teams who consider the diverse needs and feelings of other colleagues\n  ensure consideration and support for the wellbeing of all individuals across the organisation\n  set out clear expectations that bullying, harassment, and discrimination are unacceptable\n  encourage and establish mechanisms to share knowledge and resources across boundaries to support the business\n  encourage teams to engage with a variety of delivery partners and stakeholders, listen to and act on their feedback\n  Developing self and others\n  Examples of developing yourself and others at Deputy Director grade or equivalent are when you:\n- provide a range of experiences to encourage development, talent and career management for all individuals.\n  role-model continuous self-learning and development, evaluate effectiveness and plan next steps\n  ensure colleagues take responsibility for their own learning and development\n  provide colleagues with opportunities to share their knowledge and skills with others to build organisational effectiveness\n  share your own expertise through coaching and mentoring to support teams to succeed\n  create an inclusive environment from which all individuals can develop regardless of their needs or background\n  deliver strategies to grow sustainable capability across all groups, including those with high potential and ensuring that the strategies tackle the imbalance in diversity\n  Managing a quality service\n  Examples of managing a quality service at Deputy Director grade or equivalent are when you:\n- clarify and articulate the diverse requirements of customers and delivery partners\n  use customer insight to drive high quality and efficient service delivery which is a good investment of taxpayers money\n  work collaboratively with customers and delivery partners to manage, monitor and deliver agreed outcomes\n  identify areas for improvement and make appropriate changes to reach professional excellence\n  break down complex aims into clear, practical and manageable plans\n  identify the resource requirements to support implementation\n  ensure risks are monitored and managed to prevent issues with service delivery wherever possible\n  Delivering at pace\n  Examples of delivering at pace at Deputy Director grade or equivalent are when you:\n- translate strategic priorities into clear outcome-focused objectives for managers and teams\n  promote resilience and responsiveness in the organisation\n  deliver against own objectives, while ensuring others take responsibility for their areas\n  establish an inclusive culture which allows people space and authority to deliver their objectives whilst ensuring appropriate support is in place when needed\n  give people credit for maintaining focus on priorities, while responding quickly to changing requirements\n  act as a role model for delivery by showing efficiency and focus, while being open to new ideas and honest about challenges\n  provide clarity about the action required to achieve results and address unexpected developments\n  ensure all appropriate tools and resources are available for individuals to fulfil their job role\n  Director and Director General\n  These examples of behaviours give an overview of what we expect at Director and Director General or equivalent.\n- Seeing the big picture\n  Examples of seeing the big picture at Director and Director General grades are when you:\n- Develop an in-depth insight into the dynamics and issues surrounding the department and the government\n  understand political, economic, social, environmental and technological impact at both national and international levels\n  establish where the department sits within and aligns across the Civil Service\n  ensure teams understand their role within the wider business\n  shape the department’s role and purpose in delivering civil service priorities which are in the national interest and meet the diverse needs of all stakeholders\n  create clear long-term strategies focused on adding value to the nation and making real, lasting change beyond the Civil Service\n  fully engage with senior leaders from across government to support strategic decision making\n  Changing and improving\n  Examples of changing and improving at Director and Director General grades are when you:\n- constructively challenge bureaucratic decision making, resourcing structures and processes across the Civil Service\n  strive to simplify approaches to create an effective organisation using digital technologies ensuring full consideration of accessibility needs and the diverse range of end users\n  proactively champion and lead change, seeking innovative new approaches, policies and systems that add value to the organisation\n  create a culture of innovation, flexibility and responsiveness enabling departments to swiftly respond to change\n  have the confidence to take calculated risks to change how things are done\n  establish an environment where all colleagues feel safe to challenge without fear\n  consider the full impact of change on the organisational culture and wider government structures\n  Making effective decisions\n  Examples of making effective decisions at Director and Director General grades are when you:\n- develop departmental or functional strategies and priorities while considering a wide range of political, national and international pressures\n  manage and mitigate evaluated risks and options when making decisions\n  demonstrate transparency around decisions and create a culture where others feel able to challenge decisions being made\n  give unbiased evidence-led advice to Ministers and other senior officials based on extensive robust analysis\n  when required, be able to make unpopular decisions and defend them at the highest level\n  ensure early and continued engagement with the right stakeholders when making recommendations or decisions\n  emphasise the importance of considering the different needs of end users\n  Leadership\n  Examples of leadership at Director and Director General grades are when you:\n- actively develop and protect the reputation of the Civil Service, creating a sense of pride and passion for public service\n  present a clear and focused strategy with direction for the future\n  act in ways that are highly visible, inspirational and credible at the most senior levels across and outside of the Civil Service\n  create an inclusive environment where diversity is valued and there is equality of opportunity for all\n  engage positively in debate and resolve ambiguities, gaining the best possible outcomes for the department\n  Communicating and influencing\n  Examples of communicating and influencing at Director and Director General grades are when you:\n- demonstrate and promote communicating with honesty, integrity, impartiality and objectivity\n  ensure there is the infrastructure to support varied communication methods which are cost effective and keep up with advances in digital technology\n  develop a culture where colleagues consider the individual needs of people when deciding how to communicate and understand the impacts of the chosen methods\n  communicate purpose and direction with respect, clarity and enthusiasm\n  overcome objections to gain acceptance of the vision and purpose of the department\n  use your influence to make a positive difference across the Civil Service and externally\n  Working together\n  Examples of working together at Director and Director General grades are when you:\n- drive an inclusive and collaborative working culture which values diversity and encourages, openness, approachability and sensitivity\n  ensure the wellbeing of all individuals is valued across the organisation\n  confront issues and challenge assumptions at the highest levels, no matter how uncomfortable, in an assertive yet constructive way\n  create a culture where bullying, harassment and discrimination are unacceptable\n  build a strong diverse network of professional relationships across the highest levels of government and with Non-Executive Directors\n  act for the wider good of the Civil Service by improving governance at board level to meet Civil Service objectives\n  Developing self and others\n  Examples of developing yourself and others at Director and Director General grades are when you:\n- build a strong culture of continuous learning and knowledge sharing\n  promote the importance of developing everyone to their full potential\n  develop capability strategies that address equality of opportunity and value the diversity of all individuals\n  develop and maintain an organisational commitment to empowering individuals to take responsibility for their own learning\n  take a strategic perspective to identifying the capability needs of the organisation now and in the future\n  be an outstanding mentor and coach to other senior individuals\n  actively seek opportunities for reverse mentoring to increase your knowledge and insights of challenges faced by under-represented groups\n  evaluate own effectiveness and plan ways to develop\n  Managing a quality service\n  Examples of managing a quality service at Director and Director General grades are when you:\n- work across government to ensure delivery of professional excellence and expertise to customers\n  ensure the department has an in-depth and evolving understanding of the broad range of customers’ requirements\n  establish and negotiate service levels and deliverables with delivery partners at a broad strategic level\n  promote delivering value for money, emphasising a good return on tax payers money\n  ensure all parts of the delivery chain fully understand the required outcomes for the customer\n  ensure all colleagues and stakeholders involved in delivery are clear about the impacts of poor service and communication on the customer\n  Delivering at pace\n  Examples of delivering at pace at Director and Director General grades are when you:\n- set and maintain a clear direction for the department, with highly focused priorities and project and programme outcomes\n  define and integrate clear structures, systems and resources across the department which promote efficient service delivery\n  swiftly adjust priorities as changing situations dictate\n  enable the organisation to remain focused on core priorities irrespective of external challenges\n  encourage, support and coach individuals and teams to keep focus on delivery\n  drive a performance culture across the department which gives teams the space and authority to deliver objectives, whilst holding them accountable for outcomes\n  Back to top\n  Is this page useful?\n  Yes\n  No\n  Report a problem with this page\n  Services and information\n  Benefits Births, death, marriages and care Business and self-employed Childcare and parenting Citizenship and living in the UK Crime, justice and the law Disabled people Driving and transport Education and learning Employing people Environment and countryside Housing and local services Money and tax Passports, travel and living abroad Visas and immigration Working, jobs and pensions\n  Government activity\n  Departments News Guidance and regulation Research and statistics Policy papers and consultations Transparency How government works Get involved\n  Help Privacy Cookies Accessibility statement Contact Terms and conditions Rhestr o Wasanaethau Cymraeg Government Digital Service\n  All content is available under the Open Government Licence v3.0, except where otherwise stated\n  © Crown copyright\n- Menu\n- HomeGovernmentSuccess Profiles\n  Cabinet Office\n  Guidance\n  Success Profiles: Strengths\n  Updated 29 January 2025\n- Contents\n  Civil Service strengths\n  Why we assess strengths\n  How we assess strengths\n  Reasonable adjustments\n  Strength definitions\n  Strengths mapped to Civil Service behaviours\n  Print this page\n  The Civil Service recruits using Success Profiles. They help give us the best possible chance of finding the right person for the job. For each role we advertise, we consider what you will need to demonstrate to be successful.\n- Our Success Profiles are made of five elements:\n  Ability - the aptitude or potential to perform to the required standard\n  Technical - the actions and activities that people do which result in effective performance in a job\n  Behaviours - the actions and activities that people do which result in effective performance in a job\n  Strengths - the things we do regularly, do well and that motivate us\n  Experience - the knowledge or mastery of an activity or subject gained through involvement in or exposure to it\n  Not all elements are relevant to every role. The makeup of the Success Profile should be different for different types of job. This helps us to improve the chances of getting the best person for the job.\n- Civil Service strengths\n  Strengths are the things that we do regularly, do well and that motivate us. They are relevant to the culture and type of work that we do.\n- Civil Service strengths are not defined by job grade.\n- There are three elements which determine whether something is a strength:\n  Performance - you can perform an activity/behaviour to a high level of capability\n  Engagement - you feel motivated, enthused and empowered when doing the activity.\n  Use - you do the activity regularly and as often as possible.\n  Why we assess strengths\n  When we look at your strengths, we want to know if you are a good fit with the organisation or job role. We will look at what you enjoy doing and what you do well and often. By making sure that the role is the right fit, you are more likely to enjoy it and perform well.\n- How we assess strengths\n  Strengths can be assessed in different ways, for example:\n- interviews\n  recorded video interviews\n  bespoke situational strengths test\n  simulation assessment\n  personality test\n  We may ask questions at your interview to help us understand if you have the relevant strengths for the job. It is important to remember that there are no right or wrong answers to these questions.\n  Do not rehearse your answers - because we are looking for your initial response. The job advert will describe the qualities you need for the role. The best way to prepare is to reflect on:\n- what you think your personal strengths are\n  your preferred ways of working\n  Your strengths may be assessed alongside other elements of the Success profile. This helps us to get a more rounded picture of your suitability for the role. The job advert will tell you which elements you need for the role and the selection method(s) we will use.\n- Reasonable adjustments\n  The Civil Service is a diverse and inclusive workplace. We want to help you show your full potential whatever type of assessment we use.\n- Examples of adjustments can include:\n- providing documents in large print or braille\n  allowing more time for a test or interview\n  providing assistance at an assessment centre\n  If you need any reasonable adjustments, tell us when you submit your application that you need an adjustment and how it will help.\n- Strength definitions\n  Strength\tDefinition\n  Adaptable\tYou can adapt to variations in work or environment. Your effectiveness is not affected by change. You are flexible and versatile. You act as an advocate for change.\n  Analytical\tYou seek and analyse information to inform your decisions, based on the best available evidence.\n  Authentic\tYou are self-aware and true to yourself in all situations, even when under pressure.\n  Catalyst\tYou are self-motivated to act towards achieving a goal. You are confident using your own initiative to take forward actions.\n  Challenger\tYou can bring a fresh perspective whatever the situation or context. You see other people’s views and appreciate that there are many different angles to consider.\n  Change agent\tYou are positive and inspirational in leading and supporting others through change.\n  Confident\tYou take charge of situations, people and decisions. You communicate with confidence and give direction.\n  Courageous\tYou are an innovator who tries new approaches. You push yourself to work outside your comfort zone.\n  Decisive\tYou use your judgement. You take a considered approach to situations and tasks when making decisions.\n  Disciplined\tYou follow processes, operating well within set standards, rules and guidelines.\n  Efficient\tYou convert resources into results in the most efficient and cost effective way.\n  Emotionally intelligent\tYou draw insight from your own emotions and those of others to show empathy.\n  Enabler\tYou see the potential in everybody and encourage them to learn, progress and develop.\n  Explainer\tYou communicate thoughts and ideas, verbally or in writing. You simplify complexities and adapt communication so others can understand.\n  Focused\tYou strive for quality outcomes and excellence in everything you do.\n  Inclusive\tYou recognise everyone as an individual. You accept people for who they are and treat everyone fairly. You actively encourage and provide opportunities for others to share ideas and contributions.\n  Influencer\tYou influence others, you articulate the rationale to gain their agreement.\n  Improver\tYou look for better ways of doing things and enjoy coming up with new and original ideas.\n  Learner\tYou are inquisitive, seek out new information and look for new ways to develop yourself.\n  Mediator\tYou provide stability and cohesion within teams, finding common ground and purpose. You enjoy working with others towards a shared goal.\n  Mission\tYou pursue things which give you a sense of meaning and purpose, working towards a longer term goal.\n  Motivator\tYou are highly driven and inspire others to move things along and make things happen.\n  Negotiator\tYou support constructive discussion and enjoy getting all parties to reach an agreement.\n  Networker\tYou create and maintain positive, professional and trusting working relationships. These can be with a wide range of people within and outside your organisation. You identify connections and reach out to bring people together.\n  Organiser\tYou make plans and are well prepared. You seek to maximise time and productivity.\n  Precise\tYou concentrate on detail and make sure everything is accurate and error free.\n  Preventer\tYou think ahead to anticipate, identify and address risks or problems before they happen.\n  Problem solver\tYou take a positive approach to tackling problems. You find ways to identify suitable solutions.\n  Relationship builder\tYou quickly establish mutual respect and trust, building long lasting relationships with others.\n  Resilient\tYou have inner composure, recover quickly from setbacks and learn from them.\n  Responsible\tYou take ownership for your decisions. You hold yourself accountable for what you have promised.\n  Service focused\tYou look for ways to serve customers putting their needs at the heart of everything you do.\n  Strategic\tYou look at the big picture. You consider the wider factors and long term implications of decisions.\n  Team leader\tYou are confident to lead a team. You effectively manage team dynamics toward a shared goal. You consider everyone’s individual needs and create a genuine team spirit.\n  Team player\tYou work well as part of a team and strive to ensure the team pulls together and is effective.\n  Visionary\tYou create and share a clear vision of the future.\n  Strengths mapped to Civil Service behaviours\n  The strengths are mapped to the most relevant Civil Service behaviour(s). However, any strength can be assessed if suitable for the role.\n- Seeing the big picture\n  Challenger\n  Mission\n  Strategic\n  Visionary\n  Changing and improving\n  Adaptable\n  Courageous\n  Change agent\n  Improver\n  Problem solver\n- Resilient\n  Making effective decisions\n  Analytical\n  Decisive\n  Preventer\n  Problem solver\n  Leadership\n  Confident\n  Change agent\n  Inclusive\n  Motivator\n  Team leader\n  Visionary\n  Communicating and influencing\n  Authentic\n  Emotionally intelligent\n  Explainer\n  Inclusive\n  Influencer\n  Working together\n  Challenger\n  Emotionally intelligent\n  Inclusive\n  Negotiator\n  Networker\n  Relationship builder\n  Team player\n  Mediator\n  Developing self and others\n  Enabler\n  Explainer\n  Inclusive\n  Learner\n  Managing a quality service\n  Disciplined\n  Efficient\n  Focussed\n  Organiser\n  Precise\n  Preventer\n  Service\n  Focused\n  Delivering at pace\n  Adaptable\n  Disciplined\n  Catalyst\n  Focused\n  Organiser\n  Resilient\n  Responsible\n  Back to top\n  Is this page useful?\n  Yes\n  No\n  Report a problem with this page\n  Services and information\n  Benefits Births, death, marriages and care Business and self-employed Childcare and parenting Citizenship and living in the UK Crime, justice and the law Disabled people Driving and transport Education and learning Employing people Environment and countryside Housing and local services Money and tax Passports, travel and living abroad Visas and immigration Working, jobs and pensions\n  Government activity\n  Departments News Guidance and regulation Research and statistics Policy papers and consultations Transparency How government works Get involved\n  Help Privacy Cookies Accessibility statement Contact Terms and conditions Rhestr o Wasanaethau Cymraeg Government Digital Service\n  All content is available under the Open Government Licence v3.0, except where otherwise stated\n  © Crown copyright\n- Menu\n- HomeGovernmentSuccess Profiles\n  Cabinet Office\n  Guidance\n  Success Profiles: Strengths\n  Updated 29 January 2025\n- Contents\n  Civil Service strengths\n  Why we assess strengths\n  How we assess strengths\n  Reasonable adjustments\n  Strength definitions\n  Strengths mapped to Civil Service behaviours\n  Print this page\n  The Civil Service recruits using Success Profiles. They help give us the best possible chance of finding the right person for the job. For each role we advertise, we consider what you will need to demonstrate to be successful.\n- Our Success Profiles are made of five elements:\n  Ability - the aptitude or potential to perform to the required standard\n  Technical - the actions and activities that people do which result in effective performance in a job\n  Behaviours - the actions and activities that people do which result in effective performance in a job\n  Strengths - the things we do regularly, do well and that motivate us\n  Experience - the knowledge or mastery of an activity or subject gained through involvement in or exposure to it\n  Not all elements are relevant to every role. The makeup of the Success Profile should be different for different types of job. This helps us to improve the chances of getting the best person for the job.\n- Civil Service strengths\n  Strengths are the things that we do regularly, do well and that motivate us. They are relevant to the culture and type of work that we do.\n- Civil Service strengths are not defined by job grade.\n- There are three elements which determine whether something is a strength:\n  Performance - you can perform an activity/behaviour to a high level of capability\n  Engagement - you feel motivated, enthused and empowered when doing the activity.\n  Use - you do the activity regularly and as often as possible.\n  Why we assess strengths\n  When we look at your strengths, we want to know if you are a good fit with the organisation or job role. We will look at what you enjoy doing and what you do well and often. By making sure that the role is the right fit, you are more likely to enjoy it and perform well.\n- How we assess strengths\n  Strengths can be assessed in different ways, for example:\n- interviews\n  recorded video interviews\n  bespoke situational strengths test\n  simulation assessment\n  personality test\n  We may ask questions at your interview to help us understand if you have the relevant strengths for the job. It is important to remember that there are no right or wrong answers to these questions.\n  Do not rehearse your answers - because we are looking for your initial response. The job advert will describe the qualities you need for the role. The best way to prepare is to reflect on:\n- what you think your personal strengths are\n  your preferred ways of working\n  Your strengths may be assessed alongside other elements of the Success profile. This helps us to get a more rounded picture of your suitability for the role. The job advert will tell you which elements you need for the role and the selection method(s) we will use.\n- Reasonable adjustments\n  The Civil Service is a diverse and inclusive workplace. We want to help you show your full potential whatever type of assessment we use.\n- Examples of adjustments can include:\n- providing documents in large print or braille\n  allowing more time for a test or interview\n  providing assistance at an assessment centre\n  If you need any reasonable adjustments, tell us when you submit your application that you need an adjustment and how it will help.\n- Strength definitions\n  Strength\tDefinition\n  Adaptable\tYou can adapt to variations in work or environment. Your effectiveness is not affected by change. You are flexible and versatile. You act as an advocate for change.\n  Analytical\tYou seek and analyse information to inform your decisions, based on the best available evidence.\n  Authentic\tYou are self-aware and true to yourself in all situations, even when under pressure.\n  Catalyst\tYou are self-motivated to act towards achieving a goal. You are confident using your own initiative to take forward actions.\n  Challenger\tYou can bring a fresh perspective whatever the situation or context. You see other people’s views and appreciate that there are many different angles to consider.\n  Change agent\tYou are positive and inspirational in leading and supporting others through change.\n  Confident\tYou take charge of situations, people and decisions. You communicate with confidence and give direction.\n  Courageous\tYou are an innovator who tries new approaches. You push yourself to work outside your comfort zone.\n  Decisive\tYou use your judgement. You take a considered approach to situations and tasks when making decisions.\n  Disciplined\tYou follow processes, operating well within set standards, rules and guidelines.\n  Efficient\tYou convert resources into results in the most efficient and cost effective way.\n  Emotionally intelligent\tYou draw insight from your own emotions and those of others to show empathy.\n  Enabler\tYou see the potential in everybody and encourage them to learn, progress and develop.\n  Explainer\tYou communicate thoughts and ideas, verbally or in writing. You simplify complexities and adapt communication so others can understand.\n  Focused\tYou strive for quality outcomes and excellence in everything you do.\n  Inclusive\tYou recognise everyone as an individual. You accept people for who they are and treat everyone fairly. You actively encourage and provide opportunities for others to share ideas and contributions.\n  Influencer\tYou influence others, you articulate the rationale to gain their agreement.\n  Improver\tYou look for better ways of doing things and enjoy coming up with new and original ideas.\n  Learner\tYou are inquisitive, seek out new information and look for new ways to develop yourself.\n  Mediator\tYou provide stability and cohesion within teams, finding common ground and purpose. You enjoy working with others towards a shared goal.\n  Mission\tYou pursue things which give you a sense of meaning and purpose, working towards a longer term goal.\n  Motivator\tYou are highly driven and inspire others to move things along and make things happen.\n  Negotiator\tYou support constructive discussion and enjoy getting all parties to reach an agreement.\n  Networker\tYou create and maintain positive, professional and trusting working relationships. These can be with a wide range of people within and outside your organisation. You identify connections and reach out to bring people together.\n  Organiser\tYou make plans and are well prepared. You seek to maximise time and productivity.\n  Precise\tYou concentrate on detail and make sure everything is accurate and error free.\n  Preventer\tYou think ahead to anticipate, identify and address risks or problems before they happen.\n  Problem solver\tYou take a positive approach to tackling problems. You find ways to identify suitable solutions.\n  Relationship builder\tYou quickly establish mutual respect and trust, building long lasting relationships with others.\n  Resilient\tYou have inner composure, recover quickly from setbacks and learn from them.\n  Responsible\tYou take ownership for your decisions. You hold yourself accountable for what you have promised.\n  Service focused\tYou look for ways to serve customers putting their needs at the heart of everything you do.\n  Strategic\tYou look at the big picture. You consider the wider factors and long term implications of decisions.\n  Team leader\tYou are confident to lead a team. You effectively manage team dynamics toward a shared goal. You consider everyone’s individual needs and create a genuine team spirit.\n  Team player\tYou work well as part of a team and strive to ensure the team pulls together and is effective.\n  Visionary\tYou create and share a clear vision of the future.\n  Strengths mapped to Civil Service behaviours\n  The strengths are mapped to the most relevant Civil Service behaviour(s). However, any strength can be assessed if suitable for the role.\n- Seeing the big picture\n  Challenger\n  Mission\n  Strategic\n  Visionary\n  Changing and improving\n  Adaptable\n  Courageous\n  Change agent\n  Improver\n  Problem solver\n- Resilient\n  Making effective decisions\n  Analytical\n  Decisive\n  Preventer\n  Problem solver\n  Leadership\n  Confident\n  Change agent\n  Inclusive\n  Motivator\n  Team leader\n  Visionary\n  Communicating and influencing\n  Authentic\n  Emotionally intelligent\n  Explainer\n  Inclusive\n  Influencer\n  Working together\n  Challenger\n  Emotionally intelligent\n  Inclusive\n  Negotiator\n  Networker\n  Relationship builder\n  Team player\n  Mediator\n  Developing self and others\n  Enabler\n  Explainer\n  Inclusive\n  Learner\n  Managing a quality service\n  Disciplined\n  Efficient\n  Focussed\n  Organiser\n  Precise\n  Preventer\n  Service\n  Focused\n  Delivering at pace\n  Adaptable\n  Disciplined\n  Catalyst\n  Focused\n  Organiser\n  Resilient\n  Responsible\n  Back to top\n  Is this page useful?\n  Yes\n  No\n  Report a problem with this page\n  Services and information\n  Benefits Births, death, marriages and care Business and self-employed Childcare and parenting Citizenship and living in the UK Crime, justice and the law Disabled people Driving and transport Education and learning Employing people Environment and countryside Housing and local services Money and tax Passports, travel and living abroad Visas and immigration Working, jobs and pensions\n  Government activity\n  Departments News Guidance and regulation Research and statistics Policy papers and consultations Transparency How government works Get involved\n  Help Privacy Cookies Accessibility statement Contact Terms and conditions Rhestr o Wasanaethau Cymraeg Government Digital Service\n  All content is available under the Open Government Licence v3.0, except where otherwise stated\n  © Crown copyright\n- Menu\n- HomeGovernmentSuccess Profiles\n  Cabinet Office\n  Guidance\n  Success Profiles: Civil Service behaviours\n  Updated 29 January 2025\n- Contents\n  Why we assess behaviours\n  How we assess behaviours\n  Reasonable adjustments\n  Definitions of behaviours\n  Administrative Assistant (AA) and Administrative Officer (AO) grade or equivalent\n  Executive Officer (EO) grade or equivalent\n  Higher Executive Officer (HEO) and Senior Executive Officer (SEO) grades or equivalent\n  Grade 7 and Grade 6 or equivalent\n  Deputy Director or equivalent\n  Director and Director General\n  Print this page\n  The Civil Service recruits using Success Profiles. They help give us the best possible chance of finding the right person for the job. For each role we advertise, we consider what you will need to demonstrate to be successful.\n- Our Success Profiles are made of five elements:\n  Ability - the aptitude or potential to perform to the required standard\n  Technical - the actions and activities that people do which result in effective performance in a job\n  Behaviours - the actions and activities that people do which result in effective performance in a job\n  Strengths - the things we do regularly, do well and that motivate us\n  Experience - the knowledge or mastery of an activity or subject gained through involvement in or exposure to it\n  The Civil Service has defined a set of behaviours that, when demonstrated, are associated with job success. Civil Service Behaviours are specific to the grade level of the job role.\n- It is important to remember that recruiting managers will choose a selection of behaviours which are best suited to the specific job role.\n- You will not be asked to demonstrate all Civil Service Behaviours for one role.\n- Why we assess behaviours\n  When looking at behaviours, we want to get an understanding of the actions and activities that you have done (or would do) that result in effective performance in a job.\n- As behaviours can be observed and measured, they can help us to predict what your performance in the role could be.\n- If a recruiting manager wishes to assess behaviours they will review the Civil Service Behaviours to determine which are most relevant to the job role. Read the job description carefully to see which behaviours are required for the job you are applying for.\n- How we assess behaviours\n  Behaviours can be assessed in a number of ways and at various stages of the recruitment process, including:\n- application form requiring written examples\n  Civil Service judgement test\n  personality test\n  interview\n  assessment centre\n  job related simulations such as:\n- presentation\n  in-tray exercise\n  written analysis/exercise\n  group exercise/discussion\n  role-play\n  oral briefing\n  Depending on the type of assessment, for example in an application form or at an interview, you may be asked to give examples of when you have demonstrated a particular behaviour.\n- This might be at work or somewhere else such as:\n- work experience\n  volunteering\n  in connection with a hobby\n  Alternatively, you may be asked how you would behave in a given situation. For example by using Situational Judgement Tests or through situational interview questions. You could also be asked to demonstrate a behaviour in real-time, for example during a structured behavioural assessment.\n- Your behaviours may be assessed alongside other elements of the Success Profile to get a more rounded picture of your suitability for the role. The job description will outline the elements required for the role and the selection method(s) that will be used.\n- Reasonable adjustments\n  The Civil Service is a diverse and inclusive workplace. We want to help you demonstrate your full potential whatever type of assessment is used. Examples of adjustments include:\n- providing documents in large print or braille\n  allowing more time for a test or interview\n  providing assistance at an assessment centre\n  If you need any reasonable adjustments to our recruitment process please let the recruiting manager know.\n- Definitions of behaviours\n  Behaviour\tDefinition\n  Seeing the big picture\tUnderstand how your role fits with and supports organisational objectives. Recognise the wider Civil Service priorities and ensure work is in the national interest.\n  Changing and improving\tSeek out opportunities to create effective change and suggest innovative ideas for improvement. Review ways of working, including seeking and providing feedback.\n  Making effective decisions\tUse evidence and knowledge to support accurate, expert decisions and advice. Carefully consider alternative options, implications and risks of decisions.\n  Leadership\tShow pride and passion for public service. Create and engage others in delivering a shared vision. Value difference, diversity and inclusion, ensuring fairness and opportunity for all.\n  Communicating and influencing\tCommunicate purpose and direction with clarity, integrity and enthusiasm. Respect the needs, responses and opinions of others.\n  Working together\tForm effective partnerships and relationships with people both internally and externally, from a range of diverse backgrounds, sharing information, resources and support.\n  Developing self and others\tFocus on continuous learning and development for self, others and the organisation as a whole.\n  Managing a quality service\tDeliver service objectives with professional excellence, expertise and efficiency, taking account of diverse customer needs.\n  Delivering at pace\tTake responsibility for delivering timely and quality results with focus and drive.\n  The following examples of the behaviours are designed to give an overview of what is expected of individuals at each level. In your own examples, consider using the STAR method which allows you to set the scene, show what and how you did and the overall outcome.\n- There is no expectation that you need to demonstrate every part of each example to be successful.\n- Administrative Assistant (AA) and Administrative Officer (AO) grade or equivalent\n  These examples of behaviours give an overview of what we expect at Administrative Assistant (AA) and Administrative Officer (AO) grade or equivalent.\n- Seeing the big picture\n  Examples of seeing the big picture at AA and AO grade or equivalent are when you:\n- understand what your responsibilities are and how these contribute to the priorities of your team\n  consider the varied impact your work could have on individuals with different needs and from other backgrounds\n  gather information from both inside and outside of the organisation to inform your area of work\n  Changing and improving\n  Examples of changing and improving at AA and AO grade or equivalent are when you:\n- review ways of working and suggest improvements, including how to make full use of new digital technologies\n  learn new procedures and help colleagues to do the same\n  query any issues that arise from changes in a suitable way\n  respond in an effective and appropriate manner when emergencies arise\n  Making effective decisions\n  Examples of making effective decisions at AA and AO grade or equivalent are when you:\n- use guidance, analyse relevant information and ask colleagues for input to support decision making\n  identify and deal with any errors or gaps in information before making a decision\n  consider the diverse needs of those affected by decisions and how it will impact them\n  provide advice and feedback to support others in making accurate decisions\n  ask others to clarify decisions when confused and query any issues that arise constructively\n  Leadership\n  Examples of leadership at AA and AO grade or equivalent are when you:\n- show enthusiasm for your work and take personal accountability for your role\n  demonstrate responsibility for your own objectives\n  act in a fair, inclusive and respectful way when dealing with others\n  be considerate and understanding of other people’s points of view\n  understand and support the objectives of the wider team\n  demonstrate consideration of the wider consequences of own actions\n  Communicating and influencing\n  Examples of communicating and influencing at AA and AO grade or equivalent are when you:\n  put forward your views in a clear, constructive and considerate manner\n  use an appropriate method of communication for each person - for example an email, phone call, face-to-face - taking into consideration their individual needs\n  use plain and simple language, being careful to check written work for errors\n  consider the impact of language used on different groups of stakeholders\n  remain honest and truthful when explaining opinions\n  listen and ask questions to ensure your understanding\n  Working together\n  Examples of working together at AA and AO grade or equivalent are when you:\n- proactively contribute to the work of the whole team and remain open to taking on new and different roles\n  get to know your colleagues and build supportive relationships\n  listen to alternative perspectives and needs, responding sensitively and checking understanding where necessary\n  ask for help when needed and support others when the opportunity arises\n  are aware of the need to consider your own wellbeing and that of your colleagues\n  understand that bullying, harassment and discrimination are unacceptable\n  Developing self and others\n  Examples of developing yourself and others at AA and AO grade or equivalent are when you:\n- identify gaps in your skills and knowledge and make plans of how to develop these\n  take time to achieve development objectives\n  listen to and act on feedback from colleagues to find areas you can develop\n  share knowledge and skills learnt with colleagues to contribute to the learning and development of the whole team\n  Managing a quality service\n  Examples of managing a quality service at AA and AO grade or equivalent are when you:\n- gain a clear understanding of customers’ needs and expectations\n  plan, organise and manage your own time to deliver a high quality service which gives taxpayers a good return for their money\n  act to prevent problems by identifying issues, reporting them and providing solutions\n  keep customers and all colleagues up to date with progress\n  show customers where to access relevant information and support that will help them to use services more effectively\n  Delivering at pace\n  Examples of delivering at pace at AA and AO grade or equivalent are when you:\n- always work with focus and pace to get the job done on time and to a high standard\n  follow the relevant policies, procedures and rules that apply to the job\n  use own knowledge and expertise to organise work\n  keep focused on delivery and take responsibility for the quality of work produced\n  keep a consistent level of personal performance\n  keep managers and stakeholders updated on how work is progressing\n  Executive Officer (EO) grade or equivalent\n  These examples of behaviours give an overview of what we expect at Executive Officer (EO) grade or equivalent.\n- Seeing the big picture\n  Examples of seeing the big picture at EO grade or equivalent are when you:\n- understand how your work and the work of your team supports wider objectives and meets the diverse needs of stakeholders\n  keep up to date with the issues that affect your work area\n  take a keen interest in expanding knowledge in areas related to your work\n  focus on overall goals and not just specific tasks to meet priorities\n  Changing and improving\n  Examples of changing and Improving at EO grade or equivalent are when you:\n- regularly review own and team’s work and take the initiative to suggest ideas to make improvements\n  give feedback on changes in a constructive manner\n  take a positive, open approach to the possibility of change and encourage others to do the same\n  help others to understand changes and the reasons they are being put in place\n  identify and act on the effects changes are having on your role and that of the team\n  look for ways to use technology to achieve efficient and effective results\n  consider accessibility needs of the diverse range of end users\n  Making effective decisions\n  Examples of making effective decisions at EO grade or equivalent are when you:\n- take responsibility for making effective and fair decisions, in a timely manner\n  analyse and research further information to support decisions\n  talk to relevant people to get advice and information when unsure how to proceed\n  explain how decisions have been reached in a clear and concise way, both verbally and in writing\n  demonstrate the consideration of all options, costs, risks and wider implications, including the diverse needs of end users and any accessibility requirements\n  Leadership\n  Examples of leadership at EO grade or equivalent are when you:\n  show pride and passion for your work and positive, inclusive engagement with your team\n  understand your areas of responsibility and display awareness of the wider impact of your actions\n  proactively role model and promote an inclusive workplace, promptly dealing with inappropriate language and behaviours when they arise - including any instances of discrimination or misconduct\n  give praise and credit to colleagues and stakeholders where appropriate\n  Communicating and influencing\n  Examples of communicating and influencing at EO grade or equivalent are when you:\n- communicate clearly and concisely both orally and in writing\n  take time to consider the best communication channel to use for the audience, including making the best of digital resources and considering value for money\n  interact with others in an enthusiastic way\n  express ideas clearly and with respect for others\n  listen to and value different ideas, views and ways of working\n  respond constructively and objectively to comments and questions\n  handle challenging conversations with confidence and sensitivity\n  Working together\n  Examples of working together at EO grade or equivalent are when you:\n- develop a range of contacts outside own team and identify opportunities to share knowledge, information and learning\n  show genuine interest when listening to others\n  contribute to an inclusive working environment where all opinions and challenges are listened to and all individual needs are taken into account\n  ensure it is clear that bullying, harassment and discrimination are unacceptable\n  offer support and help to colleagues when in need, including consideration of your own and their wellbeing\n  change ways of working to aid cooperation within and between teams in order to achieve results\n  Developing self and others\n  Examples of developing yourself and others at EO grade or equivalent are when you:\n- identify gaps in own and team’s skills and knowledge\n  set and consistently meet development objectives\n  seek learning opportunities\n  support the development plans of all colleagues, recognising how diversity of experience/background can help to build an inclusive team culture\n  consider the contributions of all team members and delegate work to aid the learning and development of all\n  encourage and listen to developmental feedback from colleagues\n  Managing a quality service\n  Examples of managing a quality service at EO grade or equivalent are when you:\n- work with customers to understand their needs and expectations\n  create clear plans and set priorities which meet the needs of both the customer and the business\n  clearly explain to customers what can be done\n  keep colleagues and stakeholders fully informed of plans, possibilities and progress\n  identify common problems that affect service, report them and find possible solutions\n  deliver good customer service which balances quality and cost effectiveness\n  Delivering at pace\n  Examples of delivering at pace at EO grade or equivalent are when you:\n- regularly review the success of activities in the team to identify barriers to progress or challenging objectives\n  identify who and what is required to ensure success, set clear goals and areas of responsibility and continually assess workloads considering individual needs\n  follow relevant policies, procedures and legislation to complete your work\n  ensure colleagues have the correct tools and resources available to them to do their jobs\n  have a positive and focused attitude to achieving outcomes, despite any setbacks\n  regularly check performance against objectives, making suggestions for improvement or taking corrective action where necessary\n  ensure that colleagues are supported where tasks are challenging\n  Higher Executive Officer (HEO) and Senior Executive Officer (SEO) grades or equivalent\n  These examples of behaviours give an overview of what we expect at Higher Executive Officer (HEO) and Senior Executive Officer (SEO) grades or equivalent.\n- Seeing the big picture\n  Examples of seeing the big picture at HEO and SEO grades or equivalent are when you:\n- understand the strategic drivers for your area of work\n  align activities to contribute to wider organisational priorities\n  remain alert to emerging issues and trends which might impact your work area\n  seek out and share experiences to develop knowledge of the team’s business area\n  understand how the strategies and activities of the team create value and meet the diverse needs of all stakeholders\n  Changing and improving\n  Examples of changing and improving at HEO and SEO grades or equivalent are when you:\n- work with others to identify areas for improvement and simplify processes to use fewer resources\n  use technology where possible to increase efficiency\n  encourage ideas for change from a wide range of sources\n  clearly explain the reasons for change to colleagues and how to implement them, supporting individuals with different needs to adapt to change\n  encourage an environment where colleagues know that they can challenge decisions and issues safely\n  take managed risks by fully considering the varied impacts changes could have on the diverse range of end users\n  Making effective decisions\n  Examples of making effective decisions at HEO and SEO grades or equivalent are when you:\n- understand your own level of responsibility and empower others to make decisions where appropriate\n  analyse and use a range of relevant, credible information from internal and external sources to support decisions\n  invite challenge and where appropriate involve others in decision making\n  display confidence when making difficult decisions, even if they prove to be unpopular\n  consult with others to ensure the potential impacts on end users have been considered\n  present strong recommendations in a timely manner outlining the consideration of other options, costs, benefits and risks\n  Leadership\n  Examples of leadership at HEO and SEO grades or equivalent are when you:\n- ensure colleagues and stakeholders have a clear understanding of objectives, activities and time-frames\n  take into account different individual needs, views, and ideas, championing inclusion and equality of opportunity for all\n  consider the impacts of own and team’s activities on stakeholders and end users\n  role-model commitment and satisfaction with role\n  recognise and praise the achievements of others to drive positivity within the team\n  effectively manage conflict, misconduct and non-inclusive behaviour, raising with senior managers where appropriate\n  Communicating and influencing\n  Examples of communicating and influencing at HEO and SEO grades or equivalent are when you:\n  communicate in a straightforward, honest and engaging manner - choosing appropriate styles to maximise understanding and impact\n  encourage the use of different communication methods, including digital resources and highlight the benefits, including ensuring cost effectiveness\n  ensure communication has a clear purpose and takes into account people’s individual needs\n  share information as appropriate and check understanding\n  show positivity and enthusiasm towards work, encouraging others to do the same\n  ensure that important messages are communicated with colleagues and stakeholders respectfully, taking into consideration the diversity of interests\n  Working together\n  Examples of working together at HEO and SEO grades or equivalent are when you:\n- encourage joined up team work within your own team and across other groups\n  establish professional relationships with a range of stakeholders\n  collaborate with these to share information, resources and support\n  invest time to develop a common focus and genuine positive team spirit where colleagues feel valued and respect one another\n  put in place support for the wellbeing of individuals within the team, including consideration of your own needs\n  make it clear to all team members that bullying, harassment and discrimination are unacceptable\n  actively seek and consider input of people from diverse backgrounds and perspectives\n  Developing self and others\n  Examples of developing yourself and others at HEO and SEO grades or equivalent are when you:\n- identify capability gaps for yourself and your team\n  ensure development objectives are set and achieved to address any gaps and enable delivery of current and future work\n  take time to coach, mentor and develop other colleagues to support succession planning\n  promote inclusiveness by respecting different personal needs in the team and use these to develop others\n  reflect on your own work, continuously seek and act on feedback to improve own and team’s performance\n  Managing a quality service\n  Examples of managing a quality service at HEO and SEO grades or equivalent are when you:\n- develop, implement, maintain and review systems and services to ensure delivery of professional excellence\n  work with stakeholders to set priorities, objectives and timescales\n  successfully deliver high quality outcomes that meet the customers’ needs and gives value for money\n  identify risks and resolve issues efficiently\n  involve a diverse range of colleagues, stakeholders and delivery partners in developing suggestions for improvements\n  establish ways to find and respond to feedback from customers about the services provided\n  Delivering at pace\n  Examples of delivering at pace at HEO and SEO grades or equivalent are when you:\n- show a positive approach to keeping the whole team’s efforts focused on the top priorities\n  promote a culture of following the appropriate procedures to ensure results are achieved on time whilst still enabling innovation\n  ensure the most appropriate resources are available for colleagues to use to do their job effectively\n  regularly monitor your own and team’s work against milestones ensuring individual needs are considered when setting tasks\n  act promptly to reassess workloads and priorities when there are conflicting demands to maintain performance\n  allow individuals the space and authority to meet objectives, providing additional support where necessary, whilst keeping overall responsibility\n  Grade 7 and Grade 6 or equivalent\n  These examples of behaviours give an overview of what we expect at Grade 7 and Grade 6 or equivalent.\n- Seeing the big picture\n  Examples of seeing the big picture at Grade 6 and Grade 7 or equivalent are when you:\n- develop and maintain an understanding of economic, social, political, environmental and technological developments to ensure activity is relevant\n  ensure plans and activities in your area of work reflect wider strategic priorities and communicate effectively with senior leaders to influence future strategies\n  adopt a government wide perspective to ensure alignment of activity and policy\n  bring together views, perspectives and diverse needs of stakeholders to gain a broader understanding of the issues surrounding policies and activities\n  Changing and improving\n  Examples of changing and improving at Grade 6 and Grade 7 or equivalent are when you:\n- encourage, recognise and share innovative ideas from a diverse range of colleagues and stakeholders\n  give people space to take initiative and praise them for their creativity\n  create an environment where people feel safe to challenge and know their voice will be heard\n  make changes which add value and clearly articulate how changes will benefit the business\n  understand and identify the role of technology in public service delivery and policy implementation\n  consider the full impact of implementing changes on culture, structure, morale and the impacts on the diverse range of end users, including accessibility needs\n  identify early signs that things are going wrong and respond promptly\n  provide constructive challenge to senior management on change proposals\n  Making effective decisions\n  Examples of making effective decisions at Grade 6 and Grade 7 or equivalent are when you:\n- clarify your own understanding and stakeholder needs and expectations, before making decisions\n  ensure decision making happens at the right level, not allowing unnecessary bureaucracy to hinder delivery\n  encourage both innovative suggestions and challenge from others, to inform decision making\n  analyse and accurately interpret data from various sources to support decisions\n  find the best option by identifying positives, negatives, risks and implications\n  present reasonable conclusions from a wide range of complex and sometimes incomplete evidence\n  make decisions confidently even when details are unclear or if they prove to be unpopular\n  Leadership\n  Examples of leadership at Grade 6 and Grade 7 or equivalent are when you:\n- promote diversity, inclusion and equality of opportunity, respecting difference and external experience\n  welcome and respond to views and challenges from others, despite any conflicting pressures to ignore or give in to them\n  stand by, promote or defend your own and your team’s actions and decisions where needed\n  seek out shared interests beyond your own area of responsibility, understanding the extent of the impact actions have on the organisation\n  inspire and motivate teams to be fully engaged in their work and dedicated to their role\n  Communicating and influencing\n  Examples of communicating and influencing at Grade 6 and Grade 7 or equivalent are when you:\n- communicate with others in a clear, honest and enthusiastic way in order to build trust.\n  explain complex issues in a way that is easy to understand\n  take into account people’s individual needs\n  deliver difficult messages with clarity and sensitivity, being persuasive when required\n  consider the impact of the language used\n  remain open-minded and impartial in discussions, whilst respecting the diverse interests and opinions of others\n  introduce different methods for communication, including making the most of digital resources whilst getting value for money\n  monitor the effectiveness of own and team communications and take action to improve where necessary\n  Working Together\n  Examples of working together at Grade 6 and Grade 7 or equivalent are when you:\n- actively build and maintain a network of colleagues and contacts to achieve progress on shared objectives\n  challenge assumptions while being willing to compromise if beneficial to progress\n  build strong interpersonal relationships and show genuine care for colleagues\n  ensure consideration and support for the wellbeing of yourself and individuals throughout the team\n  understand the varying needs of the team to ensure they are supported and their experiences are utilised\n  create an inclusive working environment where all opinions and challenges are taken into account and bullying, harassment and discrimination are unacceptable\n  remain available and approachable to all colleagues and be receptive to new ideas\n  Developing self and others\n  Examples of developing yourself and others at Grade 6 and Grade 7 or equivalent are when you:\n- prioritise and role-model continuous self-learning and development\n  identify areas individuals and teams need to develop in order to achieve future objectives\n  support colleagues to take responsibility for their own learning and development\n  ensure that development opportunities are available for all individuals regardless of their background or desire to achieve promotion\n  ensure individuals take full advantage of learning and development opportunities available to them, including workplace based learning\n  encourage discussions within and between teams to learn from each other’s experiences and change organisational plans and processes accordingly\n  Managing a quality service\n  Examples of managing a quality service at Grade 6 and Grade 7 or equivalent are when you:\n- demonstrate positive customer service by understanding the complexity and diversity of customer needs and expectations\n  deliver a high quality, efficient and cost effective service by considering a broad range of methods for delivery\n  ensure full consideration of new technologies, accessibility and costings\n  make clear, practical and manageable plans for service delivery\n  ensure adherence to legal, regulatory and security requirements in service delivery\n  proactively manage risks and identify solutions\n  establish how the business area compares to industry best practice\n  create regular opportunities for colleagues, stakeholders, delivery partners and customers to help improve the quality of service\n  Delivering at pace\n  Examples of delivering at pace at Grade 6 and Grade 7 or equivalent are when you:\n- ensure everyone clearly understands and owns their roles, responsibilities and business priorities\n  give honest, motivating and enthusiastic messages about priorities, objectives and expectations to get the best out of people\n  comply with legal, regulatory and security requirements in service delivery\n  set out clear processes and standards for managing performance at all levels\n  ensure delivery of timely quality outcomes, through providing the right resources to do the job, reviewing and adjusting performance expectations and rewarding success\n  maintain your own levels of performance in challenging circumstances and encourage others to do the same\n  Deputy Director or equivalent\n  These examples of behaviours give an overview of what we expect at Deputy Director or equivalent.\n- Seeing the big picture\n  Examples of seeing the big picture at Deputy Director grade or equivalent are when you:\n- anticipate the long-term impact on the department of economic, political, environmental, social and technological developments, at both national and international levels\n  create joined up strategies that put into practice and support the government’s vision for the future\n  identify and shape how your work area fits within and supports the priorities of the organisation\n  develop an in-depth insight into customers, services, communities and markets affected by your work areas and the wider public sector context\n  ensure work is in the national interest whilst meeting the diverse needs of all end users\n  Changing and improving\n  Examples of changing and improving at Deputy Director grade or equivalent are when you:\n- challenge the way things have always been done and suggest improvements, learning from experience\n  seek, encourage and recognise initiative and imaginative ideas from a wide range of people\n  promote an environment where all colleagues feel safe to challenge\n  encourage measured risk taking and innovation to deliver better approaches and services\n  implement changes that transform flexibility, responsiveness and quality of service\n  ensure changes add value to the business and express clearly how and why changes are necessary\n  lead the transformation towards using digital technologies ensuring full consideration of accessibility needs and the diverse range of end users\n  manage change effectively and respond promptly to critical events\n  constructively challenge changes which are unhelpful\n  Making effective decisions\n  Examples of making effective decisions at Deputy Director grade or equivalent are when you:\n- act decisively and make bold, unbiased decisions at a strategic level\n  make sense of a wide range of political and national pressures and influences to develop strategies which meet organisational goals\n  clearly communicate the purpose and reasons for recommendations and decisions\n  consult with others where necessary to ensure decisions meet the diverse needs of the end users\n  accept and respond to challenge constructively\n  clearly recommend the best option articulating risks and impacts on economic, environmental, political and social factors\n  Leadership\n  Examples of leadership at Deputy Director grade or equivalent are when you:\n- remain visible and approachable to all colleagues and stakeholders\n  actively promote the reputation of the organisation with pride, both internally and externally\n  display passion and enthusiasm for the work, helping to inspire colleagues and stakeholders to fully engage with the aims and long term vision\n  embed a culture of inclusion and equal opportunity for all, where the diversity of individuals’ backgrounds and experiences are valued and respected\n  work to influence the strategy, direction and culture to increase effectiveness\n  Communicating and influencing\n  Examples of communicating and influencing at Deputy Director grade or equivalent are when you:\n- implement communication strategies which ensure effective communications are embedded and take account of people’s individual needs\n  embed a culture where there is a wide ranging use of the infrastructure in place to support varied communication methods which deliver value for money\n  communicate in a straightforward, honest and truthful way with consideration for the impact of the method used\n  communicate with conviction and clarity in the face of tough negotiations or challenges\n  respect and consider the diversity of the audience when giving messages and deliver these appropriately\n  influence external partners, stakeholders and customers successfully securing mutually beneficial outcomes\n  Working together\n  Examples of working together at Deputy Director grade or equivalent are when you:\n- proactively create, maintain and promote a strong network of contacts across the organisation and externally\n  embed an inclusive culture of creating positive and supportive teams who consider the diverse needs and feelings of other colleagues\n  ensure consideration and support for the wellbeing of all individuals across the organisation\n  set out clear expectations that bullying, harassment, and discrimination are unacceptable\n  encourage and establish mechanisms to share knowledge and resources across boundaries to support the business\n  encourage teams to engage with a variety of delivery partners and stakeholders, listen to and act on their feedback\n  Developing self and others\n  Examples of developing yourself and others at Deputy Director grade or equivalent are when you:\n- provide a range of experiences to encourage development, talent and career management for all individuals.\n  role-model continuous self-learning and development, evaluate effectiveness and plan next steps\n  ensure colleagues take responsibility for their own learning and development\n  provide colleagues with opportunities to share their knowledge and skills with others to build organisational effectiveness\n  share your own expertise through coaching and mentoring to support teams to succeed\n  create an inclusive environment from which all individuals can develop regardless of their needs or background\n  deliver strategies to grow sustainable capability across all groups, including those with high potential and ensuring that the strategies tackle the imbalance in diversity\n  Managing a quality service\n  Examples of managing a quality service at Deputy Director grade or equivalent are when you:\n- clarify and articulate the diverse requirements of customers and delivery partners\n  use customer insight to drive high quality and efficient service delivery which is a good investment of taxpayers money\n  work collaboratively with customers and delivery partners to manage, monitor and deliver agreed outcomes\n  identify areas for improvement and make appropriate changes to reach professional excellence\n  break down complex aims into clear, practical and manageable plans\n  identify the resource requirements to support implementation\n  ensure risks are monitored and managed to prevent issues with service delivery wherever possible\n  Delivering at pace\n  Examples of delivering at pace at Deputy Director grade or equivalent are when you:\n- translate strategic priorities into clear outcome-focused objectives for managers and teams\n  promote resilience and responsiveness in the organisation\n  deliver against own objectives, while ensuring others take responsibility for their areas\n  establish an inclusive culture which allows people space and authority to deliver their objectives whilst ensuring appropriate support is in place when needed\n  give people credit for maintaining focus on priorities, while responding quickly to changing requirements\n  act as a role model for delivery by showing efficiency and focus, while being open to new ideas and honest about challenges\n  provide clarity about the action required to achieve results and address unexpected developments\n  ensure all appropriate tools and resources are available for individuals to fulfil their job role\n  Director and Director General\n  These examples of behaviours give an overview of what we expect at Director and Director General or equivalent.\n- Seeing the big picture\n  Examples of seeing the big picture at Director and Director General grades are when you:\n- Develop an in-depth insight into the dynamics and issues surrounding the department and the government\n  understand political, economic, social, environmental and technological impact at both national and international levels\n  establish where the department sits within and aligns across the Civil Service\n  ensure teams understand their role within the wider business\n  shape the department’s role and purpose in delivering civil service priorities which are in the national interest and meet the diverse needs of all stakeholders\n  create clear long-term strategies focused on adding value to the nation and making real, lasting change beyond the Civil Service\n  fully engage with senior leaders from across government to support strategic decision making\n  Changing and improving\n  Examples of changing and improving at Director and Director General grades are when you:\n- constructively challenge bureaucratic decision making, resourcing structures and processes across the Civil Service\n  strive to simplify approaches to create an effective organisation using digital technologies ensuring full consideration of accessibility needs and the diverse range of end users\n  proactively champion and lead change, seeking innovative new approaches, policies and systems that add value to the organisation\n  create a culture of innovation, flexibility and responsiveness enabling departments to swiftly respond to change\n  have the confidence to take calculated risks to change how things are done\n  establish an environment where all colleagues feel safe to challenge without fear\n  consider the full impact of change on the organisational culture and wider government structures\n  Making effective decisions\n  Examples of making effective decisions at Director and Director General grades are when you:\n- develop departmental or functional strategies and priorities while considering a wide range of political, national and international pressures\n  manage and mitigate evaluated risks and options when making decisions\n  demonstrate transparency around decisions and create a culture where others feel able to challenge decisions being made\n  give unbiased evidence-led advice to Ministers and other senior officials based on extensive robust analysis\n  when required, be able to make unpopular decisions and defend them at the highest level\n  ensure early and continued engagement with the right stakeholders when making recommendations or decisions\n  emphasise the importance of considering the different needs of end users\n  Leadership\n  Examples of leadership at Director and Director General grades are when you:\n- actively develop and protect the reputation of the Civil Service, creating a sense of pride and passion for public service\n  present a clear and focused strategy with direction for the future\n  act in ways that are highly visible, inspirational and credible at the most senior levels across and outside of the Civil Service\n  create an inclusive environment where diversity is valued and there is equality of opportunity for all\n  engage positively in debate and resolve ambiguities, gaining the best possible outcomes for the department\n  Communicating and influencing\n  Examples of communicating and influencing at Director and Director General grades are when you:\n- demonstrate and promote communicating with honesty, integrity, impartiality and objectivity\n  ensure there is the infrastructure to support varied communication methods which are cost effective and keep up with advances in digital technology\n  develop a culture where colleagues consider the individual needs of people when deciding how to communicate and understand the impacts of the chosen methods\n  communicate purpose and direction with respect, clarity and enthusiasm\n  overcome objections to gain acceptance of the vision and purpose of the department\n  use your influence to make a positive difference across the Civil Service and externally\n  Working together\n  Examples of working together at Director and Director General grades are when you:\n- drive an inclusive and collaborative working culture which values diversity and encourages, openness, approachability and sensitivity\n  ensure the wellbeing of all individuals is valued across the organisation\n  confront issues and challenge assumptions at the highest levels, no matter how uncomfortable, in an assertive yet constructive way\n  create a culture where bullying, harassment and discrimination are unacceptable\n  build a strong diverse network of professional relationships across the highest levels of government and with Non-Executive Directors\n  act for the wider good of the Civil Service by improving governance at board level to meet Civil Service objectives\n  Developing self and others\n  Examples of developing yourself and others at Director and Director General grades are when you:\n- build a strong culture of continuous learning and knowledge sharing\n  promote the importance of developing everyone to their full potential\n  develop capability strategies that address equality of opportunity and value the diversity of all individuals\n  develop and maintain an organisational commitment to empowering individuals to take responsibility for their own learning\n  take a strategic perspective to identifying the capability needs of the organisation now and in the future\n  be an outstanding mentor and coach to other senior individuals\n  actively seek opportunities for reverse mentoring to increase your knowledge and insights of challenges faced by under-represented groups\n  evaluate own effectiveness and plan ways to develop\n  Managing a quality service\n  Examples of managing a quality service at Director and Director General grades are when you:\n- work across government to ensure delivery of professional excellence and expertise to customers\n  ensure the department has an in-depth and evolving understanding of the broad range of customers’ requirements\n  establish and negotiate service levels and deliverables with delivery partners at a broad strategic level\n  promote delivering value for money, emphasising a good return on tax payers money\n  ensure all parts of the delivery chain fully understand the required outcomes for the customer\n  ensure all colleagues and stakeholders involved in delivery are clear about the impacts of poor service and communication on the customer\n  Delivering at pace\n  Examples of delivering at pace at Director and Director General grades are when you:\n- set and maintain a clear direction for the department, with highly focused priorities and project and programme outcomes\n  define and integrate clear structures, systems and resources across the department which promote efficient service delivery\n  swiftly adjust priorities as changing situations dictate\n  enable the organisation to remain focused on core priorities irrespective of external challenges\n  encourage, support and coach individuals and teams to keep focus on delivery\n  drive a performance culture across the department which gives teams the space and authority to deliver objectives, whilst holding them accountable for outcomes\n  Back to top\n  Is this page useful?\n  Yes\n  No\n  Report a problem with this page\n  Services and information\n  Benefits Births, death, marriages and care Business and self-employed Childcare and parenting Citizenship and living in the UK Crime, justice and the law Disabled people Driving and transport Education and learning Employing people Environment and countryside Housing and local services Money and tax Passports, travel and living abroad Visas and immigration Working, jobs and pensions\n  Government activity\n  Departments News Guidance and regulation Research and statistics Policy papers and consultations Transparency How government works Get involved\n  Help Privacy Cookies Accessibility statement Contact Terms and conditions Rhestr o Wasanaethau Cymraeg Government Digital Service\n  All content is available under the Open Government Licence v3.0, except where otherwise stated\n  © Crown copyright\n- Menu\n- HomeGovernmentSuccess Profiles\n  Cabinet Office\n  Guidance\n  Success Profiles: Technical\n  Updated 29 January 2025\n- Contents\n  Why we assess technical skills, knowledge and qualifications\n  How we assess technical skills, knowledge and qualifications\n  Reasonable adjustments\n  Print this page\n  The Civil Service recruits using Success Profiles. They help give us the best possible chance of finding the right person for the job. For each role we advertise, we consider what you will need to demonstrate to be successful.\n- Our Success Profiles are made of five elements:\n  Ability - the aptitude or potential to perform to the required standard\n  Technical - the actions and activities that people do which result in effective performance in a job\n  Behaviours - the actions and activities that people do which result in effective performance in a job\n  Strengths - the things we do regularly, do well and that motivate us\n  Experience - the knowledge or mastery of an activity or subject gained through involvement in or exposure to it\n  Not all elements are relevant to every role. The makeup of the Success Profile should be different for different types of job. This helps to improve the chances of getting the best person for the job.\n- Why we assess technical skills, knowledge and qualifications\n  There are more than 20 professions in the Civil Service. The professions offer a wide range of roles, including some specialised ones.\n- The head of each Profession defines the specific skills, knowledge and qualifications we may ask you to demonstrate to be successful in these roles.\n- For example, a specialised role in Government Finance may need candidates to have:\n- accountancy qualifications\n  knowledge of the way we manage finance within government\n  How we assess technical skills, knowledge and qualifications\n  Some professions have a professional framework. The frameworks are designed to assess the specific skills, qualifications and knowledge needed for that profession’s roles.\n- The job advert will list any technical requirements you may need for the role. It will also explain which assessment methods we will use. Some of the assessment methods to assess your technical skills may include:\n- application form\n  CV\n  interview\n  technical presentations and exercises\n  technical test(s)\n  presentation\n  work sample(s)\n  in-tray exercise\n  job related simulation\n  oral briefing exercise\n  written analysis/exercise\n  assessment centre\n  If there is a need for a particular qualification or membership of a professional body, we may ask you to provide evidence of your qualification(s) or membership.\n- We may assess your technical/professional skills along with other elements of the Success Profile. This will help to get a more rounded picture of your suitability for the role.\n- Reasonable adjustments \n  The Civil Service is a diverse and inclusive workplace. We want to help you show your full potential whatever type of assessment we use.\n- Examples of adjustments can include:\n- providing documents in large print or braille\n  allowing more time for a test or interview \n  providing assistance at an assessment centre\n  If you need any reasonable adjustments, tell us when you submit your application that you need an adjustment and how it will help.\n- Back to top\n  Is this page useful?\n  Yes\n  No\n  Report a problem with this page\n  Services and information\n  Benefits Births, death, marriages and care Business and self-employed Childcare and parenting Citizenship and living in the UK Crime, justice and the law Disabled people Driving and transport Education and learning Employing people Environment and countryside Housing and local services Money and tax Passports, travel and living abroad Visas and immigration Working, jobs and pensions\n  Government activity\n  Departments News Guidance and regulation Research and statistics Policy papers and consultations Transparency How government works Get involved\n  Help Privacy Cookies Accessibility statement Contact Terms and conditions Rhestr o Wasanaethau Cymraeg Government Digital Service\n  All content is available under the Open Government Licence v3.0, except where otherwise stated\n  © Crown copyright\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Metaverse platforms continue to evolve with focus on interoperability and open standards\n  - Web3 integration accelerating with decentralised identity and asset ownership\n  - Enterprise adoption growing in virtual collaboration, training, and digital twins\n  - UK companies increasingly active in metaverse development and immersive technologies\n\n- Technical capabilities\n  - Real-time rendering at photorealistic quality levels\n  - Low-latency networking enabling seamless multi-user experiences\n  - AI-driven content generation and procedural world building\n  - Spatial audio and haptics enhancing immersion\n\n- UK and North England context\n  - Manchester: Digital Innovation Factory supports metaverse startups and research\n  - Leeds: Holovis leads in immersive experiences for entertainment and training\n  - Newcastle: University research in spatial computing and interactive systems\n  - Sheffield: Advanced manufacturing using digital twin technology\n\n- Standards and frameworks\n  - Metaverse Standards Forum driving interoperability protocols\n  - WebXR enabling browser-based immersive experiences\n  - glTF and USD for 3D asset interchange\n  - Open Metaverse Interoperability Group defining cross-platform standards\n\n## Metadata\n\n- **Last Updated**: 2025-11-16\n- **Review Status**: Automated remediation with 2025 context\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable",
  "properties": {
    "id": "civil-service-job-owl-axioms",
    "collapsed": "true",
    "- ontology": "true",
    "- term-id": "mv-200985713212",
    "- preferred-term": "civil service job",
    "- source-domain": "metaverse",
    "- status": "active",
    "- public-access": "true",
    "- definition": "A component of the metaverse ecosystem focusing on civil service job.",
    "- maturity": "mature",
    "- authority-score": "0.85",
    "- owl:class": "mv:CivilServiceJob",
    "- owl:physicality": "ConceptualEntity",
    "- owl:role": "Concept",
    "- belongsToDomain": "[[MetaverseDomain]]",
    "- enables": "[[ImmersiveExperience]], [[Presence]], [[SpatialComputing]]",
    "- requires": "[[DisplayTechnology]], [[TrackingSystem]], [[RenderingEngine]]",
    "- bridges-to": "[[HumanComputerInteraction]], [[ComputerVision]], [[Robotics]]"
  },
  "backlinks": [],
  "wiki_links": [
    "TrackingSystem",
    "ImmersiveExperience",
    "ComputerVision",
    "RenderingEngine",
    "SpatialComputing",
    "Robotics",
    "HumanComputerInteraction",
    "MetaverseDomain",
    "DisplayTechnology",
    "Presence"
  ],
  "ontology": {
    "term_id": "mv-200985713212",
    "preferred_term": "civil service job",
    "definition": "A component of the metaverse ecosystem focusing on civil service job.",
    "source_domain": "metaverse",
    "maturity_level": null,
    "authority_score": 0.85
  }
}