{
  "title": "ConceptualLayer",
  "content": "- ### OntologyBlock\n  id:: conceptuallayer-ontology\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: mv-417666147585\n\t- preferred-term:: ConceptualLayer\n\t- source-domain:: metaverse\n\t- status:: active\n\t- public-access:: true\n\t- definition:: A component of the metaverse ecosystem focusing on conceptuallayer.\n\t- maturity:: mature\n\t- authority-score:: 0.85\n\t- owl:class:: mv:Conceptuallayer\n\t- owl:physicality:: ConceptualEntity\n\t- owl:role:: Concept\n\t- belongsToDomain:: [[MetaverseDomain]]\n\t- #### Relationships\n\t  id:: conceptuallayer-relationships\n\t\t- enables:: [[ImmersiveExperience]], [[Presence]], [[SpatialComputing]]\n\t\t- requires:: [[DisplayTechnology]], [[TrackingSystem]], [[RenderingEngine]]\n\t\t- bridges-to:: [[HumanComputerInteraction]], [[ComputerVision]], [[Robotics]]\n\n\t- #### OWL Axioms\n\t  id:: conceptuallayer-owl-axioms\n\t  collapsed:: true\n\t\t- ```clojure\n\t\t  Declaration(Class(mv:Conceptuallayer))\n\n\t\t  # Classification\n\t\t  SubClassOf(mv:Conceptuallayer mv:ConceptualEntity)\n\t\t  SubClassOf(mv:Conceptuallayer mv:Concept)\n\n\t\t  # Domain classification\n\t\t  SubClassOf(mv:Conceptuallayer\n\t\t    ObjectSomeValuesFrom(mv:belongsToDomain mv:MetaverseDomain)\n\t\t  )\n\n\t\t  # Annotations\n\t\t  AnnotationAssertion(rdfs:label mv:Conceptuallayer \"ConceptualLayer\"@en)\n\t\t  AnnotationAssertion(rdfs:comment mv:Conceptuallayer \"A component of the metaverse ecosystem focusing on conceptuallayer.\"@en)\n\t\t  AnnotationAssertion(dcterms:identifier mv:Conceptuallayer \"mv-417666147585\"^^xsd:string)\n\t\t  ```\n\n- ### MetaOntologyBlock\n  id:: conceptual-layer-meta\n  collapsed:: true\n\n  - **Classification**\n    - meta-ontology:: true\n    - classification-type:: layer\n    - name:: ConceptualLayer\n    - scope:: Abstract concepts, principles, theoretical models, and design patterns independent of specific implementations or technical realizations\n    - version:: 1.0.0\n    - last-updated:: 2025-11-08\n\n  - **Definition**\n    - definition:: The ConceptualLayer represents the abstraction level of pure concepts, theoretical models, principles, and design patterns that are independent of specific technical implementations or realizations. This layer encompasses abstract definitions, conceptual frameworks, theoretical foundations, design principles, and logical models that describe what things are and what they should do, without specifying how they are implemented. Concepts in this layer are implementation-agnostic: they can be realized through various technical approaches, protocols, or systems while maintaining their essential conceptual properties. The ConceptualLayer includes abstract data structures (the concept of a blockchain as an ordered chain of blocks, independent of specific blockchain implementations), theoretical protocols (abstract consensus models, independent of specific consensus algorithms), design patterns (decentralization as a principle, independent of specific decentralization mechanisms), foundational principles (immutability, transparency, trustlessness as properties), and logical frameworks (fairness definitions, security properties, correctness criteria). This layer serves as the foundation for understanding domain concepts at their most abstract level, enabling reasoning about properties, relationships, and tradeoffs without getting entangled in implementation details.\n    - purpose:: To provide a classification level for abstract concepts and theoretical models, enabling clear distinction between conceptual understanding (what something is and why it matters) and technical realization (how something is implemented), supporting both theoretical research and practical implementation by establishing clear conceptual foundations\n    - coverage:: This layer covers approximately 105+ concepts across multiple domains including abstract blockchain concepts (blockchain entity, distributed ledger concept, decentralization principle), theoretical fairness definitions (group fairness, individual fairness, algorithmic accountability), abstract security properties (immutability, integrity, authenticity), conceptual economic models (tokenomics principles, incentive alignment theory), and foundational design patterns (trustlessness, transparency, composability)\n\n  - **Taxonomy**\n    - parent-classification:: LayerHierarchy\n    - peer-classifications:: [[SecurityLayer]], [[ProtocolLayer]], [[EconomicLayer]], [[MiddlewareLayer]], [[ApplicationLayer]]\n    - abstraction-level:: highest\n    - cross-cutting:: true\n\n  - **Member Concepts**\n    - concept-count:: 105\n    - blockchain-concepts:: [[Blockchain]], [[Distributed Ledger]], [[Decentralization]], [[Transaction Pool]], [[Mempool]], [[BC-0020-blockchain-entity]]\n    - ai-ethics-concepts:: [[Group vs Individual Fairness]], [[Algorithmic Accountability]], [[Fairness Metrics]], [[Fairness Constraints]], [[Intersectional Fairness]]\n    - consensus-concepts:: [[BC-0040-consensus-mechanism]], [[BC-0058-finality]], [[BC-0066-probabilistic-finality]], [[BC-0067-deterministic-finality]]\n    - economic-concepts:: [[Token]], [[BC-0107-tokenomics]], [[BC-0130-economic-security]], [[BC-0138-voting-power]]\n    - security-concepts:: [[Immutability]], [[Integrity]], [[Authenticity]], [[Non-repudiation]], [[Trustlessness]]\n    - design-patterns:: [[Decentralization]], [[Transparency]], [[Composability]], [[Interoperability]], [[Permissionlessness]]\n    - key-ontologies:: Foundational concepts from BC, AI, and other domains that define what things are at an abstract level, independent of how they are technically realized\n\n  - ## About ConceptualLayer\n    id:: conceptual-layer-about\n    - The ConceptualLayer represents the highest level of abstraction in the ontological classification system, focusing on pure concepts, theoretical models, and abstract principles independent of technical implementation details. This layer is essential because understanding what something is conceptually—its essential properties, relationships, purposes, and tradeoffs—is logically prior to understanding how it is implemented. For example, understanding blockchain conceptually (a chain of cryptographically linked blocks providing immutability and transparency) precedes understanding specific blockchain implementations (Bitcoin's UTXO model vs Ethereum's account model). Similarly, understanding fairness conceptually (various mathematical definitions and their philosophical foundations) precedes implementing fairness-aware algorithms. The ConceptualLayer enables reasoning about essential properties, exploring design spaces, analyzing theoretical tradeoffs, and establishing shared understanding across diverse implementations.\n\n    - The layer serves multiple critical functions in the ontological framework. First, it provides **implementation-agnostic definitions** that remain valid across different technical realizations. For example, \"Consensus Mechanism\" in the ConceptualLayer represents the abstract concept of achieving distributed agreement, which can be implemented through Proof-of-Work (ProtocolLayer implementation), Proof-of-Stake (ProtocolLayer implementation), or Byzantine Fault Tolerance protocols (ProtocolLayer implementation). This abstraction enables discussing consensus properties (safety, liveness, fault tolerance) without committing to specific implementations. Second, the ConceptualLayer establishes **foundational principles** that guide design and implementation decisions: decentralization as a design principle influences architecture choices, immutability as a property guides data structure design, trustlessness as a goal shapes protocol mechanisms.\n\n    - Third, the ConceptualLayer enables **theoretical analysis and reasoning** about systems without implementation complexity. Researchers can reason about fairness-accuracy tradeoffs at a conceptual level, explore theoretical impossibility results (no fairness definition satisfies all desirable properties simultaneously), or analyze game-theoretic incentive compatibility without addressing implementation details. Fourth, the layer provides **shared vocabulary and understanding** across disciplines and specializations. When blockchain developers, economists, policymakers, and social scientists discuss \"decentralization,\" they need shared conceptual understanding even if they focus on different aspects (technical decentralization of nodes, economic decentralization of stake, political decentralization of governance). The ConceptualLayer provides this common ground.\n\n    - Most ontology concepts begin their lifecycle in the ConceptualLayer. A concept is first understood abstractly—its definition, properties, relationships to other concepts, theoretical foundations—before being realized through specific implementations. For example, \"Zero-Knowledge Proof\" exists conceptually (a proof system where the prover can convince the verifier of a statement's truth without revealing any information beyond the statement's validity) before being implemented through specific protocols (zk-SNARKs in ProtocolLayer/SecurityLayer, zk-STARKs in ProtocolLayer/SecurityLayer). Some concepts remain primarily conceptual: \"Trustlessness\" is a principle and property more than an implementation. Others have both conceptual understanding (in ConceptualLayer) and implementation realizations (in other layers).\n\n    - ### Scope and Boundaries\n      - **Included:** Abstract concepts, theoretical models, design principles, logical frameworks, conceptual definitions, property specifications, abstract relationships, design patterns, foundational principles, theoretical analysis, and implementation-agnostic frameworks across all domains.\n\n      - **Excluded:** Specific technical implementations (belong in ProtocolLayer or other implementation layers), concrete algorithms (belong in appropriate implementation layers), specific code or technical specifications (belong in implementation layers), empirical results from specific systems (may be properties of specific implementations rather than conceptual properties), and hardware or physical implementations (belong in PhysicalLayer).\n\n      - **Boundary Clarifications:** The distinction between ConceptualLayer and implementation layers is one of abstraction level and generality. If a concept can be understood and discussed meaningfully without reference to specific technical implementations, it belongs in ConceptualLayer. If a concept is fundamentally about a specific implementation approach, algorithm, or protocol, it belongs in an implementation layer. Some concepts may span layers: for example, \"Blockchain\" has a conceptual understanding (ConceptualLayer) but specific blockchain implementations like Bitcoin (ProtocolLayer, EconomicLayer). In such cases, the concept can be classified in multiple layers, with each layer capturing a different aspect.\n\n    - ### Relationship to Other Classifications\n      - **Abstraction Hierarchy:** ConceptualLayer sits at the highest level of abstraction in the layer hierarchy. More concrete layers include ProtocolLayer (protocol specifications and implementations), SecurityLayer (security-focused implementations), EconomicLayer (economic mechanisms and implementations), MiddlewareLayer (integration and coordination), and ApplicationLayer (end-user applications). This hierarchy reflects increasing concreteness and decreasing abstraction as one moves from conceptual foundations through protocol specifications to concrete implementations and applications.\n\n      - **Cross-Domain Applicability:** Unlike domain classifications (BlockchainDomain, AIEthicsDomain) which organize concepts by subject matter, ConceptualLayer is cross-cutting: it applies to concepts across all domains. There are conceptual blockchain concepts (blockchain, consensus, decentralization), conceptual AI ethics concepts (fairness, accountability, transparency), conceptual infrastructure concepts (scalability, reliability, availability). The layer classification is orthogonal to domain classification: a concept has both a domain (what subject area it belongs to) and a layer (what abstraction level it represents).\n\n      - **Relationship to Implementation Layers:** ConceptualLayer concepts are often realized through concepts in implementation layers. Abstract consensus mechanisms (ConceptualLayer) are implemented through specific protocols like PBFT or Tendermint (ProtocolLayer). Abstract fairness definitions (ConceptualLayer) are implemented through specific algorithms and techniques (ProtocolLayer, MiddlewareLayer). This relationship is not always one-to-one: a single conceptual concept may have multiple implementations, and a single implementation may realize multiple conceptual properties.\n\n    - ### Design Rationale\n      - **Implementation Independence:** ConceptualLayer was designed to separate abstract understanding from technical implementation, recognizing that concepts can be understood and reasoned about independent of how they are realized. This separation serves multiple purposes: it enables theoretical research without implementation constraints, supports teaching and learning by introducing concepts before implementations, facilitates communication across specializations, and allows comparing different implementations of the same concept.\n\n      - **Theoretical Foundation:** Many blockchain and AI concepts have deep theoretical foundations in computer science, cryptography, economics, or philosophy. ConceptualLayer provides a home for these theoretical aspects: Byzantine agreement theory, fairness axioms, game-theoretic equilibria, cryptographic security definitions. This theoretical foundation is essential for rigorous understanding even if practical implementations necessarily make compromises or simplifications.\n\n      - **Design Space Exploration:** Operating at the conceptual level enables exploring design spaces and understanding tradeoffs before committing to specific implementations. For example, understanding different fairness definitions conceptually (demographic parity, equalized odds, individual fairness) and their incompatibilities helps guide the choice of which fairness notion to implement for a specific application. Understanding consensus mechanism tradeoffs conceptually (PoW's energy consumption vs security, PoS's capital efficiency vs new attack vectors, BFT's fast finality vs validator set constraints) informs consensus mechanism selection.\n\n      - **Interdisciplinary Bridge:** ConceptualLayer serves as a bridge between disciplines. Computer scientists, economists, legal scholars, and ethicists may approach blockchain or AI from different perspectives and with different implementation concerns, but they can establish shared understanding at the conceptual level. For example, \"Transparency\" means something to all these stakeholders even if they focus on different aspects (technical transparency of code, economic transparency of transactions, regulatory transparency of decision-making).\n\n      - **Evolution and Generalization:** As the field evolves, some implementation-specific concepts may be generalized to conceptual understanding. For example, Ethereum's specific gas mechanism might inspire abstract understanding of computational resource pricing in smart contract platforms, moving from implementation detail to conceptual pattern. ConceptualLayer accommodates this evolution, capturing generalizable insights from specific implementations.\n\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Metaverse platforms continue to evolve with focus on interoperability and open standards\n  - Web3 integration accelerating with decentralised identity and asset ownership\n  - Enterprise adoption growing in virtual collaboration, training, and digital twins\n  - UK companies increasingly active in metaverse development and immersive technologies\n\n- Technical capabilities\n  - Real-time rendering at photorealistic quality levels\n  - Low-latency networking enabling seamless multi-user experiences\n  - AI-driven content generation and procedural world building\n  - Spatial audio and haptics enhancing immersion\n\n- UK and North England context\n  - Manchester: Digital Innovation Factory supports metaverse startups and research\n  - Leeds: Holovis leads in immersive experiences for entertainment and training\n  - Newcastle: University research in spatial computing and interactive systems\n  - Sheffield: Advanced manufacturing using digital twin technology\n\n- Standards and frameworks\n  - Metaverse Standards Forum driving interoperability protocols\n  - WebXR enabling browser-based immersive experiences\n  - glTF and USD for 3D asset interchange\n  - Open Metaverse Interoperability Group defining cross-platform standards\n\n## Metadata\n\n- **Last Updated**: 2025-11-16\n- **Review Status**: Automated remediation with 2025 context\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable",
  "properties": {
    "id": "conceptual-layer-about",
    "collapsed": "true",
    "- ontology": "true",
    "- term-id": "mv-417666147585",
    "- preferred-term": "ConceptualLayer",
    "- source-domain": "metaverse",
    "- status": "active",
    "- public-access": "true",
    "- definition": "The ConceptualLayer represents the abstraction level of pure concepts, theoretical models, principles, and design patterns that are independent of specific technical implementations or realizations. This layer encompasses abstract definitions, conceptual frameworks, theoretical foundations, design principles, and logical models that describe what things are and what they should do, without specifying how they are implemented. Concepts in this layer are implementation-agnostic: they can be realized through various technical approaches, protocols, or systems while maintaining their essential conceptual properties. The ConceptualLayer includes abstract data structures (the concept of a blockchain as an ordered chain of blocks, independent of specific blockchain implementations), theoretical protocols (abstract consensus models, independent of specific consensus algorithms), design patterns (decentralization as a principle, independent of specific decentralization mechanisms), foundational principles (immutability, transparency, trustlessness as properties), and logical frameworks (fairness definitions, security properties, correctness criteria). This layer serves as the foundation for understanding domain concepts at their most abstract level, enabling reasoning about properties, relationships, and tradeoffs without getting entangled in implementation details.",
    "- maturity": "mature",
    "- authority-score": "0.85",
    "- owl:class": "mv:Conceptuallayer",
    "- owl:physicality": "ConceptualEntity",
    "- owl:role": "Concept",
    "- belongsToDomain": "[[MetaverseDomain]]",
    "- enables": "[[ImmersiveExperience]], [[Presence]], [[SpatialComputing]]",
    "- requires": "[[DisplayTechnology]], [[TrackingSystem]], [[RenderingEngine]]",
    "- bridges-to": "[[HumanComputerInteraction]], [[ComputerVision]], [[Robotics]]",
    "- meta-ontology": "true",
    "- classification-type": "layer",
    "- name": "ConceptualLayer",
    "- scope": "Abstract concepts, principles, theoretical models, and design patterns independent of specific implementations or technical realizations",
    "- version": "1.0.0",
    "- last-updated": "2025-11-08",
    "- purpose": "To provide a classification level for abstract concepts and theoretical models, enabling clear distinction between conceptual understanding (what something is and why it matters) and technical realization (how something is implemented), supporting both theoretical research and practical implementation by establishing clear conceptual foundations",
    "- coverage": "This layer covers approximately 105+ concepts across multiple domains including abstract blockchain concepts (blockchain entity, distributed ledger concept, decentralization principle), theoretical fairness definitions (group fairness, individual fairness, algorithmic accountability), abstract security properties (immutability, integrity, authenticity), conceptual economic models (tokenomics principles, incentive alignment theory), and foundational design patterns (trustlessness, transparency, composability)",
    "- parent-classification": "LayerHierarchy",
    "- peer-classifications": "[[SecurityLayer]], [[ProtocolLayer]], [[EconomicLayer]], [[MiddlewareLayer]], [[ApplicationLayer]]",
    "- abstraction-level": "highest",
    "- cross-cutting": "true",
    "- concept-count": "105",
    "- blockchain-concepts": "[[Blockchain]], [[Distributed Ledger]], [[Decentralization]], [[Transaction Pool]], [[Mempool]], [[BC-0020-blockchain-entity]]",
    "- ai-ethics-concepts": "[[Group vs Individual Fairness]], [[Algorithmic Accountability]], [[Fairness Metrics]], [[Fairness Constraints]], [[Intersectional Fairness]]",
    "- consensus-concepts": "[[BC-0040-consensus-mechanism]], [[BC-0058-finality]], [[BC-0066-probabilistic-finality]], [[BC-0067-deterministic-finality]]",
    "- economic-concepts": "[[Token]], [[BC-0107-tokenomics]], [[BC-0130-economic-security]], [[BC-0138-voting-power]]",
    "- security-concepts": "[[Immutability]], [[Integrity]], [[Authenticity]], [[Non-repudiation]], [[Trustlessness]]",
    "- design-patterns": "[[Decentralization]], [[Transparency]], [[Composability]], [[Interoperability]], [[Permissionlessness]]",
    "- key-ontologies": "Foundational concepts from BC, AI, and other domains that define what things are at an abstract level, independent of how they are technically realized"
  },
  "backlinks": [
    "BC-0001-blockchain",
    "Privacy By Design",
    "AI-0419-Secure-Multi-Party-Computation",
    "AI-0388-ai-ethics-board",
    "AI-0394-ai-risk-register",
    "Consensus Mechanism",
    "BC-0018-transaction-pool",
    "AI-0431-edge-ai-system",
    "AI-0411-PrivacyDataGovernance",
    "BC-0013-block-size",
    "AI Ethics Board",
    "BC-0003-block",
    "AI-0440-power-efficient-ai",
    "Secure Multi-Party Computation",
    "Technology Adoption",
    "AI-0425-privacy-impact-assessment",
    "Responsible AI Principles",
    "Chain Reorganization",
    "AI-0384-intersectional-fairness",
    "Transaction Confirmation",
    "AI-0392-ai-documentation-standards",
    "Blockchain Entity",
    "AI-0407-TrustworthyAIFramework",
    "AI-0427-pseudonymisation",
    "Trustworthy AI Framework",
    "Block Height",
    "Traceability Mechanism",
    "AI-0429-gdpr-article-22-compliance",
    "EconomicLayer",
    "BC-0022-output",
    "AI-0443-knowledge-distillation-edge",
    "AI-0386-fairness-auditing-tools",
    "BC-0009-smart-contract",
    "AI-0436-edge-cloud-collaboration",
    "Intersectional Fairness",
    "Privacy Impact Assessment",
    "Ethical Framework",
    "Model Compression for Edge (AI-0434)",
    "AI-0385-fairness-accuracy-tradeoffs",
    "Edge AI for Smart Cities (AI-0447)",
    "Bias Detection Methods",
    "AI-0409-HumanAgencyOversight",
    "Privacy Preserving Data Mining",
    "AI-0444-embedded-ai-frameworks",
    "Chain State",
    "Transaction",
    "AI-0417-Federated-Learning",
    "Group vs Individual Fairness",
    "AI-0378-algorithmic-bias",
    "Latency-Aware Edge AI (AI-0446)",
    "BC-0004-block-header",
    "Cryptographic System",
    "Power-Efficient AI (AI-0440)",
    "AI Impact Assessment",
    "Edge AI Accelerators (AI-0441)",
    "AI-0414-SocietalEnvironmentalWellbeing",
    "AI-0382-fairness-constraints",
    "Distributed Protocol",
    "UTXO Model",
    "BC-0023-script",
    "Account Model",
    "Orphan Block",
    "Fault Tolerance System",
    "BC-0016-orphan-block",
    "AI-0377-fairness-metrics",
    "BC-0015-chain-reorganization",
    "Embedded AI Frameworks (AI-0444)",
    "AI-0424-confidential-computing",
    "Societal and Environmental Wellbeing",
    "Real-Time Inference at Edge (AI-0439)",
    "AI-0446-latency-aware-edge-ai",
    "BC-0010-decentralization",
    "BC-0024-opcodes",
    "Ethical Review Process",
    "Algorithmic Transparency Reports",
    "Fairness Accuracy Tradeoffs",
    "AI-0437-federated-edge-learning",
    "Block",
    "AI-0420-Privacy-Budget-Management",
    "Block Reward",
    "Pseudonymisation",
    "ProtocolLayer",
    "Mempool",
    "AI-0445-edge-ai-security",
    "Block Header",
    "AI Governance Maturity Model",
    "UNESCO Recommendation on the Ethics of AI",
    "BC-0007-utxo-model",
    "AI Risk Register",
    "BC-0020-transaction-confirmation",
    "Federated Learning",
    "Distributed Data Structure",
    "AI-0376-algorithmic-accountability",
    "IoT AI Integration (AI-0438)",
    "Input",
    "AI-0432-tinyml",
    "Decentralization",
    "Transparency and Explainability",
    "Data Minimisation",
    "AI-0379-bias-detection-methods",
    "Confidential Computing",
    "Bias Mitigation Techniques",
    "AI-0395-algorithmic-transparency-reports",
    "Regulatory Compliance",
    "AI-0389-responsible-ai-principles",
    "Technical Robustness and Safety",
    "AI-0387-ai-governance-framework",
    "Redress Procedure",
    "BC-0025-chain-state",
    "Knowledge Distillation for Edge (AI-0443)",
    "AI-0393-ethical-review-process",
    "Agreement Protocol",
    "AI-0381-disparate-impact",
    "AI-0423-privacy-preserving-data-mining",
    "AI-0396-ai-governance-maturity-model",
    "AI-0442-model-pruning-edge",
    "AI-0441-edge-ai-accelerators",
    "BC-0002-distributed-ledger",
    "Differential Privacy",
    "Edge AI System (AI-0431)",
    "AI Trustworthiness Dimensions",
    "AI-0426-data-minimisation",
    "AI-0380-bias-mitigation-techniques",
    "AI-0416-Differential-Privacy",
    "Bitcoin",
    "MiddlewareLayer",
    "Algorithmic Bias",
    "Fairness Metrics",
    "AI-0413-DiversityNonDiscriminationFairness",
    "BC-0017-timestamp",
    "Economic Mechanism",
    "AI-0438-iot-ai-integration",
    "Diversity, Non-Discrimination, and Fairness",
    "AI Documentation Standards",
    "Privacy Budget Management",
    "GDPR Article 22 Compliance",
    "AI-0418-Homomorphic-Encryption-ML",
    "BC-0006-transaction",
    "Stakeholder Engagement in AI",
    "Model Pruning for Edge Deployment (AI-0442)",
    "AI-0439-real-time-inference-edge",
    "BC-0012-block-reward",
    "Privacy Utility Tradeoffs",
    "AI-0430-privacy-utility-tradeoffs",
    "AI-0448-UNESCORecommendationEthicsAI",
    "Human Agency and Oversight",
    "Opcodes",
    "Neural Network Quantisation (AI-0435)",
    "On-Device Learning (AI-0433)",
    "Block Time",
    "AI-0391-stakeholder-engagement-ai",
    "AI-0434-model-compression-edge",
    "AI-0408-AITrustworthinessDimensions",
    "AI Governance Principle",
    "Output",
    "Value Transfer",
    "BC-0019-mempool",
    "Timestamp",
    "AI-0415-IEEE7000SeriesStandards",
    "Edge AI Security (AI-0445)",
    "TokenEconomicsDomain",
    "Fairness-Auditing-Tools",
    "AI-0383-group-vs-individual-fairness",
    "Edge-Cloud Collaboration (AI-0436)",
    "AI-0390-ai-impact-assessment",
    "Genesis Block",
    "Disparate Impact",
    "BC-0014-block-time",
    "BC-0005-genesis-block",
    "Accountable Party",
    "AI-0422-synthetic-data-generation",
    "AI-0410-TechnicalRobustnessSafety",
    "Block Size",
    "Fairness Constraints",
    "Algorithmic Accountability",
    "AI-0433-on-device-learning",
    "Privacy and Data Governance",
    "Synthetic Data Generation",
    "BC-0021-input",
    "k-Anonymity in Datasets",
    "Fairness Auditing Tools",
    "AI-0428-privacy-by-design",
    "Federated Edge Learning (AI-0437)",
    "TinyML (Machine Learning on Microcontrollers) (AI-0432)",
    "AI-0435-neural-network-quantization",
    "Transaction Pool",
    "AI-0447-edge-ai-smart-cities",
    "AI-0421-k-Anonymity-Datasets",
    "AI-0412-TransparencyExplainability",
    "BC-0011-block-height",
    "BC-0008-account-model"
  ],
  "wiki_links": [
    "BC-0138-voting-power",
    "Non-repudiation",
    "RenderingEngine",
    "Integrity",
    "Interoperability",
    "Mempool",
    "Immutability",
    "Robotics",
    "HumanComputerInteraction",
    "Group vs Individual Fairness",
    "Intersectional Fairness",
    "SecurityLayer",
    "Permissionlessness",
    "BC-0067-deterministic-finality",
    "Authenticity",
    "Presence",
    "BC-0107-tokenomics",
    "Fairness Metrics",
    "Token",
    "Composability",
    "ImmersiveExperience",
    "ComputerVision",
    "Transparency",
    "ProtocolLayer",
    "SpatialComputing",
    "BC-0130-economic-security",
    "ApplicationLayer",
    "Distributed Ledger",
    "EconomicLayer",
    "Decentralization",
    "Fairness Constraints",
    "DisplayTechnology",
    "Algorithmic Accountability",
    "Trustlessness",
    "BC-0020-blockchain-entity",
    "TrackingSystem",
    "BC-0058-finality",
    "MiddlewareLayer",
    "BC-0066-probabilistic-finality",
    "BC-0040-consensus-mechanism",
    "Blockchain",
    "Transaction Pool",
    "MetaverseDomain"
  ],
  "ontology": {
    "term_id": "mv-417666147585",
    "preferred_term": "ConceptualLayer",
    "definition": "A component of the metaverse ecosystem focusing on conceptuallayer.",
    "source_domain": "metaverse",
    "maturity_level": null,
    "authority_score": 0.85
  }
}