{
  "title": "Contracts and jobs",
  "content": "- ### OntologyBlock\n  id:: contracts-and-jobs-ontology\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: mv-719890909449\n\t- preferred-term:: Contracts and jobs\n\t- source-domain:: metaverse\n\t- status:: active\n\t- public-access:: true\n\t- definition:: A component of the metaverse ecosystem focusing on contracts and jobs.\n\t- maturity:: mature\n\t- authority-score:: 0.85\n\t- owl:class:: mv:ContractsAndJobs\n\t- owl:physicality:: ConceptualEntity\n\t- owl:role:: Concept\n\t- belongsToDomain:: [[MetaverseDomain]]\n\t- #### Relationships\n\t  id:: contracts-and-jobs-relationships\n\t\t- enables:: [[ImmersiveExperience]], [[Presence]], [[SpatialComputing]]\n\t\t- requires:: [[DisplayTechnology]], [[TrackingSystem]], [[RenderingEngine]]\n\t\t- bridges-to:: [[HumanComputerInteraction]], [[ComputerVision]], [[Robotics]]\n\n\t- #### OWL Axioms\n\t  id:: contracts-and-jobs-owl-axioms\n\t  collapsed:: true\n\t\t- ```clojure\n\t\t  Declaration(Class(mv:ContractsAndJobs))\n\n\t\t  # Classification\n\t\t  SubClassOf(mv:ContractsAndJobs mv:ConceptualEntity)\n\t\t  SubClassOf(mv:ContractsAndJobs mv:Concept)\n\n\t\t  # Domain classification\n\t\t  SubClassOf(mv:ContractsAndJobs\n\t\t    ObjectSomeValuesFrom(mv:belongsToDomain mv:MetaverseDomain)\n\t\t  )\n\n\t\t  # Annotations\n\t\t  AnnotationAssertion(rdfs:label mv:ContractsAndJobs \"Contracts and jobs\"@en)\n\t\t  AnnotationAssertion(rdfs:comment mv:ContractsAndJobs \"A component of the metaverse ecosystem focusing on contracts and jobs.\"@en)\n\t\t  AnnotationAssertion(dcterms:identifier mv:ContractsAndJobs \"mv-719890909449\"^^xsd:string)\n\t\t  ```\n\n- [Job Hunt as a PhD in AI / ML / RL: How it Actually Happens (natolambert.com)](https://www.natolambert.com/writing/ai-phd-job-hunt)\n- [University Fellow - School of Health & Society - University of Salford VX (tal.net)](https://universityofsalford.tal.net/vx/mobile-1/appcentre-ext/brand-4/candidate/so/pm/1/pl/3/opp/1349-University-Fellow-School-of-Health-Society/en-GB)\n-\n- # DSIT Civil Service Role\n\t- **Optimise public R&D investment to support areas of relative UK strength and increase the level of private R&D to make our economy the most innovative in the world.**\n\t- Promote a diverse research and innovation system that connects discovery to new companies, growth and jobs – including by delivering world-class physical and digital infrastructure (such as gigabit broadband), making the UK the best place to start and grow a technology business and developing and attracting top talent.\n\t- Put public services – including the NHS and schools – at the forefront of innovation, championing new ways of working and the development of in-house STEM capability to improve outcomes for people.\n\t- Strengthen international collaboration on science and technology in line with the Integrated Review, and ensure our researchers are able to continue to work with leading scientists in Europe and around the world.\n\t- Deliver legislative and regulatory reforms to drive competition and promote innovation, including the Data Protection and Digital Information Bill, the Digital Markets, Competition and Consumer Bill and our pro-innovation approach to regulating AI.\n\t- Please note that DSIT are currently reviewing our terms and conditions and pay arrangements following Machinery of Government changes and as part of the outstanding August 2023 pay award. Please be aware that there may be changes to the terms and conditions and pay ranges listed in this advert ahead of you starting in post. Any changes would be implemented in early 2024.\n\t- ## Job Description\n\t\t- **The Centre for Data Ethics and Innovation (CDEI) guides and supports organisations to innovate responsibly, helping the UK maximise the benefits of data-driven technology. The Centre provides support to a wide range of public and private sector organisations around four programmes:\n\t\t- Responsible Data Access: Facilitate responsible data access, including piloting new technical tools, forms of data stewardship and governance, and promote the development and adoption of novel privacy-enhancing technologies.\n\t\t- Algorithmic Transparency: Enable greater algorithmic transparency. For example, co-owning the Government’s Algorithmic Transparency Recording Standard to help public sector organisations provide clear information about the algorithmic tools they use.\n\t\t- AI Assurance: Enable the development of a strong AI assurance ecosystem in the UK, helping organisations have confidence to innovate responsibly, and fostering an emerging AI assurance industry. For example, developing and delivering a roadmap for a world-class AI assurance ecosystem.\n\t\t- Strategic Projects: Support and facilitate the responsible use of data and AI across the public sector. For example, working with the Ministry of Defence on the responsible use of AI in defence.\n\t\t- Our goal is to support partners in enabling and delivering responsible innovation in data-driven technology, creating an environment in which the public are confident their values are reflected in the way data-driven technology is developed and deployed; citizens can trust that decisions informed by algorithms are fair; and the risks posed by innovation are identified and addressed.\n\t\t- We are seeking two Senior Technology Advisors to provide expert technical input in support of this mission. These are exciting and varied roles for technologists with an interest in ethics or policy to provide technical expertise and thought leadership to across a range of CDEI's work.\n\t\t- To support our current work programme, and complement our existing team, we are most interested in technical expertise in privacy enhancing technologies and machine learning.\n\t\t- The successful candidates will get involved in a range of CDEI projects, taking a lead on some technically led work (e.g. an ongoing Privacy Enhancing Technology pilot project), but also providing advice and guidance to projects led by others. We are looking for individuals who are able to bring a range of existing technical expertise on data & AI into CDEI, but also have the flexibility and curiosity to apply their skills to new areas.\n\t- ## Person specification\n\t\t- Offering expert technical advice and feedback to colleagues and external partners, applying your technical expertise to support delivery of strategic objectives.\n\t\t- Leading projects\n\t\t- Responsible for the successful delivery of technically focused projects from start to finish, ensuring they are completed on time and to a high standard.\n\t\t- Engaging with partners\n\t\t- Forming close working relationships with our partners, and fostering valuable connections to industry, government, and civil society.\n\t\t- Championing the CDEI’s expertise\n\t\t- Communicating the findings of our project work to a wider audience, including through reports, briefings, and speaking engagements.\n\t\t- Capturing insights\n\t\t- Considering how findings from particular projects can be applied elsewhere to support other organisations to use data and AI responsibly.\n\t\t- Contributing to CDEI and DSIT’s broader objectives\n\t\t- taking time out of day to day duties to ensure the CDEI, and DSIT more broadly, are inclusive and purposeful place to work, delivering our overall strategic objectives.\n\t\t- The specific project responsibilities will vary over time. Initially, a successful candidate with expertise in privacy technologies is likely to focus primarily on technical leadership for CDEI’s ongoing PETs pilot project (run jointly with the US government and a range of healthcare partners), while a candidate with machine learning focused expertise is likely to focus on supporting CDEI’s AI Assurance and Algorithmic Transparency, as well as advising a range of public sector delivery projects.\n\t- ## Skills And Experience\n\t\t- We would love to hear from you if you have:\n\t\t- Technical experience in at least one of:\n\t\t- Privacy engineering solutions, using technologies such as federated learning, homomorphic encryption, secure enclaves, secure multi-party computation, differential privacy.\n\t\t- Machine learning solutions, using modern machine learning techniques in any sector or use case.\n\t\t- Excellent verbal and written communication skills, especially the ability to communicate complex technical concepts to non-expert audiences.\n\t\t- An interest in the broader risks and opportunities posed by data and AI, and an ability to make connections between technical issues and wider policy considerations.\n\t\t- The capability to work independently under own initiative, guiding the work of others, and collaborate effectively with a range of partners.\n\t\t- We do not have a fixed set of career experience in mind. Your previous role might have been a similar technology advisory role, but could have been as a data scientist, technical/data/security architect, technical product owner or other similar role. You might evidence the technical expertise necessary through a mixture of work experience and/or relevant academic or professional qualifications.\n\t\t- The roles are available on a permanent basis, and we are happy to discuss options for part time or flexible working. For existing civil servants, we are also open to discuss a fixed term loan if that is a better fit for a successful candidate.\n\t- ## Benefits\n\t\t- Alongside your salary of £50,305, Department for Science, Innovation & Technology contributes £13,582 towards you being a member of the Civil Service Defined Benefit Pension scheme. Find out what benefits a Civil Service Pension provides.\n\t\t- The Department for Science, Innovation and Technology offers a competitive mix of benefits including:\n\t\t- A culture of flexible working, such as job sharing, homeworking and compressed hours.\n\t\t- Automatic enrolment into the Civil Service Pension Scheme , with an average employer contribution of 27%.\n\t\t- A minimum of 25 days of paid annual leave, increasing by 1 day per year up to a maximum of 30.\n\t\t- An extensive range of learning & professional development opportunities, which all staff are actively encouraged to pursue.\n\t\t- Access to a range of retail, travel and lifestyle employee discounts.\n\t\t- A hybrid office/home based working model where staff will spend a norm of 40-60% of their time in the office (minimum of 40%) over a month with flex dependent on balancing business and individual need.\n\t- ## Office attendance\n\t\t- The Department operates a discretionary Hybrid Working policy, which enables a combination of working hours from your place of work and from your home in the UK. The current expectation for staff is to attend the office or non-home based location for 40-60% of the time.\n-\n- # Covering letters\n- ```GPT\n  Dr. John O’Hare\n  53 Barton Road\n  Manchester, M32 9FA\n  +447973543825\n  john@xrsystems.uk\n  \n  [Date]\n  \n  Hiring Manager\n  The Science and Technology Facilities Council (STFC)\n  Hartree Centre\n  [Address]\n  \n  Dear Hiring Manager,\n  \n  I am writing to express my interest in the Artificial Intelligence position at the Hartree Centre, as advertised. With a PhD in tele-presence collaboration and extensive experience in R&D, specifically within AI/ML, mixed reality, and virtual environments, I am excited about the opportunity to contribute to cutting-edge research alongside world-class scientists and engineers.\n  \n  At Neocadia LLC and Flossverse Ltd., I spearheaded projects that push the boundaries of generative AI, leveraging my deep understanding of machine learning, hardware integration, and high-end visualization to drive innovation. My role as R&D Lead at PATHWAYXR STUDIO honed my skills in developing AI solutions for complex problems, often utilizing supercomputing resources similar to those at Hartree. This experience aligns with the duties outlined for your role, including project planning, AI solution development, and continuing professional development in AI techniques.\n  \n  My academic background, coupled with my leadership in securing significant grants and publishing influential research, demonstrates my capability to lead and innovate in scientific and technological domains. I am particularly drawn to the Hartree Centre’s commitment to exploring unknown territories in Big Science, aligning with my career-long pursuit of transformative research that impacts society positively.\n  \n  I am keen to bring my expertise in AI, deep learning, and scientific research to the Hartree Centre, contributing to the advancement of knowledge and the development of AI solutions that address real-world challenges. I look forward to the opportunity to discuss how my background, skills, and enthusiasms can be of value to your team.\n  \n  Thank you for considering my application. I am looking forward to the possibility of contributing to the groundbreaking work at the Hartree Centre.\n  \n  Warm regards,\n  \n  Dr. John O’Hare\n  \n  Dr. John O’Hare\n  53 Barton Road\n  Manchester, M32 9FA\n  +447973543825\n  john@xrsystems.uk\n  [Date]\n  \n  Hiring Manager\n  The Artificial Intelligence Group\n  Hartree Centre\n  [Company Address]\n  \n  Dear Hiring Manager,\n  \n  I am writing to express my interest in the position within the Artificial Intelligence group at Hartree, as advertised. With a robust background in scientific research, particularly in the realms of virtual reality, machine learning, and large-scale system integration, I am excited about the opportunity to contribute to your team’s pioneering efforts in deep learning, natural language processing, and computer vision.\n  \n  My recent role as CTO for Neocadia LLC and Co-Founder of Flossverse Ltd. has honed my skills in AI/ML operations, product research, and development in generative AI, aligning closely with the duties and technological frontiers explored by your team. Leading the R&D efforts at PathwayXR Studio, I spearheaded projects that integrated machine learning into distributed web and metaverse environments, demonstrating my capacity to adapt AI solutions to complex systems—a key requirement of the role.\n  \n  My academic foundation, with a PhD focused on tele-presence and an MSc in Virtual Environments from the University of Salford, underpins my solid understanding of applied mathematics and its applications in AI and Machine Learning. This educational background, combined with my leadership in securing significant research funding and leading innovative projects, showcases my ability to meet the scientific rigor and project management expectations of the position.\n  \n  I am particularly drawn to the opportunity at Hartree due to its commitment to pushing the boundaries of scientific inquiry and its collaborative environment that aligns with my experience as a team player and leader. My career has been dedicated to exploring the unknown and leveraging technology to solve real-world problems, mirroring the ethos of your organization.\n  \n  I am enthusiastic about the possibility of joining Hartree to further its mission of employing cutting-edge AI to address societal challenges. I look forward to the opportunity to discuss how my background, skills, and enthusiasms align with the needs of your team.\n  \n  Thank you for considering my application. I am keen to bring my expertise in scientific research and AI to Hartree and contribute to the impactful work being done at your facilities.\n  \n  Sincerely,\n  \n  Dr. John O’Hare\n  \n  ```\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Metaverse platforms continue to evolve with focus on interoperability and open standards\n  - Web3 integration accelerating with decentralised identity and asset ownership\n  - Enterprise adoption growing in virtual collaboration, training, and digital twins\n  - UK companies increasingly active in metaverse development and immersive technologies\n\n- Technical capabilities\n  - Real-time rendering at photorealistic quality levels\n  - Low-latency networking enabling seamless multi-user experiences\n  - AI-driven content generation and procedural world building\n  - Spatial audio and haptics enhancing immersion\n\n- UK and North England context\n  - Manchester: Digital Innovation Factory supports metaverse startups and research\n  - Leeds: Holovis leads in immersive experiences for entertainment and training\n  - Newcastle: University research in spatial computing and interactive systems\n  - Sheffield: Advanced manufacturing using digital twin technology\n\n- Standards and frameworks\n  - Metaverse Standards Forum driving interoperability protocols\n  - WebXR enabling browser-based immersive experiences\n  - glTF and USD for 3D asset interchange\n  - Open Metaverse Interoperability Group defining cross-platform standards\n\n## Metadata\n\n- **Last Updated**: 2025-11-16\n- **Review Status**: Automated remediation with 2025 context\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable",
  "properties": {
    "id": "contracts-and-jobs-owl-axioms",
    "collapsed": "true",
    "- ontology": "true",
    "- term-id": "mv-719890909449",
    "- preferred-term": "Contracts and jobs",
    "- source-domain": "metaverse",
    "- status": "active",
    "- public-access": "true",
    "- definition": "A component of the metaverse ecosystem focusing on contracts and jobs.",
    "- maturity": "mature",
    "- authority-score": "0.85",
    "- owl:class": "mv:ContractsAndJobs",
    "- owl:physicality": "ConceptualEntity",
    "- owl:role": "Concept",
    "- belongsToDomain": "[[MetaverseDomain]]",
    "- enables": "[[ImmersiveExperience]], [[Presence]], [[SpatialComputing]]",
    "- requires": "[[DisplayTechnology]], [[TrackingSystem]], [[RenderingEngine]]",
    "- bridges-to": "[[HumanComputerInteraction]], [[ComputerVision]], [[Robotics]]"
  },
  "backlinks": [
    "Silo AI",
    "Valsoft"
  ],
  "wiki_links": [
    "TrackingSystem",
    "ImmersiveExperience",
    "ComputerVision",
    "RenderingEngine",
    "SpatialComputing",
    "Robotics",
    "HumanComputerInteraction",
    "MetaverseDomain",
    "DisplayTechnology",
    "Presence"
  ],
  "ontology": {
    "term_id": "mv-719890909449",
    "preferred_term": "Contracts and jobs",
    "definition": "A component of the metaverse ecosystem focusing on contracts and jobs.",
    "source_domain": "metaverse",
    "maturity_level": null,
    "authority_score": 0.85
  }
}