{
  "title": "Cyber security and Cryptography",
  "content": "- ### OntologyBlock\n  id:: cyber-security-and-cryptography-ontology\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: mv-175087123330\n\t- preferred-term:: Cyber security and Cryptography\n\t- source-domain:: metaverse\n\t- status:: active\n\t- public-access:: true\n\t- definition:: A component of the metaverse ecosystem focusing on cyber security and cryptography.\n\t- maturity:: mature\n\t- authority-score:: 0.85\n\t- owl:class:: mv:CyberSecurityAndCryptography\n\t- owl:physicality:: ConceptualEntity\n\t- owl:role:: Concept\n\t- belongsToDomain:: [[MetaverseDomain]]\n\t- #### Relationships\n\t  id:: cyber-security-and-cryptography-relationships\n\t\t- enables:: [[ImmersiveExperience]], [[Presence]], [[SpatialComputing]]\n\t\t- requires:: [[DisplayTechnology]], [[TrackingSystem]], [[RenderingEngine]]\n\t\t- bridges-to:: [[HumanComputerInteraction]], [[ComputerVision]], [[Robotics]]\n\n\t- #### OWL Axioms\n\t  id:: cyber-security-and-cryptography-owl-axioms\n\t  collapsed:: true\n\t\t- ```clojure\n\t\t  Declaration(Class(mv:CyberSecurityAndCryptography))\n\n\t\t  # Classification\n\t\t  SubClassOf(mv:CyberSecurityAndCryptography mv:ConceptualEntity)\n\t\t  SubClassOf(mv:CyberSecurityAndCryptography mv:Concept)\n\n\t\t  # Domain classification\n\t\t  SubClassOf(mv:CyberSecurityAndCryptography\n\t\t    ObjectSomeValuesFrom(mv:belongsToDomain mv:MetaverseDomain)\n\t\t  )\n\n\t\t  # Annotations\n\t\t  AnnotationAssertion(rdfs:label mv:CyberSecurityAndCryptography \"Cyber security and Cryptography\"@en)\n\t\t  AnnotationAssertion(rdfs:comment mv:CyberSecurityAndCryptography \"A component of the metaverse ecosystem focusing on cyber security and cryptography.\"@en)\n\t\t  AnnotationAssertion(dcterms:identifier mv:CyberSecurityAndCryptography \"mv-175087123330\"^^xsd:string)\n\t\t  ```\n\npublic:: true\n\n- # Cyber security and cryptography are coproximate.\n\t- ## Case Study: CrowdStrike Global Outage\n\t\t- ### Fallout and Disruptions\n\t\t\t- The recent CrowdStrike global outage had far-reaching effects across various sectors:\n\t\t\t\t- **Air Travel**: Major disruptions occurred, with Sydney Airport and Virgin Australia reporting a \"complete ground stop\" due to the outage ([Reuters](https://www.reuters.com/technology/global-cyber-outage-grounds-flights-hits-media-financial-telecoms-2024-07-19/)).\n\t\t\t\t- **Banks and Finance**: Institutions such as Bendigo Bank, ANZ, Commonwealth Bank, and Bank of Queensland faced significant issues, evidenced by numerous user reports on Downdetector ([AP News](https://apnews.com/live/internet-global-outage-crowdstrike-microsoft-downtime)).\n\t\t\t\t- **Healthcare**: Hospitals and Australian government agencies, including Centrelink and MyGov, were impacted ([Al Jazeera](https://www.aljazeera.com/news/2024/7/20/slow-recovery-after-crowdstrike-update-sparks-global-it-outage)).\n\t\t\t\t- **Media**: Networks of multiple media organizations, including the ABC, SBS, Channel 7, Channel 9, and News Corp Australia, were disrupted ([Reuters](https://www.reuters.com/technology/global-cyber-outage-grounds-flights-hits-media-financial-telecoms-2024-07-19/)).\n\t\t\t\t- **Retail**: Retail outlets experienced difficulties in processing electronic payments, affecting shoppers' experiences ([AP News](https://apnews.com/live/internet-global-outage-crowdstrike-microsoft-downtime)).\n\t\t- ### Technical Reasons\n\t\t\t- The outage was traced to a specific defect in a content update for Windows hosts:\n\t\t\t\t- **Falcon Sensor Issue**: The update led to blue screen errors and crashes on Windows systems, while Mac and Linux hosts remained unaffected ([CrowdStrike Blog](https://www.crowdstrike.com/blog/statement-on-falcon-content-update-for-windows-hosts/)).\n\t\t\t\t- **Channel File Problem**: The channel file \"C-00000291*.sys\" with a timestamp of 0409 UTC was identified as the culprit. A reverted version with a timestamp of 0527 UTC was deployed to rectify the issue ([CrowdStrike Blog](https://www.crowdstrike.com/blog/statement-on-falcon-content-update-for-windows-hosts/)).\n\t- ### Postulated Bad Actors\n\t\t- Despite the technical nature of the outage, there were concerns about potential exploitation:\n\t\t- **Potential Exploitation**: CrowdStrike CEO George Kurtz highlighted that \"bad actors will try to exploit events like this,\" underscoring the persistent challenges in cybersecurity, especially with Microsoft systems ([Al Jazeera](https://www.aljazeera.com/news/2024/7/20/slow-recovery-after-crowdstrike-update-sparks-global-it-outage)).\n\t- ### Hypothetical Technical Reasons\n\t\t- The root cause was linked to a recent global rollout of a tech update from CrowdStrike, which contained the problematic channel file ([CrowdStrike Blog](https://www.crowdstrike.com/blog/statement-on-falcon-content-update-for-windows-hosts/)).\n\t- ### Possible Economic Fallout\n\t\t- The outage had significant economic repercussions:\n\t\t\t- **Global Impact**: Described as the \"largest IT outage in history,\" the incident had widespread economic implications across various sectors ([Reuters](https://www.reuters.com/technology/global-cyber-outage-grounds-flights-hits-media-financial-telecoms-2024-07-19/)).\n\t\t\t- **Financial Services**: Disruptions in financial services and general practitioners' offices led to losses and transaction delays ([AP News](https://apnews.com/live/internet-global-outage-crowdstrike-microsoft-downtime)).\n\t\t\t- **Stock Market Impact**: Shares of CrowdStrike and Microsoft experienced declines in premarket trading following the outage ([Reuters](https://www.reuters.com/technology/global-cyber-outage-grounds-flights-hits-media-financial-telecoms-2024-07-19/)).\n\t- ### Response\n\t\t- CrowdStrike provided detailed workaround steps to mitigate the issue:\n\t\t\t- **Workaround Steps**: Instructions included rebooting hosts, deleting problematic files, and rolling back to previous snapshots ([CrowdStrike Blog](https://www.crowdstrike.com/blog/statement-on-falcon-content-update-for-windows-hosts/)).\n\t\t\t- **AWS and Azure Environments**: Specific guidance was provided for these environments to address the issue effectively ([CrowdStrike Blog](https://www.crowdstrike.com/blog/statement-on-falcon-content-update-for-windows-hosts/)).\n\t- ## Broader Implications for Cyber Security\n\t- ### AI Risks and Mitigations\n\t\t- The increasing integration of AI in various domains presents new security challenges:\n\t\t\t- **Malicious AI Models**: Instances of AI models with backdoors, such as those found on [Hugging Face](https://www.bleepingcomputer.com/news/security/malicious-ai-models-on-hugging-face-backdoor-users-machines/), demonstrate the need for vigilant security measures.\n\t\t\t- **Adversarial Machine Learning**: Understanding attacks and mitigations is crucial, as outlined in the NIST publication [\"Adversarial Machine Learning: A Taxonomy and Terminology of Attacks and Mitigations\"](https://csrc.nist.gov/pubs/ai/100/2/e2023/final).\n\t- ### Enhancing Cybersecurity Measures\n\t\t- Given the evolving threat landscape, enhancing cybersecurity measures is imperative:\n\t\t\t- **Infrastructure Vulnerabilities**: The CrowdStrike incident highlights the vulnerabilities in digital infrastructure and the need for robust cybersecurity practices ([Reuters](https://www.reuters.com/technology/global-cyber-outage-grounds-flights-hits-media-financial-telecoms-2024-07-19/)).\n\t\t\t- **Dependency on Technology Providers**: Reevaluating dependencies on specific providers and adopting more resilient design principles can mitigate the risks of large-scale outages ([Al Jazeera](https://www.aljazeera.com/news/2024/7/20/slow-recovery-after-crowdstrike-update-sparks-global-it-outage)).\n- [Open Generative AI tools](https://github.com/AbdBarho/stable-diffusion-webui-docker)\n\t- - [[]]The GitHub repository \"AbdBarho/stable-diffusion-webui-docker\" offers an easy Docker setup for Stable Diffusion, featuring a user-friendly UI.\n\t- Users can run Stable Diffusion on their machines with a nice UI without hassle.\n\t- The repository provides multiple UI options for stable diffusion, including AUTOMATIC1111 and ComfyUI.\n\t- Contributions to the project are welcome after creating a discussion about the problem and proposed contribution.\n\t- The authors disclaim responsibility for any content generated using the interface, outlining restrictions in the license.\n\t- Special thanks are extended to contributors of projects like AUTOMATIC1111/stable-diffusion-webui and Sygil-webui.\n\t- The project is based on topics like Docker, PyTorch, Gradio, Docker-compose, and Stable Diffusion.\n- [Adversarial Machine Learning: A Taxonomy and Terminology of Attacks and Mitigations](https://csrc.nist.gov/pubs/ai/100/2/e2023/final)\n\t- [[]]The web page discusses the NIST Trustworthy and Responsible AI report on adversarial machine learning (AML). Here is a summary based on the provided content:\n\t- The report develops a taxonomy and terminology in the field of AML, surveying literature to build a conceptual hierarchy.\n\t\t- Includes key ML methods, lifecycle stages of attacks, attacker goals, and capabilities in the learning process.\n\t\t- Provides methods for mitigating attacks and identifies open challenges for AI system security.\n\t- The terminology aligns with AML literature and includes a glossary for non-experts to define key terms.\n\t- Aims to inform standards and practice guides for assessing and managing AI system security.\n\t- Keywords: artificial intelligence, machine learning, attack taxonomy, evasion, data poisoning, privacy breach, attack mitigation, chatbot, generative models, trojan attack, backdoor attack.\n\t- Topics: Security and Privacy (advanced persistent threats, botnets, information sharing, intrusion detection & prevention, malware), Technologies (artificial intelligence).\n\t  \n\t  If you need further assistance or a specific focus on any aspect, feel free to ask.\n- [Here Come the AI Worms](https://www.wired.com/story/here-come-the-ai-worms/)\n- - [[]]Advances in generative AI systems like OpenAI's ChatGPT and Google's Gemini are leading to the creation of AI worms capable of spreading between systems, potentially stealing data or deploying malware.\n\t- Researchers have demonstrated the first generative AI worm, Morris II, which targets email assistants using ChatGPT and Gemini, showing how these worms can exploit vulnerabilities.\n\t- The worms are created using self-replicating prompts that exploit the AI systems' responses, similar to traditional cyberattack methods like SQL injection and buffer overflow.\n\t- Security experts warn that the future risk of generative AI worms is significant, especially when AI applications are given autonomy to perform actions on behalf of users.\n\t- Recommendations include implementing traditional security measures, monitoring AI outputs, and ensuring human oversight to prevent harmful actions.\n\t- Developers are advised to be vigilant and consider potential risks and security flaws in AI ecosystem designs, as generative AI worms could pose a serious threat to data security.\n\t  \n\t  The web page discusses the rise of generative AI systems and the emerging threat of AI worms that exploit vulnerabilities in these systems for malicious purposes, highlighting the importance of robust security measures and human oversight in AI development.\n- [Check your IP address & website security](https://checkcybersecurity.service.ncsc.gov.uk/ip-check)\n- [[]]Unable to access or summarize the content at [https://checkcybersecurity.service.ncsc.gov.uk/ip-check](https://checkcybersecurity.service.ncsc.gov.uk/ip-check)\n- [Stealing Part of a Production Language Model](https://huggingface.co/papers/2403.06634)\n- - [[]]The paper arXiv:2403.06634 discusses a model-stealing attack capable of extracting specific information from black-box production language models, such as OpenAI's ChatGPT and Google's PaLM-2.\n- The attack can reveal the embedding projection layer of a transformer model and has successfully extracted the entire projection matrix of OpenAI's Ada and Babbage language models at a low cost.\n- The research reveals hidden dimensions of 1024 and 2048 for the mentioned black-box models and estimates the cost of extracting the projection matrix of the gpt-3.5-turbo model.\n- The paper also proposes potential defenses and mitigations against such attacks and discusses future implications of extending this attack method.\n- [GitHub: llm-hacking-database](https://github.com/pdparchitect/llm-hacking-database)\n- - [[]]The GitHub repository pdparchitect/llm-hacking-database focuses on attacks against Large Language Models (LLMs) and provides techniques for hacking/jailbreaking LLMs. Some attack types include context exhaustion, code introspection, prompt leaking, character override, emotional recall, living off the land (LOTL), parameter bombing, injection, poisoning, fault tolerance testing, and kill switch considerations.\n- Examples of jailbreaking tactics are outlined, including exploiting applications like a password guessing game, leak identification in chat platforms, and injection attacks using file names.\n- Defence strategies mentioned involve fine-tuning LLMs and prompt-leak detection to mitigate vulnerabilities.\n- Contributions to the repository are encouraged through pull requests, and the repository aims to compile jailbreaking techniques for LLMs akin to other notable security databases like the Google Hacking Database and RSnake's XSS Cheat Sheet.\n- Docker version of [[Open Generative AI tools]] for Linux [AbdBarho/stable-diffusion-webui-docker: Easy Docker setup for Stable Diffusion with user-friendly UI (github.com)](https://github.com/AbdBarho/stable-diffusion-webui-docker)\n- - [[]]The web page is about the AbdBarho/stable-diffusion-webui-docker repository, providing an easy Docker setup for Stable Diffusion with a user-friendly UI.\n\t- Users can run Stable Diffusion on their machine with a nice UI hassle-free.\n\t- Features multiple UIs for stable diffusion, including AUTOMATIC1111 and ComfyUI.\n\t- Contributors are welcome but need to adhere to the license restrictions prohibiting sharing harmful content or misinformation.\n\t- Acknowledges projects like AUTOMATIC1111/stable-diffusion-webui, InvokeAI, CompVis/stable-diffusion, Sygil-webui, and more.\n- Relevant topics: docker, pytorch\n- [Malicious AI models on Hugging Face backdoor users’ machines (bleepingcomputer.com)](https://www.bleepingcomputer.com/news/security/malicious-ai-models-on-hugging-face-backdoor-users-machines/)\n- [[]]I'm unable to summarize the content of the web page as it appears to be inaccessible. If you have another page or topic you'd like me to summarize, please feel free to provide it.\n- [AI 100-2 E2023, Adversarial Machine Learning: A Taxonomy and Terminology of Attacks and Mitigations | CSRC (nist.gov)](https://csrc.nist.gov/pubs/ai/100/2/e2023/final)\n- [[]]The web page provides a NIST report on Adversarial Machine Learning (AML) that establishes a taxonomy and terminology for AML concepts, attacks, and mitigations. The report surveys AML literature to categorize ML methods, attack lifecycle stages, attacker goals, and capabilities. It offers methods for mitigating attacks and highlights challenges in AI system security management. The terminology aligns with AML literature and includes a glossary for non-expert readers. The aim is to standardize language in understanding evolving AML landscapes, aiding in assessing and managing AI system security.\n  \n  Topics covered in the document include:\n- Adversarial Machine Learning\n- Artificial intelligence\n- Machine learning\n- Attack taxonomy\n- Evasion\n- Data poisoning\n- Privacy breach\n- Attack mitigation\n- Data modality\n- Generative models\n- Large language model\n- Trojan attack\n- Backdoor attack\n- Security and Privacy\n- Advanced persistent threats\n- Botnets\n- Information sharing\n- Intrusion detection & prevention\n- Malware\n- Technologies\n- Artificial intelligence\n- [Here Come the AI Worms | WIRED](https://www.wired.com/story/here-come-the-ai-worms/)\n- - [[]]As AI systems like ChatGPT and Gemini advance, concerns about potential cyberattacks increase.\n\t- Researchers have developed a generative AI worm, Morris II, capable of spreading between systems to steal data and deploy malware.\n\t- The worm targets generative AI email assistants to extract data from emails and send spam messages, bypassing security measures.\n\t- Security vulnerabilities like prompt injections and jailbreaks can compromise AI systems' safety rules, allowing for malicious actions.\n\t- The research highlights the risks posed by generative AI worms and the importance of addressing bad architecture design within the AI ecosystem.\n\t- Companies like Google and OpenAI are urged to enhance system resilience and implement methods to counter harmful input.\n\t- Potential future risks of generative AI worms spreading in various applications are emphasised by security experts.\n\t- Recommendations to mitigate worm risks involve traditional security approaches and ensuring human oversight in AI actions.\n\t- Developers creating AI systems should be vigilant about security risks and incorporate appropriate measures to safeguard against potential attacks.\n- [Check your IP address & website security NCSC.GOV.UK](https://checkcybersecurity.service.ncsc.gov.uk/ip-check)\n- [[]]Unable to access or summarize the content at [https://checkcybersecurity.service.ncsc.gov.uk/ip-check](https://checkcybersecurity.service.ncsc.gov.uk/ip-check)\n- [Paper page Stealing Part of a Production Language Model (huggingface.co)](https://huggingface.co/papers/2403.06634)\n- [[]]The web page discusses a model-stealing attack on language models such as OpenAI's ChatGPT and Google's PaLM-2. The attack successfully extracts the embedding projection layer of transformer models, revealing hidden dimensions of 1024 and 2048 for specific models. The research outlines the attack's cost efficiency and suggests potential defenses against such attacks. The page also mentions related papers on training data leakage and adversarial attacks on large language models.\n- [pdparchitect/llm-hacking-database: This repository contains various attack against Large Language Models. (github.com)](https://github.com/pdparchitect/llm-hacking-database) [[Jailbreaking]]\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Metaverse platforms continue to evolve with focus on interoperability and open standards\n  - Web3 integration accelerating with decentralised identity and asset ownership\n  - Enterprise adoption growing in virtual collaboration, training, and digital twins\n  - UK companies increasingly active in metaverse development and immersive technologies\n\n- Technical capabilities\n  - Real-time rendering at photorealistic quality levels\n  - Low-latency networking enabling seamless multi-user experiences\n  - AI-driven content generation and procedural world building\n  - Spatial audio and haptics enhancing immersion\n\n- UK and North England context\n  - Manchester: Digital Innovation Factory supports metaverse startups and research\n  - Leeds: Holovis leads in immersive experiences for entertainment and training\n  - Newcastle: University research in spatial computing and interactive systems\n  - Sheffield: Advanced manufacturing using digital twin technology\n\n- Standards and frameworks\n  - Metaverse Standards Forum driving interoperability protocols\n  - WebXR enabling browser-based immersive experiences\n  - glTF and USD for 3D asset interchange\n  - Open Metaverse Interoperability Group defining cross-platform standards\n\n## Metadata\n\n- **Last Updated**: 2025-11-16\n- **Review Status**: Automated remediation with 2025 context\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable",
  "properties": {
    "id": "cyber-security-and-cryptography-owl-axioms",
    "collapsed": "true",
    "- ontology": "true",
    "- term-id": "mv-175087123330",
    "- preferred-term": "Cyber security and Cryptography",
    "- source-domain": "metaverse",
    "- status": "active",
    "- public-access": "true",
    "- definition": "A component of the metaverse ecosystem focusing on cyber security and cryptography.",
    "- maturity": "mature",
    "- authority-score": "0.85",
    "- owl:class": "mv:CyberSecurityAndCryptography",
    "- owl:physicality": "ConceptualEntity",
    "- owl:role": "Concept",
    "- belongsToDomain": "[[MetaverseDomain]]",
    "- enables": "[[ImmersiveExperience]], [[Presence]], [[SpatialComputing]]",
    "- requires": "[[DisplayTechnology]], [[TrackingSystem]], [[RenderingEngine]]",
    "- bridges-to": "[[HumanComputerInteraction]], [[ComputerVision]], [[Robotics]]",
    "public": "true"
  },
  "backlinks": [
    "Deepfakes and fraudulent content",
    "Soon-Next-Later (AI futurology)",
    "BC-0037-public-key"
  ],
  "wiki_links": [
    "TrackingSystem",
    "ImmersiveExperience",
    "ComputerVision",
    "Open Generative AI tools",
    "RenderingEngine",
    "SpatialComputing",
    "Robotics",
    "HumanComputerInteraction",
    "MetaverseDomain",
    "Jailbreaking",
    "DisplayTechnology",
    "Presence"
  ],
  "ontology": {
    "term_id": "mv-175087123330",
    "preferred_term": "Cyber security and Cryptography",
    "definition": "A component of the metaverse ecosystem focusing on cyber security and cryptography.",
    "source_domain": "metaverse",
    "maturity_level": null,
    "authority_score": 0.85
  }
}