{
  "title": "DAO Legal Structures",
  "content": "- ### OntologyBlock\n  id:: bc-0470-dao-legal-structures-ontology\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: BC-0470\n\t- preferred-term:: DAO Legal Structures\n\t- source-domain:: metaverse\n\t- status:: stub-needs-content\n    - public-access:: true\n\t- content-status:: minimal-placeholder-requires-authoring\n    - public-access:: true\n\t- definition:: A component of the blockchain ecosystem.\n\t- maturity:: draft\n\t- owl:class:: bc:DAOLegalStructures\n\t- owl:physicality:: ConceptualEntity\n\t- owl:role:: Concept\n\t- belongsToDomain:: [[BlockchainDomain]]\n\n\n## Academic Context\n\n- Brief contextual overview\n\t- Decentralised Autonomous Organisations (DAOs) represent a novel organisational form enabled by blockchain technology, characterised by decentralised governance, smart contract execution, and collective decision-making\n\t- The academic discourse has evolved from viewing DAOs as purely technical or experimental entities to recognising their need for legal integration and regulatory clarity\n\n- Key developments and current state\n\t- Recent scholarship has focused on reconciling DAOs with existing legal frameworks, particularly in jurisdictions with mature corporate law such as the United Kingdom\n\t- The Law Commission of England and Wales has published a scoping paper clarifying how DAOs are treated under English law, concluding that no bespoke legal entity is currently required, but existing structures may be adapted as necessary\n\n- Academic foundations\n\t- Foundational work includes comparative studies of DAO regulation in jurisdictions such as Wyoming, Vermont, and Malta, which have introduced specific legal forms for DAOs\n\t- The concept of the \"legal wrapper\" has emerged as a pragmatic solution, allowing DAOs to operate within established legal boundaries while preserving core decentralised principles\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n\t- DAOs are increasingly adopting formal legal structures to manage risk, facilitate compliance, and interact with traditional financial and legal systems\n\t- Common legal wrappers include limited liability partnerships, trusts, and foundations, with jurisdictions such as Wyoming (DAO LLCs), Guernsey, and the Cayman Islands offering tailored options\n\n- Notable organisations and platforms\n\t- Uniswap DAO, ENS DAO, and other prominent Web3 projects have implemented legal wrappers to manage governance and treasury operations\n\t- UK-based DAOs are beginning to adopt similar structures, often referencing English law in their constitutions and participation agreements\n\n- UK and North England examples where relevant\n\t- Manchester and Leeds have seen a rise in blockchain startups and DAO initiatives, with local legal firms and innovation hubs providing guidance on structuring DAOs under English law\n\t- Newcastle and Sheffield are emerging as regional centres for blockchain research and development, with academic institutions collaborating on DAO governance and compliance projects\n\n- Technical capabilities and limitations\n\t- Smart contracts enable automated governance and transparent decision-making, but legal wrappers are necessary to address issues such as liability, asset management, and regulatory compliance\n\t- The integration of legal wrappers can introduce complexity and potential points of centralisation, requiring careful design to maintain decentralised principles\n\n- Standards and frameworks\n\t- The Harmony Framework provides a methodical approach to the legal structuring of decentralised organisations, offering adaptable solutions for different jurisdictions\n\t- Industry standards are evolving, with ongoing efforts to harmonise legal and technical approaches to DAO governance\n\n## Research & Literature\n\n- Key academic papers and sources\n\t- Korotana, S. (2025). Decentralized autonomous organizations: adapting legal structures and proposing a new model of DAOLLP. *Capital Markets Law Journal*, 20(3), kmaf011. https://doi.org/10.1093/cmlj/kmaf011\n\t- Law Commission of England and Wales. (2024). Decentralised autonomous organisations (DAOs): A scoping paper. https://www.lawcom.gov.uk/project/daos/\n\t- de la Roche, M. (2025). Comparative Analysis Report: Legal Frameworks for DAOs. Blockstand. https://blockstand.eu/blockstand/uploads/2025/05/DAO-Jurisdiction-Landscape_-Mariana-de-la-Roche-.pdf\n\n- Ongoing research directions\n\t- Comparative studies of DAO regulation in different jurisdictions\n\t- Development of hybrid legal-technical frameworks for DAO governance\n\t- Exploration of the impact of legal wrappers on decentralisation and community participation\n\n## UK Context\n\n- British contributions and implementations\n\t- The UK has taken a proactive approach to DAO regulation, with the Law Commission providing clear guidance on the legal treatment of DAOs under English law\n\t- UK-based legal firms and academic institutions are at the forefront of research and practical implementation of DAO legal structures\n\n- North England innovation hubs (if relevant)\n\t- Manchester and Leeds are home to a growing number of blockchain startups and DAO initiatives, supported by local legal and academic expertise\n\t- Newcastle and Sheffield are emerging as regional centres for blockchain research, with academic institutions collaborating on DAO governance and compliance projects\n\n- Regional case studies\n\t- Manchester-based DAOs have successfully implemented legal wrappers to manage governance and treasury operations, setting a precedent for other regional initiatives\n\t- Leeds and Newcastle have seen collaborative projects between academic institutions and local startups, focusing on the development of compliant and decentralised organisational structures\n\n## Future Directions\n\n- Emerging trends and developments\n\t- Continued evolution of legal wrappers and hybrid governance models\n\t- Increased collaboration between legal, technical, and academic communities to address regulatory challenges\n\n- Anticipated challenges\n\t- Balancing decentralisation with legal compliance\n\t- Ensuring transparency and accountability in DAO governance\n\n- Research priorities\n\t- Development of standardised legal frameworks for DAOs\n\t- Exploration of the impact of regulatory changes on DAO innovation and adoption\n\n## References\n\n1. Korotana, S. (2025). Decentralized autonomous organizations: adapting legal structures and proposing a new model of DAOLLP. *Capital Markets Law Journal*, 20(3), kmaf011. https://doi.org/10.1093/cmlj/kmaf011\n2. Law Commission of England and Wales. (2024). Decentralised autonomous organisations (DAOs): A scoping paper. https://www.lawcom.gov.uk/project/daos/\n3. de la Roche, M. (2025). Comparative Analysis Report: Legal Frameworks for DAOs. Blockstand. https://blockstand.eu/blockstand/uploads/2025/05/DAO-Jurisdiction-Landscape_-Mariana-de-la-Roche-.pdf\n\n\n## Metadata\n\n\n- **Migration Status**: Ontology block enriched on 2025-11-12\n- **Last Updated**: 2025-11-12\n- **Review Status**: Comprehensive editorial review\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable",
  "properties": {
    "id": "bc-0470-dao-legal-structures-ontology",
    "collapsed": "true",
    "- ontology": "true",
    "- term-id": "BC-0470",
    "- preferred-term": "DAO Legal Structures",
    "- source-domain": "metaverse",
    "- status": "stub-needs-content",
    "- public-access": "true",
    "- content-status": "minimal-placeholder-requires-authoring",
    "- definition": "A component of the blockchain ecosystem.",
    "- maturity": "draft",
    "- owl:class": "bc:DAOLegalStructures",
    "- owl:physicality": "ConceptualEntity",
    "- owl:role": "Concept",
    "- belongsToDomain": "[[BlockchainDomain]]"
  },
  "backlinks": [],
  "wiki_links": [
    "BlockchainDomain"
  ],
  "ontology": {
    "term_id": "BC-0470",
    "preferred_term": "DAO Legal Structures",
    "definition": "A component of the blockchain ecosystem.",
    "source_domain": "metaverse",
    "maturity_level": null,
    "authority_score": null
  }
}