{
  "title": "Death of the Internet",
  "content": "- ### OntologyBlock\n  id:: death-of-the-internet-ontology\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: mv-952842129530\n\t- preferred-term:: Death of the Internet\n\t- source-domain:: metaverse\n\t- status:: active\n\t- public-access:: true\n\t- definition:: A component of the metaverse ecosystem focusing on death of the internet.\n\t- maturity:: mature\n\t- authority-score:: 0.85\n\t- owl:class:: mv:DeathOfTheInternet\n\t- owl:physicality:: ConceptualEntity\n\t- owl:role:: Concept\n\t- belongsToDomain:: [[MetaverseDomain]]\n\t- #### Relationships\n\t  id:: death-of-the-internet-relationships\n\t\t- enables:: [[ImmersiveExperience]], [[Presence]], [[SpatialComputing]]\n\t\t- requires:: [[DisplayTechnology]], [[TrackingSystem]], [[RenderingEngine]]\n\t\t- bridges-to:: [[HumanComputerInteraction]], [[ComputerVision]], [[Robotics]]\n\n\t- #### OWL Axioms\n\t  id:: death-of-the-internet-owl-axioms\n\t  collapsed:: true\n\t\t- ```clojure\n\t\t  Declaration(Class(mv:DeathOfTheInternet))\n\n\t\t  # Classification\n\t\t  SubClassOf(mv:DeathOfTheInternet mv:ConceptualEntity)\n\t\t  SubClassOf(mv:DeathOfTheInternet mv:Concept)\n\n\t\t  # Domain classification\n\t\t  SubClassOf(mv:DeathOfTheInternet\n\t\t    ObjectSomeValuesFrom(mv:belongsToDomain mv:MetaverseDomain)\n\t\t  )\n\n\t\t  # Annotations\n\t\t  AnnotationAssertion(rdfs:label mv:DeathOfTheInternet \"Death of the Internet\"@en)\n\t\t  AnnotationAssertion(rdfs:comment mv:DeathOfTheInternet \"A component of the metaverse ecosystem focusing on death of the internet.\"@en)\n\t\t  AnnotationAssertion(dcterms:identifier mv:DeathOfTheInternet \"mv-952842129530\"^^xsd:string)\n\t\t  ```\n\npublic:: true\n\n\t- #Public page automatically published\n- # The story arc of THE MISTAKES\n\t- make the internet\n\t- centralise it to monetise it\n\t- choose passwords instead of verified cryptographic end points\n\t- enshitification through greed on search monopoly\n\t- closed ecosystems\n\t- bots everywhere\n\t- 2FA everywhere, oh god it's everywhere\n\t- pay for mitigation with increasingly intrusive gatekeeping and more enshitification\n\t- invent AI, before asking if we needed AI\n\t- immediately attempt to commodify it, bots proliferate\n\t- agree that search is now unusable\n\t- make people pay for essentially the late 90's search experience via AI\n\t- remove viable search from 98.5% of the world\n\t- boil the oceans\n\t- everyone build an underground bunker (not you, them)\n\t- collect underpants\n\t- .....\n\t- profit??\n-\n- This isn't a new problem, but seems perhaps to be accelerating.\n\t- ![image.png](../assets/image_1707220464151_0.png){:height 853, :width 500}\n- https://twitter.com/emollick/status/1741287767773163626?\n\t- {{tweet https://twitter.com/emollick/status/1741287767773163626?}}\n- ## AI augmented search is wasteful\n\t- [Expanding AI Overviews and introducing AI Mode](https://blog.google/products/search/ai-mode-search/?utm_source=linkedin&utm_medium=social&utm_campaign=og&utm_content=&utm_term=)\n\t-\n\t- ![Screenshot 2024-06-13 091134.png](../assets/Screenshot_2024-06-13_091134_1718266390338_0.png){:width 600}\n\t\t- In conversation with [Doug Weir, Director of the Conflict and Climate Observatory.](https://ceobs.org/)\n\t-\n\t- ### Energy Consumption and Climate Impact of AI search\n\t\t- The rapid adoption in internet search has significant [implications for energy consumption](https://www.theverge.com/2023/10/10/23911059/ai-climate-impact-google-openai-chatgpt-energy) and climate change, and excluding much of the world from viable knowledge discovery.\n\t\t- [Artificial Intelligence Impact on the Environment: Hidden Ecological Costs and Ethical-Legal Issues | Zhuk | Journal of Digital Technologies and Law (lawjournal.digital)](https://www.lawjournal.digital/jour/article/view/303?locale=en_US)\n\t\t- **Data Centers and Energy Use**\n\t\t\t- GenAI relies on massive data centers, which consume [substantial amounts of energy](https://mit-genai.pubpub.org/pub/8ulgrckc/release/2). Talk is now shifting to gigawatt datacentres [[Leopold Aschenbrenner]] . The International Energy Agency (IEA) projects that data centers' electricity consumption will double by 2026, equivalent to Japan's current total consumption. These data centers are primarily powered by fossil fuels, [contributing significantly to greenhouse gas emissions](https://e360.yale.edu/features/artificial-intelligence-climate-energy-emissions).\n\t\t\t- Training a single AI model can emit up to 626,000 pounds of carbon dioxide equivalent, nearly five times the lifetime emissions of the average American car.\n\t\t\t- The carbon footprint of GenAI models is exacerbated by their [energy-intensive nature](https://www.technologyreview.com/2023/12/01/1084189/making-an-image-with-generative-ai-uses-as-much-energy-as-charging-your-phone/) and the need for frequent hardware replacements, which contribute to electronic waste.\n\t\t\t- [The new AI Google search is incredibly wasteful](https://www.scientificamerican.com/article/what-do-googles-ai-answers-cost-the-environment/)\n\t\t\t- [What Do Google’s AI Answers Cost the Environment? | Scientific American](https://www.scientificamerican.com/article/what-do-googles-ai-answers-cost-the-environment/)\n\t\t\t- [The carbon impact of AI vs search engines | Insights | Yard (weareyard.com)](https://weareyard.com/insights/the-carbon-impact-of-ai-vs-search-engines)\n\t\t- **Comparison to Traditional Search**:\n\t\t\t- Adding AI to Google Search increases its energy use more than tenfold, potentially matching the electricity usage of a small country like Ireland.\n\t\t\t- In contrast, traditional search engines like Google's original search engine use significantly less energy, with an estimated 0.3 watt-hours per search.\n\t- ### Economic Exclusion\n\t\t- The nexus where payments, search, and AI converge marks a transformative period for the internet. The traditional model of free data access and ad-supported revenue is being challenged by AI capabilities necessitating paid data agreements and enhanced monetisation strategies. This evolution impacts everything from user behaviour and regulatory frameworks to financial viability and market competition, signalling a profound shift in the digital ecosystem.\n\t\t- AI-driven search engines are changing the fundamental economics of the web. [Search GPT](https://www.brookings.edu/articles/algorithmic-bias-detection-and-mitigation-best-practices-and-policies-to-reduce-consumer-harms/), developed by OpenAI, demonstrates this shift, relying less on traditional web crawling and more on curated, formalised partnerships with publishers to avoid legal issues over scraping. The new AI economy is increasingly creating a \"two-tier\" web, where access to valuable data and knowledge is controlled by those with the capital to enter into such partnerships, as noted by the [Brookings Institution](https://www.brookings.edu/articles/algorithmic-bias-detection-and-mitigation-best-practices-and-policies-to-reduce-consumer-harms/).\n\t\t\t- **Global Accessibility**\n\t\t\t\t- Meanwhile, [the International Telecommunication Union](https://www.itu.int/hub/publication/d-ind-idi-2021-01/) has pointed out that these AI tools are inaccessible to regions with weaker infrastructure, worsening digital divides. The burden of high costs and heavy energy use has disproportionately negative effects on developing nations, making AI-powered search a privilege of the wealthy and connected.\n\t\t\t\t- [The impact of artificial intelligence on human society and bioethics - PMC (nih.gov)](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7605294/)\n\t\t\t- **Cost and Accessibility Barriers**:\n\t\t\t\t- The high energy costs associated with GENAI data centers are passed on to users, making these services less accessible to those in lower-income regions or with limited internet infrastructure.\n\t\t\t\t- The economic burden of GENAI adoption can further exacerbate existing digital divides, excluding those who cannot afford the necessary infrastructure or energy costs.\n\t\t\t- **Alternative Approaches**:\n\t\t\t\t- Researchers suggest that more specialized, less carbon-intensive models could be used for specific tasks, [reducing energy consumption](https://www.techtarget.com/sustainability/feature/Generative-AIs-sustainability-problems-explained) and making these tools more accessible to a broader audience.\n\t\t\t\t- The only other option is a phase transition to a new internet paradigm, with higher signal to noise, through aligned incentives and cryptographically assured end points.\n\t- ### Factors\n\t\t- #### Economic Models and Monetisation Strategies\n\t\t\t- The transition from free data access to paid partnerships reflects a deeper change in economic models within the digital landscape. OpenAI's partnerships with major publishers for Search GPT indicate a movement towards a more closed, monetised web. These partnerships enable OpenAI to offer its AI-driven services legally and more sustainably, albeit at a higher operational cost, potentially offset by future advertising revenues or subscription models.\n\t\t- #### Regulatory and Market Dynamics\n\t\t\t- Regulatory environments are likely to influence the battle between traditional search engines and AI-driven alternatives. The European Union's challenges in legislating competition within the search market underscore the dominance of established entities like Google. However, AI-driven search engines like Search GPT might benefit from regulatory shifts aiming to break monopolistic hold, thereby fostering competition and innovation.\n\t\t- #### User Behaviour and Adoption\n\t\t\t- A critical factor in the success of AI-driven search engines will be user adoption. While AI-enhanced search engines promise more accurate and contextually relevant results, there remains scepticism about whether users will transition from well-known traditional search engines like Google. Improvements in AI capabilities must demonstrate a substantial enhancement in user experience to effectively drive this behavioural shift.\n\t\t- #### Cloud Infrastructure and Competitive Dynamics\n\t\t\t- Microsoft's role as a cloud infrastructure provider for both Bing and OpenAI highlights the strategic importance of cloud services in the AI and search engine landscape. The partnership dynamics between Microsoft and OpenAI, despite their competitive products, underscore the centrality of cloud infrastructure in supporting AI technologies.\n\t\t- #### Revenue Models and Financial Viability\n\t\t\t- The financial success of AI-driven search engines will hinge on their ability to generate revenue and offset operational costs. Traditional search engines like Google have perfected ad-based revenue models. AI-driven alternatives, however, must navigate establishing similarly effective monetisation strategies, potentially through a mix of subscription-based models and advertising revenue.\n- ## Algorithmic Capture and Decline of Human Exploration\n\t- We've become dependent on personalised, AI-driven feeds, narrowing our experience of the web. As Eli Pariser's [TED talk](https://www.ted.com/talks/eli_pariser_beware_online_filter_bubbles) warned us years ago, AI-driven \"filter bubbles\" are trapping us in curated echo chambers, where discovery and serendipity are casualties of efficiency.\n\t\t- This reductionist approach to knowledge risks making us intellectually lazy. As [MIT Technology Review](https://www.technologyreview.com/2021/07/13/1028401/ai-large-language-models-bigscience-project/) notes, we're being spoon-fed tailored, context-stripped answers that limit our engagement with the broader, more complex web.\n- ## Concerns Over AI's Influence on Information\n\t- The rise of AI-generated content brings significant risks to the credibility of online information. The [New York Times](https://www.nytimes.com/2023/02/16/technology/bing-chatbot-microsoft-chatgpt.html) highlighted instances where AI chatbots have provided harmful or inaccurate information. This threatens to erode public trust in online content, as people increasingly struggle to discern between authentic human knowledge and AI-generated narratives, a concern echoed in [Pew Research Center](https://www.pewresearch.org/internet/2023/06/21/ai-and-human-enhancement-americans-hopes-and-fears/) reports.\n\t- The [World Economic Forum](https://www.weforum.org/agenda/2023/01/davos-2023-ai-misinformation-disinformation/) warned that AI's role in content curation could deepen the spread of disinformation, leaving us with an increasingly \"fake\" internet, dominated by bots and automated systems, rather than genuine human interaction.\n\t- [Algorithmic Bias: How Search Engine Results Can Be Skewed (talentsmart.co.in)](https://www.talentsmart.co.in/algorithmic-bias-how-search-engine-results-can-be-skewed/)\n- ## Rise of Bots Aligns With Dead Internet Theory\n\t- According to [Imperva](https://www.imperva.com/blog/bad-bot-report-2022-edition/), bots made up 47.4% of internet traffic in 2022. This proliferation aligns with the once-dismissed [Dead Internet Theory](https://en.wikipedia.org/wiki/Dead_Internet_theory), suggesting that the web is increasingly driven by AI, bots, and algorithms rather than real human interaction. This isn’t just theory—evidence of widespread bot activity has been reported on platforms like [Instagram](https://www.adweek.com/social-marketing/study-15-million-russian-instagram-influencers-followers-are-bots/) and [Twitter](https://finance.yahoo.com/news/cia-expert-says-80-twitter-222337217.html), where AI-driven manipulation of follower counts and traffic has become endemic.\n- ## Google search is broken. Google lied.\n\t- [An Anonymous Source Shared Thousands of Leaked Google Search API Documents with Me; Everyone in SEO Should See Them](https://sparktoro.com/blog/an-anonymous-source-shared-thousands-of-leaked-google-search-api-documents-with-me-everyone-in-seo-should-see-them/)\n\t\t- \"Google no longer rewards scrappy, clever, SEO-savvy operators who know all the right tricks. They reward established brands, search-measurable forms of popularity, and established domains that searchers already know and click. From 1998 – 2018 (or so), one could reasonable start a powerful marketing flywheel with SEO for Google. In 2024, I don’t think that’s realistic, at least, not on the English-language web in competitive sectors.\"\n\t- [Google Search Is Now a Giant Hallucination (gizmodo.com)](https://gizmodo.com/google-search-ai-overview-giant-hallucination-1851499031) [[Death of the Internet]] [[Google]]\n\t- [What Do Google’s AI Answers Cost the Environment? | Scientific American](https://www.scientificamerican.com/article/what-do-googles-ai-answers-cost-the-environment/)\n- ## Computers breeding humans\n\t- It's indesputible that dating app algorithms have been \"matchmaking\" humans against numerical criteria for a long time. It's possible there's are third generation \"matched\" users of the apps now, since computers were first [applied to this in 1964](https://www.datingadvice.com/online-dating/history-of-online-dating).\n\t\t- \"Cofounder of the RIZZ app here. We got inspired to build RIZZ a while back when we noticed the sheer volume of people asking for dating conversational help in the Tinder subreddit. Tons of people, both guys and girls, struggle with online dating. In fact, the statistics show that most are not successful with it. So how can they improve? Many go on Reddit asking for help. Or asking their friends for advice. Most simply can’t afford a dating coach. I believe AI can level the playing field, enabling people to enhance their flirting skills and boost confidence when interacting with new people. We launched just over a year ago and have learned so much up to this point. We still have so much to do to make our vision a reality.\"\n\t- It seems not it'll be bots talking to bots, under the guidance of algos, leading to dystopian babies.\n- ## Billionaires are monetising users\n\t- Advertising is a \"Rube Goldberg Machine\" that has twisted incentives and is no longer fully scrutable.\n\t\t- [The Agentic Web and Original Sin – Stratechery by Ben Thompson](https://stratechery.com/2025/the-agentic-web-and-original-sin/)\n\t\t- [You Think You Know How Misinformation Spreads? Welcome to the Hellhole of Programmatic Advertising | WIRED](https://www.wired.com/story/death-of-truth-misinformation-advertising/)\n\t- ### People have noticed\n\t\t- Science fiction author and all round thinker Cory Doctorow has been highlighting all this for a long time\n\t\t- [Platform decay - Doctorow](https://en.wikipedia.org/wiki/Enshittification?)\n\t\t- {{renderer :linkpreview,https://pluralistic.net/2024/04/04/teach-me-how-to-shruggie/}}\n\t\t\t- https://pluralistic.net/2024/04/04/teach-me-how-to-shruggie/\n\t\t- [‘Enshittification’ is coming for absolutely everything (ft.com)](https://www.ft.com/content/6fb1602d-a08b-4a8c-bac0-047b7d64aba5)\n\t\t- {{renderer :linkpreview,https://www.benlandautaylor.com/p/the-ddos-attack-of-academic-bullshit}}\n\t\t\t- https://www.benlandautaylor.com/p/the-ddos-attack-of-academic-bullshit\n\t\t- {{renderer :linkpreview,https://injuly.in/blog/darker-internet/index.html}}\n\t\t\t- https://injuly.in/blog/darker-internet/index.html\n\t\t- {{renderer :linkpreview,https://www.wheresyoured.at/are-we-watching-the-internet-die/}}\n\t\t\t- https://www.wheresyoured.at/are-we-watching-the-internet-die/\n\t\t- <iframe src=\"https://www.theguardian.com/technology/article/2024/may/19/spam-junk-slop-the-latest-wave-of-ai-behind-the-zombie-internet\" style=\"width: 100%; height: 600px\"></iframe>\n- ## Attention is too concentrated\n\t- We have become dependant on algorithmically generated personal feeds, we have lost the capacity to explore our digital society\n\t\t- [Where have all the websites gone? (fromjason.xyz)](https://www.fromjason.xyz/p/notebook/where-have-all-the-websites-gone/)\n\t- These platforms are very vulnerable and exposed to manipulation, especially as the previous guardrails are removed for profit margins.\n\t- These technologies are reductionist, which feels like a shortcut, but is actually a simplification across the manifold of American English, and is likely making people intellectually lazy.\n\t- Increasingly there will be no other choice, trending toward [[Human vs AI]].\n- ## Changes to information sources\n\t- Social media platforms, particularly Facebook and Instagram, are undergoing a significant shift by reducing the emphasis on political content. Meta, the parent company of these platforms, has introduced measures to minimize the presence of political content, such as the launch of the Threads app, which aims to de-emphasize news and politics ([The Verge](https://www.theverge.com/2022/10/24/23425082/meta-threads-app-political-news-content-reduction-facebook-instagram)).\n\t- This move is part of a broader trend where social media giants are altering their algorithms to prioritize personal content over news and politics, potentially impacting public engagement and democracy ([The New York Times](https://www.nytimes.com/2022/10/24/technology/meta-threads-political-content.html)).\n\t- Simultaneously, the influence of traditional or [[legacy media]] is experiencing a substantial decline. With the rise of social media and digital platforms, the reach and impact of legacy media have been radically reduced, leading to a transformation in the way information is disseminated and consumed.\n\t\t- Note that many are now signing deals with [[OpenAI]] etc\n\t- Twitter has also undergone significant changes and is perceived as a mere shadow of its former self. The platform has been criticized for various issues, including the spread of misinformation, harassment, and a decline in user engagement.\n\t\t- Twitter / X is now likely to join a 'race to the bottom', with [NSFW communities](https://techcrunch.com/2024/03/29/x-confirms-plans-for-nsfw-communities/?) driven by GenAI bots likely taking the platform by storm.\n\t\t- [Twitch U-turns on 'artistic nudity' policy - BBC News](https://www.bbc.co.uk/news/technology-67747949)\n\t- TikTok, a Chinese-owned social media platform, has been gaining prominence and is characterized by its opaque nature. As it ascends in popularity, concerns have been raised about its potential impact on shaping public opinion and its susceptibility to external influence.\n\t- Amidst these changes, there is a notable shift towards \"the private internet,\" including chat groups, Discord, fringe social media platforms, and Telegram groups. This trend has led to the fragmentation of views and discussions, raising concerns about the potential for echo chambers and polarization.\n- ## AI Advertising Trojan Horse Sites\n\t- Fake sites which cater to name based searches such as minor celebrities are automatically updated thousands of times a day to rise to the top of Google searchs.\n\t- [The rise of obituary spam - The Verge](https://www.theverge.com/24065145/ai-obituary-spam-generative-clickbait)\n\t- [Celebrity Wiki ⋆ Richest People, Trending Biography, Famous Birthdays! (celebsagewiki.com)](https://www.celebsagewiki.com/)\n- ## The Dark Forest Thesis\n\t- [The Dark Forest Theory of the Internet | by Yancey Strickler | Medium](https://ystrickler.medium.com/the-dark-forest-theory-of-the-internet-7dc3e68a7cb1)\n\t- [The Expanding Dark Forest and Generative AI (maggieappleton.com)](https://maggieappleton.com/ai-dark-forest)\n\t- In Liu Cixin's sci-fi trilogy *The Three Body Problem*, the dark forest theory suggests that the universe is full of life, but it remains silent and hidden to survive, like animals in a dark forest at night when predators are out.\n\t- The internet is becoming like a dark forest:\n\t\t- In response to ads, tracking, trolling, hype, and predatory behaviors, people are retreating to safer, private spaces online\n\t\t- These \"dark forests\" of the internet are non-indexed, non-optimized, and non-gamified environments where depressurized conversation is possible\n\t\t- Examples include private channels, group chats, and newsletters sent to select groups\n\t\t- Podcasts are another \"dark forest\" where meaning is expressed through intonation and interaction, allowing for more forgiving communication compared to the internet at large\n- ## Bots Proliferate\n\t- ![paste (6).png](../assets/paste_(6)_1718746134411_0.png)\n\t-\n\t- Jailbroken foundation models can already solve Capcha human checks, and this will soon be possible with open source models. At this point the internet will possibly explode with bot activity.\n\t\t- ![1706810932954.jpeg](../assets/1706810932954_1717339896749_0.jpeg){:width 600}\n\t- It's important to note that as the web dies, we will increasingly be forced to use [[Agents]] to mediate information, and this will mean increased [[Global Inequality]] as the remaining tatters of the free internet become badlands.\n\t\t- [Andrew Gao on X: \"the singularity is literally here. Devin ended up talking to ANOTHER AI (McDonalds' AI recruiter)!! The future of the web is #agents talking to agents. Luckily, Devin convinced Olivia to give me an interview :) Peep the video https://t.co/oYJG8JzIIO\" / X (twitter.com)](https://twitter.com/itsandrewgao/status/1786880819170320678)\n\t- [Andrew Gao on X: \"#Devin helped me get a job at McDonalds 🍔🍟 I will have a job post-AGI! (seriously, it's gotten really good at browser automation, watch) 📽️ Part 2: auto-applying to @cognition_labs with Devin 👇🧵 https://t.co/oBm20nOCvx\" / X (twitter.com)](https://twitter.com/itsandrewgao/status/1786879644651991549)\n\t\t- {{twitter https://twitter.com/itsandrewgao/status/1786879644651991549}}\n\t- Bots that persuade bots that persuade bots\n\t\t- https://www.linkedin.com/posts/emollick_two-weird-things-that-are-going-to-happen-activity-7180768944067072000-Gmtq?\n\t- Google search is dying under the shifting signal to noise problem.\n\t\t- [AI Has Made Google Search So Bad People Are Moving to TikTok & Reddit | by Ronke Babajide | Bouncin’ and Behavin’ Blogs | Medium](https://medium.com/bouncin-and-behavin-blogs/ai-has-made-google-search-so-bad-people-are-moving-to-tiktok-reddit-6ac0b4801d2e)\n\t- According to Imperva, 47.4% of all internet traffic in 2022 was bots ([reference](https://www.imperva.com/blog/bad-bot-report-2022-edition/)) though this is contested by industry internet tracker [CHEQ](https://cheq.ai/) .\n\t- An ex-CIA expert suggested up to 80% of Twitter accounts could be bots ([reference](https://finance.yahoo.com/news/cia-expert-says-80-twitter-222337217.html)).\n\t\t- [The majority of traffic from Elon Musk's X may have been fake during the Super Bowl, report suggests | Mashable](https://mashable.com/article/x-twitter-elon-musk-bots-fake-traffic)\n\t- Russian bots are inflating Instagram influencer follower counts into the tens of millions ([reference](https://www.adweek.com/social-marketing/study-15-million-russian-instagram-influencers-followers-are-bots/)).\n\t- Ticketmaster says bots snatch up concert tickets before fans get access ([reference](https://www.cnbc.com/2017/05/23/ticketmaster-and-live-nation-face-class-action-lawsuit.html)).\n\t- [(1) X (twitter.com)](https://twitter.com/lorda26/status/1753451790778225095) ancient spam account posts a generated image description with no image, drawing swarms of admiring text-spam bots which generate imaginary human reactions (read the replies) to an image which doesn’t actually exist\n- ## Rise of Bots Aligns With Dead Internet Theory\n\t- Originally a conspiracy theory, the dead internet theory suggests online activity is increasingly driven by bots, AI and algorithms rather than genuine human interactions. [Wikipedia page on dead internet theory](https://en.wikipedia.org/wiki/Dead_Internet_theory)\n\t- Corporations and governments are flooding the internet with bots and AI-generated content to push propaganda and influence behaviour \n\t  ([Deep fakes Verge article](https://www.theverge.com/23341528/ai-fake-faces-personalities-bots-misinformation)). ([Fake Ted Cruz site](https://www.tedcruzforhumanpresident.com/)).\n- ## Concerns Over AI's Influence on Online Content\n\t- The collective impact of these developments creates a potentially more precarious environment for the manipulation of public opinion through artificial intelligence (AI). As political discourse becomes decentralized across various platforms and the emphasis on political content diminishes on major social media platforms, there is a growing risk of AI being exploited to manipulate public sentiment and political narratives.\n\t- Europol raised concerns about AI's overwhelming presence in online content ([reference](https://www.euractiv.com/section/digital/news/europol-sounds-alarm-on-ai-in-online-content-slamming-tech-giants/)).\n\t- Experts warn internet is saturated with bots, [disinformation](https://counterhate.com/research/the-disinformation-dozen/) and biases that undermine perceptions of genuine interactions ([reference](https://www.forbes.com/sites/ajdellinger/2019/04/24/the-bots-that-are-changing-reddit/?sh=7d6d25b94e23)).\n\t- The internet is becoming balkanised as large data aggregators like reddit close their APIs and prevent scraping. This is already having a meaningful effect on internet search.\n\t- 'Background tokens' is a term used on the [[latent space]] podcast to describe pre LLM unpolluted data. This legacy data is the last state of human discourse.\n\t- A fascinating unexpected second order impact of this is that future models may skew more right wing as those sites [welcome the scraping.](https://www.wired.com/story/most-news-sites-block-ai-bots-right-wing-media-welcomes-them/?)\n\t- [AI and Leviathan: Part III by Samuel Hammond (secondbest.ca)](https://www.secondbest.ca/p/ai-and-leviathan-part-iii)\n- ## Mental health [[Social contract and jobs]]\n\t- [Fraudulent studies are undermining the reliability of systematic reviews – a study of the prevalence of problematic images in preclinical studies of depression | bioRxiv](https://www.biorxiv.org/content/10.1101/2024.02.13.580196v1) [[Death of the Internet]] [[Deepfakes and fraudulent content]]\n\t- [Jonathan Haidt Wants You to Take Away Your Kid’s Phone | The New Yorker](https://www.newyorker.com/news/the-new-yorker-interview/jonathan-haidt-wants-you-to-take-away-your-kids-phone)\n\t\t- Jonathan Haidt, a social psychologist and the author of the book \"The Anxious Generation: How the Great Rewiring of Childhood is Causing an Epidemic of Mental Illness\". The main points covered in the interview are:\n\t\t\t- Haidt argues that a whole generation has been damaged by growing up with unrestricted access to social media and an overprotected childhood, leading to a sharp increase in anxiety, depression, and self-harm among teenagers, especially girls, starting around 2012.\n\t\t\t- He attributes this to the rapid adoption of smartphones and social media platforms between 2010 and 2015, which radically changed childhood by replacing real-life interactions and play with excessive screen time and exposure to harmful online content.\n\t\t\t- Haidt presents evidence from correlational and experimental studies to support his claim that social media use causes mental health issues, while acknowledging the need for more research.\n\t\t\t- He argues that the benefits of social media are outweighed by its negative impact on child development, as it deprives children of essential real-life experiences, such as play, adventure, and healthy risk-taking.\n\t\t\t- Haidt advocates for changing social norms and implementing restrictions on social media use, such as banning phones in schools and limiting access to social media platforms for children under 16, rather than an outright ban on technology.\n\t\t- <iframe src=\"https://jonathanhaidt.com/anxious-generation/\" style=\"width: 100%; height: 600px\"></iframe>\n- ## Tik Tok tick tock [[Death of the Internet]] [[Digital Society Surveillance]] [[Politics, Law, Privacy]]\n\t- [TikTok is China's next big weapon in the battle for personal data (axios.com)](https://www.axios.com/2019/07/20/tiktok-china-online-privacy-personal-data)\n\t- [TikTok: Beneath Its Fun Exterior Lies A Sinister Purpose (forbes.com)](https://www.forbes.com/sites/enriquedans/2020/06/28/tiktok-beneath-its-fun-exterior-lies-a-sinisterpurpose/)\n\t- [forbes.com/sites/emilybaker-white/2022/10/20/tiktok-bytedance-surveillance-american-user-data/](https://www.forbes.com/sites/emilybaker-white/2022/10/20/tiktok-bytedance-surveillance-american-user-data/)\n\t- [For Gen Z, TikTok Is the New Search Engine - The New York Times (nytimes.com)](https://www.nytimes.com/2022/09/16/technology/gen-z-tiktok-search-engine.html)\n\t- [TikTok’s search engine repeatedly delivers misinformation to its majority-young user base, report says | CNN Business](https://edition.cnn.com/2022/09/18/business/tiktok-search-engine-misinformation/)\n\t- [Revealed: how TikTok censors videos that do not please Beijing | TikTok | The Guardian](https://www.theguardian.com/technology/2019/sep/25/revealed-how-tiktok-censors-videos-that-do-not-please-beijing)\n\t- [The U.S. Is Right to Worry About TikTok | Lawfare (lawfaremedia.org)](https://www.lawfaremedia.org/article/us-right-worry-about-tiktok)\n- # Potential Green Shoots\n\t- There is a chance to build on recent advances in long running projects like [[Solid]]. This is all wrapped up with [[webid]] and [[Decentralised Web]] monikers.\n\t- Using AI to reduce conspiracy theory beliefs https://osf.io/preprints/psyarxiv/xcwdn [[Privacy, Trust and Safety]] [[Death of the Internet]] the flips side being that they are very capable of [persuasion](https://www.anthropic.com/news/measuring-model-persuasiveness).\n\t- [2403.18802.pdf (arxiv.org)](https://arxiv.org/pdf/2403.18802.pdf) [[Privacy, Trust and Safety]]\n\t\t- 1) Most surprisingly: \"LLM agents can achieve superhuman rating performance\" on fact checking when given access to Google!\n\t\t  2) Bigger models are more factual than smaller ones, as expected\n\t\t  3) LLMs are 20x cheaper than human fact-checkers, even taking into account the number of calls the [[Large language models]] had to make.\n\t\t- 4) [AI Outperforms Humans in Moral Judgments - Neuroscience News](https://neurosciencenews.com/ai-llm-morality-26041/)\n\t- ### Forcing function to trusted end points\n\t\t- *AI will permanently put an end to the \"post truth\" era: this is the subject for another post, but clearly our prior epistemic standards no longer apply. the cost of creating arbitrary image or video content is effectively 0, so unsigned content will no longer by considered reliable (once people have learned to lately mistrust online content). to be considered reliable in the future, content will have to be signed, attested to, and timestamped (likely on a blockchain).* - [Carter](https://x.com/nic__carter/status/1797635177973158182)\n\t-\n- ## A handy simulator\n\t- [Sebby37/Dead-Internet: Y'all thought the dead internet theory wasn't real, but HERE IT IS (github.com)](https://github.com/Sebby37/Dead-Internet)\n- ## Other links\n\t- [Nobody Knows What’s Happening Online Anymore - The Atlantic](https://www.theatlantic.com/technology/archive/2023/12/internet-information-trends-virality-tracking/676888/)\n\t- [W3C SN dystopia](https://www.w3.org/DesignIssues/diagrams/solid/SN-dystopia.svg)\n\t- [Welcome to Geriatric Social Media (theatlantic.com)](https://newsletters.theatlantic.com/galaxy-brain/63609043b606fe00376a82da/welcome-to-geriatric-social-media/)\n\t- [Social Media Broke Up With News. So Did Readers. - The Atlantic](https://www.theatlantic.com/technology/archive/2023/11/social-media-news-readership-decline/675890/)\n\t- [Technology is the Problem - Shyam Sankar](https://www.shyamsankar.com/p/technology-is-the-problem) [[Death of the Internet]] [[Social contract and jobs]]\n\t- [The Toilet Theory of the Internet - The Atlantic](https://www.theatlantic.com/technology/archive/2024/05/google-generative-ai-search-toilet-theory/678411/) [[Death of the Internet]]\n\t- [[Death of the Internet]] [John Robb: \"Networked Tribalism, AI, and Asteroids\" | The Great Simplification #110 - YouTube](https://www.youtube.com/watch?v=b2n_Jk37cLE)\n\t-\n-\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Metaverse platforms continue to evolve with focus on interoperability and open standards\n  - Web3 integration accelerating with decentralised identity and asset ownership\n  - Enterprise adoption growing in virtual collaboration, training, and digital twins\n  - UK companies increasingly active in metaverse development and immersive technologies\n\n- Technical capabilities\n  - Real-time rendering at photorealistic quality levels\n  - Low-latency networking enabling seamless multi-user experiences\n  - AI-driven content generation and procedural world building\n  - Spatial audio and haptics enhancing immersion\n\n- UK and North England context\n  - Manchester: Digital Innovation Factory supports metaverse startups and research\n  - Leeds: Holovis leads in immersive experiences for entertainment and training\n  - Newcastle: University research in spatial computing and interactive systems\n  - Sheffield: Advanced manufacturing using digital twin technology\n\n- Standards and frameworks\n  - Metaverse Standards Forum driving interoperability protocols\n  - WebXR enabling browser-based immersive experiences\n  - glTF and USD for 3D asset interchange\n  - Open Metaverse Interoperability Group defining cross-platform standards\n\n## Metadata\n\n- **Last Updated**: 2025-11-16\n- **Review Status**: Automated remediation with 2025 context\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable",
  "properties": {
    "id": "death-of-the-internet-owl-axioms",
    "collapsed": "true",
    "- ontology": "true",
    "- term-id": "mv-952842129530",
    "- preferred-term": "Death of the Internet",
    "- source-domain": "metaverse",
    "- status": "active",
    "- public-access": "true",
    "- definition": "A component of the metaverse ecosystem focusing on death of the internet.",
    "- maturity": "mature",
    "- authority-score": "0.85",
    "- owl:class": "mv:DeathOfTheInternet",
    "- owl:physicality": "ConceptualEntity",
    "- owl:role": "Concept",
    "- belongsToDomain": "[[MetaverseDomain]]",
    "- enables": "[[ImmersiveExperience]], [[Presence]], [[SpatialComputing]]",
    "- requires": "[[DisplayTechnology]], [[TrackingSystem]], [[RenderingEngine]]",
    "- bridges-to": "[[HumanComputerInteraction]], [[ComputerVision]], [[Robotics]]",
    "public": "true"
  },
  "backlinks": [
    "BC-0030-digital-signature",
    "Soon-Next-Later (AI futurology)",
    "Project BroBots",
    "Agentic Internet",
    "rb-0022-robot-dynamics",
    "State of the art in AI",
    "Death of the Internet",
    "Flux",
    "BC-0014-block-time"
  ],
  "wiki_links": [
    "ImmersiveExperience",
    "Human vs AI",
    "Social contract and jobs",
    "RenderingEngine",
    "Google",
    "SpatialComputing",
    "Deepfakes and fraudulent content",
    "webid",
    "HumanComputerInteraction",
    "Large language models",
    "Death of the Internet",
    "OpenAI",
    "MetaverseDomain",
    "Leopold Aschenbrenner",
    "Privacy, Trust and Safety",
    "DisplayTechnology",
    "legacy media",
    "latent space",
    "TrackingSystem",
    "Digital Society Surveillance",
    "Decentralised Web",
    "Robotics",
    "Global Inequality",
    "ComputerVision",
    "Politics, Law, Privacy",
    "Solid",
    "Agents",
    "Presence"
  ],
  "ontology": {
    "term_id": "mv-952842129530",
    "preferred_term": "Death of the Internet",
    "definition": "A component of the metaverse ecosystem focusing on death of the internet.",
    "source_domain": "metaverse",
    "maturity_level": null,
    "authority_score": 0.85
  }
}