{
  "title": "Disparate Impact",
  "content": "- ### OntologyBlock\n  id:: disparate-impact-ontology\n  collapsed:: true\n\n  - **Identification**\n    - public-access:: true\n    - ontology:: true\n    - term-id:: AI-0381\n    - preferred-term:: Disparate Impact\n    - source-domain:: ai\n    - status:: approved\n    - version:: 1.0\n    - last-updated:: 2025-11-18\n\n  - **Definition**\n    - definition:: Disparate Impact represents a legal doctrine and form of indirect discrimination occurring when facially neutral policies, practices, or algorithmic systems disproportionately affect protected groups (race, color, religion, sex, national origin, age, disability, genetics, veteran status) regardless of discriminatory intent, originating from US Title VII employment law (EEOC Uniform Guidelines 1978) and extended to UK Equality Act 2010 and EU anti-discrimination frameworks. The doctrine is quantified through statistical analysis comparing selection rates, approval rates, or outcome rates between protected and unprotected groups using the four-fifths rule (80 percent rule), which establishes that disparate impact exists when the selection rate for a protected group falls below 80 percent of the rate for the highest-performing group, calculated as a disparate impact ratio. Legal frameworks distinguish disparate impact (unintentional discriminatory outcomes from neutral policies) from disparate treatment (intentional direct discrimination based on protected characteristics), with disparate impact analysis focusing on statistical evidence of differential outcomes rather than proof of discriminatory intent. Defenses against disparate impact claims include business necessity (US) - demonstrating that the challenged practice is job-related and consistent with business necessity - and proportionate means (UK/EU) - showing that the practice constitutes a proportionate means of achieving a legitimate aim. In AI and algorithmic systems, disparate impact analysis requires statistical testing of model predictions across demographic groups, identification of less discriminatory alternative models or decision thresholds, documentation of business justification for algorithmic criteria, and compliance with sector-specific regulations in employment (EEOC enforcement), lending (Equal Credit Opportunity Act), insurance (state insurance codes), and housing (Fair Housing Act). As of September 2025, EEOC enforcement policy shifted following Executive Order 14281, substantially reducing federal disparate impact enforcement while state and private litigation continue, as analyzed in recent legal scholarship and civil rights policy commentary.\n    - maturity:: mature\n    - source:: [[EEOC Uniform Guidelines 1978]], [[UK Equality Act 2010]], [[EU Anti-Discrimination Directives]], [[Sage Journals 2024 Legal-Empirical Disparate Impact]], [[Britannica Disparate Impact]]\n    - authority-score:: 0.95\n\n\n### Relationships\n- is-subclass-of:: [[AIFairness]]\n\n## Disparate Impact\n\nDisparate Impact refers to disparate impact is a legal doctrine and form of indirect discrimination that occurs when facially neutral policies, practices, or algorithmic systems disproportionately affect protected groups, regardless of intent to discriminate. originating from us employment law (eeoc uniform guidelines 1978) and extended to uk and eu anti-discrimination frameworks, disparate impact is measured by comparing selection rates, approval rates, or outcome rates between protected and unprotected groups. the \"80 percent rule\" (four-fifths rule) establishes that disparate impact exists when the selection rate for a protected group is less than 80 percent of the rate for the highest-performing group, calculated as a disparate impact ratio. unlike disparate treatment (intentional direct discrimination), disparate impact focuses on discriminatory outcomes rather than discriminatory intent. legal defenses include business necessity (us) - demonstrating the practice is job-related and consistent with business necessity, and proportionate means (uk/eu) - showing the practice is a proportionate means of achieving a legitimate aim. in ai systems, disparate impact analysis requires statistical testing of algorithmic decisions across demographic groups, documentation of less discriminatory alternatives if available, and compliance with sector-specific regulations in employment, lending, insurance, and housing domains.\n\n- Disparate impact represents a judicial doctrine permitting challenges to employment and educational practices that appear neutral on their face but produce discriminatory outcomes[1][5]\n  - Developed within United States jurisprudence, primarily under Title VII of the Civil Rights Act 1964\n  - Distinguishes itself fundamentally from disparate treatment, which involves intentional discrimination[1]\n  - The doctrine operates on the principle that neutral policies may nonetheless violate civil rights protections if they disproportionately harm protected groups (race, religion, national origin, age, sex, pregnancy, disability, genetics, veteran status)[1]\n  - Operates as an indirect discrimination framework, capturing systemic rather than deliberately discriminatory harm\n\n## Technical Details\n\n- **Id**: 0381-disparate-impact-about\n- **Collapsed**: true\n- **Domain Prefix**: AI\n- **Sequence Number**: 0381\n- **Filename History**: [\"AI-0381-disparate-impact.md\"]\n- **Public Access**: true\n- **Source Domain**: ai\n- **Status**: in-progress\n- **Last Updated**: 2025-10-29\n- **Maturity**: mature\n- **Source**: [[US EEOC Uniform Guidelines]], [[UK Equality Act 2010]], [[EU Anti-Discrimination Directives]]\n- **Authority Score**: 0.95\n- **Owl:Class**: aigo:DisparateImpact\n- **Owl:Physicality**: VirtualEntity\n- **Owl:Role**: Process\n- **Owl:Inferred Class**: aigo:VirtualProcess\n- **Belongstodomain**: [[AIEthicsDomain]]\n- **Implementedinlayer**: [[ConceptualLayer]]\n\n## Current Landscape (2025)\n\n- Regulatory environment and enforcement\n  - The Equal Employment Opportunity Commission (EEOC) historically prohibited discrimination against protected classes in employment decisions[1]\n  - As of September 2025, the EEOC announced closure of all pending charges based solely on disparate impact allegations, following Executive Order 14281 (\"Restoring Equality of Opportunity and Meritocracy\")[2]\n  - This represents a significant policy shift away from disparate impact analysis in federal civil rights enforcement\n  - Employers remain responsible for reducing bias in hiring processes, though the legal framework for enforcement has contracted substantially[1]\n- Common selection criteria producing disparate impact\n  - Background checks, credit checks, work experience requirements, pre-employment aptitude tests, and minimum educational qualifications[1]\n  - These remain legally permissible when job-related and consistent with business necessity, though their disparate effects are well-documented[1]\n  - The tension between meritocratic selection and equitable outcomes remains unresolved in practice\n- Technical and analytical considerations\n  - Risk-adjusted regression models can identify unjustified disparities not explained by legitimate predictive factors[4]\n  - However, such analyses do not automatically prescribe implementable policy alternatives[4]\n  - The inclusion of protected characteristics in predictive models risks masking disparate treatment through statistical discrimination[4]\n\n## Research & Literature\n\n- Foundational and contemporary sources\n  - Criteria Corp (2024). \"What is Disparate Impact?\" Glossary entry examining definitional clarity and regulatory context[1]\n  - Center for Equal Opportunity (2025, October 29). \"The End of Disparate Impact?\" Commentary on Executive Order 14281 and EEOC policy reversal[2]\n  - Fordham Institute (date unspecified). \"Let's talk about discipline and disparate impact (again)\" – examines whether racial disparities necessarily indicate discrimination or may reflect socioeconomic factors[3]\n  - Sage Journals (2024). \"Reconciling Legal and Empirical Conceptions of Disparate Impact\" – technical treatment of risk-adjusted disparities and statistical methodology[4]\n  - Britannica (date unspecified). \"Disparate Impact: Definition, Theory, Applications, & Facts\" – comprehensive overview of judicial development and application beyond Title VII[5]\n  - Stanford Law (2025, July 28). \"Reassessing Disparate Impact\" – contemporary legal analysis[6]\n  - U.S. Congress (date unspecified). \"What Is Disparate-Impact Discrimination?\" – legislative perspective[7]\n  - SHRM (date unspecified). \"Understanding Disparate Impact vs. Disparate Treatment in Hiring\"[8]\n- Ongoing scholarly debate\n  - Fundamental disagreement persists regarding whether racial disparities themselves constitute evidence of discrimination or whether alternative explanations (socioeconomic factors, differential behaviour patterns) may account for observed outcomes[3]\n  - The relationship between statistical disparities and unlawful discrimination remains contested in academic literature\n\n## UK Context\n\n- British legal framework\n  - The United Kingdom employs indirect discrimination doctrine under the Equality Act 2010, which functions analogously to disparate impact but operates within a distinct statutory framework\n  - UK employment law prohibits practices that, though not discriminatory in form, place persons sharing a protected characteristic at a particular disadvantage[not in search results – general knowledge]\n  - The Equality and Human Rights Commission enforces these provisions, though with considerably less enforcement activity than the EEOC historically undertook\n- North England considerations\n  - No specific disparate impact case law or implementation examples from Manchester, Leeds, Newcastle, or Sheffield appear in current academic literature\n  - Regional employment tribunals apply indirect discrimination principles, but disparate impact as a specifically American doctrine has limited direct application in English law\n  - The policy shift in US federal enforcement (as of September 2025) does not directly affect UK employment law, though it may influence international best practice discussions\n\n## Future Directions\n\n- Anticipated developments\n  - The contraction of disparate impact enforcement in the United States may prompt reconsideration of indirect discrimination approaches globally\n  - Employers may face reduced legal incentive to audit selection criteria for disparate effects, potentially increasing systemic inequities\n  - Academic research will likely intensify around alternative frameworks for identifying and addressing unintentional discrimination\n  - The debate over whether statistical disparities warrant intervention independent of evidence of intentional discrimination will likely sharpen\n- Research priorities\n  - Empirical investigation of whether disparate impact enforcement actually improved employment outcomes for protected groups\n  - Development of alternative analytical frameworks that distinguish between discrimination and legitimate explanatory factors\n  - Comparative analysis of indirect discrimination enforcement across jurisdictions (UK, EU, Canada, Australia)\n\n## References\n\n[1] Criteria Corp. \"What is Disparate Impact?\" Criteria Corp Glossary. Available at: https://www.criteriacorp.com/resources/glossary/disparate-impact\n[2] Center for Equal Opportunity. \"The End of Disparate Impact?\" 29 October 2025. Available at: https://ceousa.org/2025/10/29/the-end-of-disparate-impact/\n[3] Fordham Institute. \"Let's talk about discipline and disparate impact (again).\" Commentary. Available at: https://fordhaminstitute.org/national/commentary/lets-talk-about-discipline-and-disparate-impact-again\n[4] Sage Journals. \"Reconciling Legal and Empirical Conceptions of Disparate Impact.\" *Journal Title* (2024). DOI: 10.1177/2755323X241243168\n[5] Britannica. \"Disparate Impact: Definition, Theory, Applications, & Facts.\" Available at: https://www.britannica.com/topic/disparate-impact\n[6] Stanford Law. \"Reassessing Disparate Impact.\" Legal Aggregate, 28 July 2025. Available at: https://law.stanford.edu/2025/07/28/reassessing-disparate-impact/\n[7] U.S. Congress. \"What Is Disparate-Impact Discrimination?\" CRS Product IF13057. Available at: https://www.congress.gov/crs-product/IF13057\n[8] SHRM. \"Understanding Disparate Impact vs. Disparate Treatment in Hiring.\" Available at: https://www.shrm.org/topics-tools/tools/hr-answers/disparate-impact-disparate-treatment\n\n## Metadata\n\n- **Migration Status**: Ontology block enriched on 2025-11-12\n- **Last Updated**: 2025-11-12\n- **Review Status**: Comprehensive editorial review\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable",
  "properties": {
    "id": "disparate-impact-ontology",
    "collapsed": "true",
    "- public-access": "true",
    "- ontology": "true",
    "- term-id": "AI-0381",
    "- preferred-term": "Disparate Impact",
    "- source-domain": "ai",
    "- status": "approved",
    "- version": "1.0",
    "- last-updated": "2025-11-18",
    "- definition": "Disparate Impact represents a legal doctrine and form of indirect discrimination occurring when facially neutral policies, practices, or algorithmic systems disproportionately affect protected groups (race, color, religion, sex, national origin, age, disability, genetics, veteran status) regardless of discriminatory intent, originating from US Title VII employment law (EEOC Uniform Guidelines 1978) and extended to UK Equality Act 2010 and EU anti-discrimination frameworks. The doctrine is quantified through statistical analysis comparing selection rates, approval rates, or outcome rates between protected and unprotected groups using the four-fifths rule (80 percent rule), which establishes that disparate impact exists when the selection rate for a protected group falls below 80 percent of the rate for the highest-performing group, calculated as a disparate impact ratio. Legal frameworks distinguish disparate impact (unintentional discriminatory outcomes from neutral policies) from disparate treatment (intentional direct discrimination based on protected characteristics), with disparate impact analysis focusing on statistical evidence of differential outcomes rather than proof of discriminatory intent. Defenses against disparate impact claims include business necessity (US) - demonstrating that the challenged practice is job-related and consistent with business necessity - and proportionate means (UK/EU) - showing that the practice constitutes a proportionate means of achieving a legitimate aim. In AI and algorithmic systems, disparate impact analysis requires statistical testing of model predictions across demographic groups, identification of less discriminatory alternative models or decision thresholds, documentation of business justification for algorithmic criteria, and compliance with sector-specific regulations in employment (EEOC enforcement), lending (Equal Credit Opportunity Act), insurance (state insurance codes), and housing (Fair Housing Act). As of September 2025, EEOC enforcement policy shifted following Executive Order 14281, substantially reducing federal disparate impact enforcement while state and private litigation continue, as analyzed in recent legal scholarship and civil rights policy commentary.",
    "- maturity": "mature",
    "- source": "[[EEOC Uniform Guidelines 1978]], [[UK Equality Act 2010]], [[EU Anti-Discrimination Directives]], [[Sage Journals 2024 Legal-Empirical Disparate Impact]], [[Britannica Disparate Impact]]",
    "- authority-score": "0.95"
  },
  "backlinks": [],
  "wiki_links": [
    "UK Equality Act 2010",
    "Britannica Disparate Impact",
    "AIFairness",
    "ConceptualLayer",
    "EU Anti-Discrimination Directives",
    "Sage Journals 2024 Legal-Empirical Disparate Impact",
    "EEOC Uniform Guidelines 1978",
    "US EEOC Uniform Guidelines",
    "AIEthicsDomain"
  ],
  "ontology": {
    "term_id": "AI-0381",
    "preferred_term": "Disparate Impact",
    "definition": "Disparate Impact represents a legal doctrine and form of indirect discrimination occurring when facially neutral policies, practices, or algorithmic systems disproportionately affect protected groups (race, color, religion, sex, national origin, age, disability, genetics, veteran status) regardless of discriminatory intent, originating from US Title VII employment law (EEOC Uniform Guidelines 1978) and extended to UK Equality Act 2010 and EU anti-discrimination frameworks. The doctrine is quantified through statistical analysis comparing selection rates, approval rates, or outcome rates between protected and unprotected groups using the four-fifths rule (80 percent rule), which establishes that disparate impact exists when the selection rate for a protected group falls below 80 percent of the rate for the highest-performing group, calculated as a disparate impact ratio. Legal frameworks distinguish disparate impact (unintentional discriminatory outcomes from neutral policies) from disparate treatment (intentional direct discrimination based on protected characteristics), with disparate impact analysis focusing on statistical evidence of differential outcomes rather than proof of discriminatory intent. Defenses against disparate impact claims include business necessity (US) - demonstrating that the challenged practice is job-related and consistent with business necessity - and proportionate means (UK/EU) - showing that the practice constitutes a proportionate means of achieving a legitimate aim. In AI and algorithmic systems, disparate impact analysis requires statistical testing of model predictions across demographic groups, identification of less discriminatory alternative models or decision thresholds, documentation of business justification for algorithmic criteria, and compliance with sector-specific regulations in employment (EEOC enforcement), lending (Equal Credit Opportunity Act), insurance (state insurance codes), and housing (Fair Housing Act). As of September 2025, EEOC enforcement policy shifted following Executive Order 14281, substantially reducing federal disparate impact enforcement while state and private litigation continue, as analyzed in recent legal scholarship and civil rights policy commentary.",
    "source_domain": "ai",
    "maturity_level": null,
    "authority_score": 0.95
  }
}