{
  "title": "Distributed Identity",
  "content": "- ### OntologyBlock\n  id:: distributed-identity-ontology\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: mv-432362532415\n\t- preferred-term:: Distributed Identity\n\t- source-domain:: metaverse\n\t- status:: active\n\t- public-access:: true\n\t- definition:: A component of the metaverse ecosystem focusing on distributed identity.\n\t- maturity:: mature\n\t- authority-score:: 0.85\n\t- owl:class:: mv:DistributedIdentity\n\t- owl:physicality:: VirtualEntity\n\t- owl:role:: Object\n\t- belongsToDomain:: [[MetaverseDomain]]\n\t- #### Relationships\n\t  id:: distributed-identity-relationships\n\t\t- is-part-of:: [[VirtualWorld]], [[MetaversePlatform]]\n\t\t- requires:: [[DigitalIdentity]], [[AuthenticationService]]\n\t\t- enables:: [[SocialInteraction]], [[Presence]], [[UserRepresentation]]\n\t\t- has-property:: [[Appearance]], [[Customization]], [[Animation]]\n\n\t- #### OWL Axioms\n\t  id:: distributed-identity-owl-axioms\n\t  collapsed:: true\n\t\t- ```clojure\n\t\t  Declaration(Class(mv:DistributedIdentity))\n\n\t\t  # Classification\n\t\t  SubClassOf(mv:DistributedIdentity mv:VirtualEntity)\n\t\t  SubClassOf(mv:DistributedIdentity mv:Object)\n\n\t\t  # Domain classification\n\t\t  SubClassOf(mv:DistributedIdentity\n\t\t    ObjectSomeValuesFrom(mv:belongsToDomain mv:MetaverseDomain)\n\t\t  )\n\n\t\t  # Annotations\n\t\t  AnnotationAssertion(rdfs:label mv:DistributedIdentity \"Distributed Identity\"@en)\n\t\t  AnnotationAssertion(rdfs:comment mv:DistributedIdentity \"A component of the metaverse ecosystem focusing on distributed identity.\"@en)\n\t\t  AnnotationAssertion(dcterms:identifier mv:DistributedIdentity \"mv-432362532415\"^^xsd:string)\n\t\t  ```\n\npublic:: true\n\n- #Public page\n\t- automatically published\n- For distributed Web3, and by extension metaverse applications toflourish it is necessary to solve the identificationproblem.[[king1966fisher]] Without a [solution tothis](https://joshgans.medium.com/web3-isnt-going-to-work-without-identification-6aa776d674)bots, scammers, and AI actors will reduce usefulness and usability ofand already quite arcane user experience.\n- This page is an oddity because most of traditional DID/SSI isn't really fit for purpose. Distributed self sovereign identity has a great elevator pitch though. Individuals should be empowered through technology to manage their own data, without manipulation or exploitation by centralised corporate behemoths. In practice it’s a staggeringly complex proposition which increases risk to the individual,decreases convenience, and despite much work, does not even make muchsense in it’s own terms. Webs of trust are viable so this means Nostr,[Marking](https://github.com/project-bitmark/marking/wiki#marking), orpubky which will be discussed, but are early products.\n- ## Applications of DID/SSI\n\t- Some of the likely, and discussed applications for DID/SSI are the moreinherently private and personally valuable sets of data an individualmight generate throughout their life. The theory is that subsets of suchdata could then be digitally revealed by the individual when required,and that cryptographic verification built into the system wouldguarantee the veracity of the data to the receiving party. It is alsopossible to make use of “zero-knowledge proof” such that assertions canbe made about about the contents of the data without revealing the dataitself. A good example of this an age verification challenge, where athreshold age could be asserted without necessarily revealing the dateof birth. Other keystone uses of the technology are:\n\t\t- Health documents history\n\t\t- Qualifications and certifications\n\t\t- Financial record and relationships with those of others\n\t\t- Contacts, connections to other people and their appropriate data, including things like shared and personal calendars\n\t- It’s also possible to extend this key management ethos to all logincredentials, and all data currently stored on centralised servers. Thisis the tension discussed in the chapter about Web3. Proponents thinkthat using something like a DID/SSI stack to manage encryption,decryption and access to data within cloud services gives the user thebest of all worlds. They see simply logging in with a cryptographicwallet, and using that same public/private key pair to manage the databeyond as some kind of panacea. This is very complex stuff though, andit seems very likely they just haven’t thought this through enough.\n- ## Classic DID/SSI\n\t- Distributed identity / self sovereign identity has been extensivelyresearched for decades, with hundreds of peer reviewed papers, andextensive support from the [world wide webconsortium](https://www.w3.org/TR/did-core/). The academic field nowseems quite ossified and has settled on a couple of hundred ‘schema’which they feel underpin the next layer of development. It is a [complexfield](https://medium.com/decentralized-identity/overview-of-decentralized-identity-standards-f82efd9ab6c7),and the language and diagrams are arcane and self referential.\n\t- ![Figure 5.1: Part of the DID SSI specs](../assets/did.jpg)\n\t- Moreover the minimal implementation of such proposed systems hints ata [federated model](https://www.w3.org/community/perma-id/) of[centralised/federated‘truth’](https://github.com/w3c/vc-data-model/issues/947#issuecomment-1276186406)to enable persistence of identifiers over time.  The major failing of the DID/SSI work to date is a lack of meaningfuluse cases with incentives for adoption.\n\t- This is clearly explained byLockwood[[lockwood2021exploring]] who proposes that the pathway toadoption of ‘classic’ DID/SSI requires an incentive over and above thecurrent identity management on the web. Being distributed is not enough.Especially in the light of questionable assurances of this even beingtrue.\n\t- Perhaps most concerning is this [recentexchange](https://lists.w3.org/Archives/Public/public-credentials/2022Mar/thread.html) on the mailing lists. Here, two long standing developers of DID say the following:  it“Not a single entity I know that’s doing production deployments hasactually vetted did:ion and found it to be production capable. This goes for every DLT-based DID Method out there\n\t\t- even the one we’re working on. I am highly sceptical of anyone that says that any DID Method is ready for production usage at present.  Agreed — as one of the proponents of DLTs (in particular permissionless public ones) none are mature enough yet for production.”. It seems then that we can rule out use of these technologies?\n\t- ### DID principles\n\t\t- The core principles of distributed identity are that there should bepersistent identifiers, like real world documents which assert identity,but with extended use cases. These should be permanent, and resolvableeverywhere, forever. Underpinning this is cryptographically verifiableand decentralised data, managed by the user, or their trusted proxy. Asprimitives this makes them lifetime digital assets, that are portable,and unconfiscatable, with no required reliance on a trusted third party.By this stage in the book you should be familiar with these concepts,but application of this fundamental mindset to all personal data anddigital interactions is a bigger reach even than money and value.\n\t\t- #### What’s in a DID document?\n\t\t- All classic DID is underpinned by a DID document what bootstrap theservices it’s connected to. It is made up of one or more public keys.The documents can make use of services such as timestamps, cryptographicsignatures, proofs, delegations, and authorisations. They should containthe minimum amount of information to accomplish the specific taskrequired of them.\n\t- ### Federated social media trust\n\t\t- This section about newer technologies is perhaps best [summarised byJackDorsey](https://www.getrevue.co/profile/jackjack/issues/a-native-internet-protocol-for-social-media-1503112?via=twitter-card&client=DesktopWeb&element=issue-card),ex CEO of twitter, paraphrased here:\n\t\t\t- \"I’ll start with the principles I’ve come to believe based on everything I’ve learned and experienced through my past actions as a Twitter co-founder and Lead:\n\t\t\t\t- Social media must be resilient to corporate and government control.\n\t\t\t\t- Only the original author may remove content they produce.\n\t\t\t\t- Moderation is best implemented by algorithmic choice.\n\t\t\t- The biggest mistake I made was continuing to invest in building tools for us to manage the public conversation versus building tools for the people using Twitter to easily manage it for themselves this burdened the company with too much power and opened us to significant outside pressure such as advertising budgets. I generally think companies have become far too powerful. The only way I know of to truly live up tot hese three principles is a free and open protocol for social media that is not owned by a single company or group of companies and is resilient to corporate and government influence the problem today is that we have companies who own both the protocol and discovery of content which ultimately puts one person in charge of what’s available and seen or not this is by definition a single point of failure no matter how great the person and over time will fracture the public conversation and may lead to more control by governments and corporations around the world.\"\n\t\t- The following technologies were selected for this book long beforeDorsey wrote those words, but they itare the technologies in which he isinvesting his time and money to further those 3 principles. Keybase isan interesting example of how proofs ont he internet can lean upon oneanother to provide a corpus of trusts. It provides a model of [importingproofs](https://book.keybase.io/account#proofs) from various socialmedia sites. This allows importing of reputation into new ecosystems.\n\t- ### RGB SSI\n\t\t- [ssi/README.md at master · LNP-BP/ssi (github.com)](https://github.com/LNP-BP/ssi/blob/master/README.md)\n\t- ### Microstrategy Inscription based DID\n\t\t- [did:btc Method Specification (microstrategy.github.io)](https://microstrategy.github.io/did-btc-spec/)\n\t- ### Lightning\n\t\t- It is possible to log into a website using only Lighting, as in [StackerNews](https://stacker.news/login?callbackUrl=https://stacker.news/).\n\t- ### Web5, Bluesky, & Microsoft ION\n\t\t- Promisingly Jack Dorsey’s company TBD is working on a project [called“Web5”](https://developer.tbd.website/projects/web5/). Details are scantbut the promise is decentralised and/or self hosted data and identityrunning on Bitcoin, without recourse to a new token. it“Componentsinclude decentralized identifiers (DIDs), decentralized web node (DWNs),self-sovereign identity service (SSIS) and a self-sovereign identitysoftware development kit (ssi-sdk)”.\n\t\t- Web5 leverages the ION identity stack. All this looks to be exactly whatour metaverse system requires, but the complexity is likely to be quitehigh as it is to be built on existing DID/SSI research which is prettycomplex and perhaps has problems.\n\t\t- They readily admit they [do not have a workingsolution](https://atproto.com/guides/identity) at this time: it“Atpresent, none of the DID methods meet our standards fully. Many existingDID networks are permissionless blockchains which achieve the abovegoals but with relatively poor latency (ION takes roughly 20 minutes forcommitment finality). Therefore we have chosen to support did-web and atemporary method we’ve created called did-placeholder. We expect thissituation to evolve as new solutions emerge.”\n\t\t- #### ION\n\t\t- While working at Microsoft on ION Daniel Buchner (now working at Square)or Henry Tsai [said thefollowing](https://github.com/decentralized-identity/ion/blob/master/docs/Q-and-A.md),which is worth quoting verbatim:\n\t\t\t- “While ledger-based consensus systems, on the surface, would seem toprovide the same general features as one another, there are a few keydifferences that make some more suitable for critical applications, likethe decentralized identifiers of human beings. Some of theseconsiderations and features are:\n\t\t\t\t- The system must be open and permissionless, not a cabal of authorities who can exclude and remove participants.\n\t\t\t\t- The system must be well-tested, and proven secure against attack over a long enough duration to be confident in.\n\t\t\t\t- The system must produce a singular, independently verifiable record that is as immutable as possible, so that reversing the record the system produces is infeasible.\n\t\t\t\t- The system must be widely deployed, with nodes that span the globe, to ensure the record is persisted.\n\t\t\t\t- The system must be self-incentivized, so that nodes continue to operate, process, and secure the record over time. The value from operation must come from the system directly, because outside incentive reliance is itself a vector for attack.\n\t\t\t\t- The cost to attack the system through any game theoretically available means must be high enough that it is infeasible to attempt, and even if an ultra-capitalized attacker did, it would require a weaponized mobilization of force and resources that would be obvious, with options for mitigation.\n\t\t\t\t- The outcome:\n\t\t\t\t\t- Number 1 eliminates private and permissioned ledgers\n\t\t\t\t\t- Number 2 eliminates just about all other ledgers and blockchains, simply because they are inadequately tested\n\t\t\t\t\t- For the metrics detailed in 3-6, Bitcoin is so far beyond all other options, it isn’t even close\n\t\t- Bitcoin is the most secure option by an absurdly large margin.”\n\t\t- On the surface then it might seem that the choice is Bitcoin again, and indeed that the open source Microsoft ION stack is a natural choice, but it’s complex to run, the interactions with the blockchain have a cost implication which can’t be surmounted without every user owning some Bitcoin, and as we have seen, there is no formal validation of this system. In addition (in the current implementation) an identity proof does not need to be published to be valid, just timestamped. In this way an identity can be stolen and used years later to claim later chains of proof. It seems that it might be somewhat useful ‘at scale’ and is worth additional monitoring and investigation, especially given it’s integration into TBD\n\t\t- Web5.\n\t- ### pubky\n\t\t- [pubky](https://github.com/pubky) (previously slashtags) is a distributed identity open method being developed by Bitfinex and Tether under the Synonym suite. It’s origins date back to2011 and was initially seeded through academia, and government innovation grants to build on the concepts of BitTorrent, and later [DAT](https://dat-ecosystem.org/timeline.html). This eventually became the Hypercore protocol, with an additional rebranding to Holepunch in2021. It is essentially this system, a mobile app UX, and Bitcoin integration which forms the Synonym/pubky stack. There is a lot ofhistorical investment, new focus, and promising product design in theSynonym ecosystem which is forming about the this ‘web of trust’distributed data system. The suite will rely on Pear Credits to enableTether dollars to be passed around within the system. This may fosteradoption in emerging markets. The critical path nature of the Tetherintegration, and the complex intermingling of Synonym, Hypercore,Bitfinex, Tether, and Pear credits are potentially red flags, and thoughthe technology stack is quite interesting only Pear Credit are reallyuseful to our design.\n\t- ### CivKit\n\t\t- CivKit, short for Civilization Kit, is an upcoming white paper from[Commerceblock](https://www.commerceblock.com/), discussing adecentralized and unstoppable free market solution based on Bitcoin. Theproject aims to build on top of Bitcoin to create an environment whereanyone can trade anything with anyone else.\n\t\t- Phase one focuses on creating a marketplace built on top of Nostr, aninteroperable communication protocol. This allows different serviceslike Paxful, HODL HODL, or Nostr app to communicate and operate acrosseach other.\n\t\t- Phase two aims to develop a mobile-friendly lightning wallet anddecentralized IDs (Know Your Peer) to replace centralized KYC (Know YourCustomer). This will provide a more secure and private environment fortraders.\n\t\t- CivKit is intended to be an open-source decentralized toolkit thatvarious brands and platforms can build on top of. The goal is tofacilitate peer-to-peer trading and encourage a more circular economywhere people earn and spend Bitcoin rather than buying and selling it.While details are sparse it seems possible that this technology can beintegrated into our systems.\n\t- ### Nostr\n\t\t- Nostr (pronounced no-star) is a [decentralized openprotocol](https://www.nostr.how/) that aims to improve the social mediaexperience by addressing issues of censorship and data collection. Theprotocol operates by allowing users to post and view notes on serverscalled relays, and view and post these notes through apps calledclients. The open nature of the protocol allows for competition and afree flow of information, as users can choose to use different relays orclients if they are censored. This is because the protocol isdecentralized and controlled by no one.\n\t\t- The decentralized nature of Nostr means that there is no centralauthority that can control the flow of information. This is achievedthrough the use of relays and clients, which are run by differentindividuals or entities. Users have the freedom to choose which relaysand clients they want to use, and as a result, their feeds are populatedwith content from the people they choose to follow. If a relay or clienttries to censor a user, they can simply switch to a different one. Thisis a major advantage over traditional centralized social media platformswhere one entity holds all the control over the flow of information andcan censor or manipulate the content that users see.\n\t\t- Nostr is also not beholden to shareholders or investors. This means thatthe protocol can make decisions that prioritize the well-being andquality of discourse for users, rather than solely focusing on profit.This is in contrast to traditional social media networks like Twitter,Facebook, and TikTok, which are driven by the need to collect data onusers and sell ads to generate revenue. In these centralized platforms,users’ data is collected, analyzed and sold to the highest bidder, oftenwithout the user’s knowledge or consent. Nostr, on the other hand,allows users to have more control over their data and the ability tomonetize their content.\n\t\t- Nostr also tightly integrates Bitcoin Lightning to support the protocol.This will hopefully enable secure transmission of value alongside theinformation and interactions on the platform. It also gives users theability to monetise their content.\n\t\t- This potential step-change improvement to the social media experiencefor everyday people addresses issues of censorship and data collection.\n\t\t- Nostr is “The simplest open protocol that is able to create acensorship-resistant global \"social\" network once and for all.”according to it’s [github page](https://github.com/fiatjaf/nostr). Morethan that it’s a client side validated proof of who a user isinteracting with, hence being in this identity section. To be clear,it’s not a completely peer to peer system in that it uses (very dumb)relay servers, but this gives it some of the best characteristics ofboth paradigms. This has the following advantages for our metaverseapplication;\n\t\t\t- it’s lightweight, with minimal network overhead and complexity\n\t\t\t- it’s real-time using websockets\n\t\t\t- anyone can run a relay server, so one can be run in the deployment in the final section of the book.\n\t\t\t- Each of the client peers connecting to the metaverse can be a relay and able to pass messages and proofs to the other clients without the metaverse server seeing the data or being online\n\t\t\t- it’s open-source\n\t\t\t- it is itself [Turing Complete](https://snort.social/e/note1evkdgcg0dw8ckyqsqhnk4wy55h7w97twjf8etcq2tr9sv5urlszqjc9p6v) and therefore able to execute any code within it’s message protocol\n\t\t\t- there are multiple usable libraries and tools\n\t\t\t- it’s under active development with an excellent team. The lead, ‘Fiatjaf’ is one of the most [prolific developers](https://github.com/fiatjaf) in the lightning space.\n\t\t\t- it’s based on the same underlying cryptographic technology we are using elsewhere, indeed with it’s use of Bitcoin keys the identity system is global\n\t\t\t- it provides the identity proof that we need to validate users and objects into a virtual space\n\t\t\t- it enables message passing\n\t\t\t- it scales to be a social network as required\n\t\t\t- it need not rely on anything outside of a relay hosted on the metaverse server\n\t\t\t- it can be scaled to provide one to many bulletin board style applications within the metaverse\n\t\t\t- we can use it in private, group, and public modes as required\n\t\t\t- it integrates with the torrent network allowing storage and external referencing of arbitrary data\n\t\t\t- it can easily operate outside of the walled garden of the metaverse, extending the reach of the messages\n\t\t- [Nostr is incredibly promising](https://www.forbes.com/sites/rogerhuang/2022/12/29/nostr-is-the-decentralized-protocol-that-might-replace-elon-musks-twitter/),and integrating these relays in the metaverse servers and clients of theproposed technology stack in this book might allow us globally provableidentity, with privacy by design. It can provide message passing. If allentities in the collaborative mixed reality scenegraphs are also Nostrkey pairs then schema can be applied consistently with the economiclayer using the same key system as Bitcoin. Nostr has just received asubstantial grant from Dorsey. It is core to the design later in thebook. A curated list of projects and libraries is [available ongithub](https://github.com/aljazceru/awesome-nostr).\n\t\t- Luke Childs [says](https://github.com/nostr-protocol/nips/issues/154):\n\t\t\t- “Nostr makes a good candidate to be used as a very simple DID layer.Having \"Login with Nostr\" auth on websites solves a lot of problems in avery elegant way, and Nostr’s main use case as a social network protocolmakes it highly suited to be used as your main identity proving key.Compare \"Login with Nostr\" to similar \"Login with Lightning\"(LNURL-auth) specs to see some easy and obvious advantages:  Remote signer vs local signer  Login with Lightning requires access to remote keys, login with Nostrrequires access to local keys ideally stored in a browser extension. Dueto the way Lightning works you can only really have one instance. Youneed all your client devices linked to a single Lightning node, thismeans most clients will be connecting to the signer remotely. Now ifyour Lightning node goes down or you lose your connection you also can’tauth with any service. This could cause circular dependencies where youlose the connection to your Lightning node so you can’t auth with theservices you need to access to debug the issue with your Lightning nodelike your hosting provider or VPN account. You could technically solvethis by replicating your LN keys to other client devices only to be usedfor local auth signing but that introduces other risks.  Unique identifier vs identity  A Lightning node is not really an identity but a unique identifier. Itjust tells you the person that auths is the same random person thatauthed last time, it doesn’t tell you who they are. A nostr pubkey is anidentity. It tells you who they are, what their name is, what they looklike, who they know, how you can pay them, how you can message them.  This is much more useful as an identity layer for an application. Theapplication can show their profile picture, username, send secure crossplatform push notifications via NIP-04 encrypted Nostr DMs, etc.  Consistent identity across services  Lightning pubkeys are sensitive private information and can leakconfidential financial information, Nostr pubkeys are safe to share withanyone. LNURL-auth adds extra steps to solve this by creating derivedsubkeys for identities that are unique to each service you auth with.This does not seem ideal, it seems the default case is that an identityis something that you do want to follow you across all your accounts.Nostr based auth behaves more appropriate in this regard. In the rarecase you need to achieve privacy and separation between certain servicesyou can still do that by using use a throwaway Nostr key for thoseservices.  User relationships across services Since authing with Nostr shares areal social identity with the service, they can also see your Nostrsocial graph. This could be useful for connecting you to people youalready know on the new service.  Low cost identity  Ideally identities should be easy to create but hard to build upreputation to limit spam while avoiding excluding people from thenetwork. It’s not clear that it will be cost effective / scalable foreveryone to run their own Lightning node so tying individual identity toa single Lightning node pubkey is problematic. Nostr keys are easy tocreate and hard reputation can be earned via PoW/DNS or building astrong social graph.”\n- ### Micropayment based web\n- It seems the war against disinformation is now being lost. Much iswritten in the media about Deepfake technology creating plausible fakevideos, but probably more pernicious is the use of toolkits to createentire plausible fake news sites using natural language AI such as GPT3.This makes it cheap to publish potentially market moving news which isthen rehypothecated by online news vendors who are hungry for clicks. Asthese pipelines become more mature it will be difficult to keep fakenews for financial or political gain out of the system. One interestingway to do this that itisn’t webs of trust or true cryptographic identityis to charge micropayments for “one to many” publication models. Thiswould imply a tiny instant payment for clicks, especially on socialmedia sites such as twitter. This kind of model has been discussed butis only possible in the context of systems such as Lightning whereinstant micropayment can be realised. It seems possible that this wouldprice out speculative ‘noise’ spam from the information space. It’sinteresting and ironic that the origin of proof of work was to underpinjust such a spam defeating system,[[dwork1992pricing]] and that Nakamoto[mentioned this application forBitcoin](https://www.metzdowd.com/pipermail/cryptography/2009-January/015014.html)back in 2009. There is now much chatter about the integration of Bitcoinwith Twitter in light of Musks buyout of the social network.\n- ![]./assets/68114e388f76f1dc94eb3a6205c2c1dbee1c9f7a.jpg\n-\n- ![Figure 5.3: Comparison of distributed file stores](../assets/files.jpg)\n- # Continuity is close on:\n\t- web \n\t  -> webid (identity) \n\t  -> solid (social) -> solid lite (lite,modern,working \n\t  -> nosdav (add nostr, and mastodon etc.)\n-\n- Repeat section?\n-\n- Distributed Identity & Trust----------------------------\n- For distributed Web3, and by extension metaverse applications toflourish it is necessary to solve the identificationproblem.[[king1966fisher]] Without a [solution tothis](https://joshgans.medium.com/web3-isnt-going-to-work-without-identification-6aa776d674)bots, scammers, and AI actors will reduce usefulness and usability ofand already quite arcane user experience.\n- This chapter is an oddity because most of traditional DID/SSI isn’treally fit for purpose. Distributed self sovereign identity has a greatelevator pitch though. Individuals should be empowered throughtechnology to manage their own data, without manipulation orexploitation by centralised corporate behemoths. In practice it’s astaggeringly complex proposition which increases risk to the individual,decreases convenience, and despite much work, does not even make muchsense in it’s own terms. Webs of trust are viable so this means Nostr,[Marking](https://github.com/project-bitmark/marking/wiki#marking), orpubky which will be discussed, but are early products.\n- ### Applications of DID/SSI\n- Some of the likely, and discussed applications for DID/SSI are the moreinherently private and personally valuable sets of data an individualmight generate throughout their life. The theory is that subsets of suchdata could then be digitally revealed by the individual when required,and that cryptographic verification built into the system wouldguarantee the veracity of the data to the receiving party. It is alsopossible to make use of “zero-knowledge proof” such that assertions canbe made about about the contents of the data without revealing the dataitself. A good example of this an age verification challenge, where athreshold age could be asserted without necessarily revealing the dateof birth. Other keystone uses of the technology are:\n-\n\t- health documents history\n-\n\t- qualifications and certifications\n-\n\t- financial record and relationships with those of others\n-\n\t- contacts, connections to other people and their appropriate data, including things like shared and personal calendars\n- It’s also possible to extend this key management ethos to all logincredentials, and all data currently stored on centralised servers. Thisis the tension discussed in the chapter about Web3. Proponents thinkthat using something like a DID/SSI stack to manage encryption,decryption and access to data within cloud services gives the user thebest of all worlds. They see simply logging in with a cryptographicwallet, and using that same public/private key pair to manage the databeyond as some kind of panacea. This is very complex stuff though, andit seems very likely they just haven’t thought this through enough.\n- ### Classic DID/SSI\n- Distributed identity / self sovereign identity has been extensivelyresearched for decades, with hundreds of peer reviewed papers, andextensive support from the [world wide webconsortium](https://www.w3.org/TR/did-core/). The academic field nowseems quite ossified and has settled on a couple of hundred ‘schema’which they feel underpin the next layer of development. It is a [complexfield](https://medium.com/decentralized-identity/overview-of-decentralized-identity-standards-f82efd9ab6c7),and the language and diagrams are arcane and self referential as seen inFigure<a href=\"#fig:DID\" data-reference-type=\"ref\" data-reference=\"fig:DID\">5.1</a>.\n- <span class=\"image\">Part of the DID SSI specs</span>\n- . Moreover the minimal implementation of such proposed systems hints ata [federated model](https://www.w3.org/community/perma-id/) of[centralised/federated‘truth’](https://github.com/w3c/vc-data-model/issues/947#issuecomment-1276186406)to enable persistence of identifiers over time.  The major failing of the DID/SSI work to date is a lack of meaningfuluse cases with incentives for adoption. This is clearly explained byLockwood[[lockwood2021exploring]] who proposes that the pathway toadoption of ‘classic’ DID/SSI requires an incentive over and above thecurrent identity management on the web. Being distributed is not enough.Especially in the light of questionable assurances of this even beingtrue.  Perhaps most concerning is this [recentexchange](https://lists.w3.org/Archives/Public/public-credentials/2022Mar/thread.html)on the mailing lists. Here, two long standing developers of DID say thefollowing:  it“Not a single entity I know that’s doing production deployments hasactually vetted did:ion and found it to be production capable. This goesfor every DLT-based DID Method out there\n\t- even the one we’re workingon. I am highly sceptical of anyone that says that any DID Method isready for production usage at present.  Agreed — as one of the proponents of DLTs (in particular permissionlesspublic ones) none are mature enough yet for production.”. It seems thenthat we can rule out use of these technologies?\n- ##### DID principles\n- The core principles of distributed identity are that there should bepersistent identifiers, like real world documents which assert identity,but with extended use cases. These should be permanent, and resolvableeverywhere, forever. Underpinning this is cryptographically verifiableand decentralised data, managed by the user, or their trusted proxy. Asprimitives this makes them lifetime digital assets, that are portable,and unconfiscatable, with no required reliance on a trusted third party.By this stage in the book you should be familiar with these concepts,but application of this fundamental mindset to all personal data anddigital interactions is a bigger reach even than money and value.\n- ##### What’s in a DID document?\n- All classic DID is underpinned by a DID document what bootstrap theservices it’s connected to. It is made up of one or more public keys.The documents can make use of services such as timestamps, cryptographicsignatures, proofs, delegations, and authorisations. They should containthe minimum amount of information to accomplish the specific taskrequired of them.\n- ### Federated social media trust\n- This section about newer technologies is perhaps best [summarised byJackDorsey](https://www.getrevue.co/profile/jackjack/issues/a-native-internet-protocol-for-social-media-1503112?via=twitter-card&client=DesktopWeb&element=issue-card),ex CEO of twitter, paraphrased here:  it\n- “I’ll start with the principles I’ve come to believe based on everythingI’ve learned and experienced through my past actions as a Twitterco-founder and Lead:\n-\n\t- Social media must be resilient to corporate and government control.\n-\n\t- Only the original author may remove content they produce.\n-\n\t- Moderation is best implemented by algorithmic choice.\n- The biggest mistake I made was continuing to invest in building toolsfor us to manage the public conversation versus building tools for thepeople using Twitter to easily manage it for themselves this burdenedthe company with too much power and opened us to significant outsidepressure such as advertising budgets. I generally think companies havebecome far too powerful. The only way I know of to truly live up tothese three principles is a free and open protocol for social media thatis not owned by a single company or group of companies and is resilientto corporate and government influence the problem today is that we havecompanies who own both the protocol and discovery of content whichultimately puts one person in charge of what’s available and seen or notthis is by definition a single point of failure no matter how great theperson and over time will fracture the public conversation and may leadto more control by governments and corporations around the world.\n- The following technologies were selected for this book long beforeDorsey wrote those words, but they itare the technologies in which he isinvesting his time and money to further those 3 principles. Keybase isan interesting example of how proofs ont he internet can lean upon oneanother to provide a corpus of trusts. It provides a model of [importingproofs](https://book.keybase.io/account#proofs) from various socialmedia sites. This allows importing of reputation into new ecosystems.\n- #### Lightning\n- It is possible to log into a website using only Lighting, as in [StackerNews](https://stacker.news/login?callbackUrl=https://stacker.news/).\n- #### Web5, Bluesky, & Microsoft ION\n- Promisingly Jack Dorsey’s company TBD is working on a project [called“Web5”](https://developer.tbd.website/projects/web5/). Details are scantbut the promise is decentralised and/or self hosted data and identityrunning on Bitcoin, without recourse to a new token. it“Componentsinclude decentralized identifiers (DIDs), decentralized web node (DWNs),self-sovereign identity service (SSIS) and a self-sovereign identitysoftware development kit (ssi-sdk)”.\n- Web5 leverages the ION identity stack. All this looks to be exactly whatour metaverse system requires, but the complexity is likely to be quitehigh as it is to be built on existing DID/SSI research which is prettycomplex and perhaps has problems.\n- They readily admit they [do not have a workingsolution](https://atproto.com/guides/identity) at this time: it“Atpresent, none of the DID methods meet our standards fully. Many existingDID networks are permissionless blockchains which achieve the abovegoals but with relatively poor latency (ION takes roughly 20 minutes forcommitment finality). Therefore we have chosen to support did-web and atemporary method we’ve created called did-placeholder. We expect thissituation to evolve as new solutions emerge.”\n- ##### ION\n- While working at Microsoft on ION Daniel Buchner (now working at Square)or Henry Tsai [said thefollowing](https://github.com/decentralized-identity/ion/blob/master/docs/Q-and-A.md),which is worth quoting verbatim:\n- “While ledger-based consensus systems, on the surface, would seem toprovide the same general features as one another, there are a few keydifferences that make some more suitable for critical applications, likethe decentralized identifiers of human beings. Some of theseconsiderations and features are:\n-\n\t- The system must be open and permissionless, not a cabal of authorities who can exclude and remove participants.\n-\n\t- The system must be well-tested, and proven secure against attack over a long enough duration to be confident in.\n-\n\t- The system must produce a singular, independently verifiable record that is as immutable as possible, so that reversing the record the system produces is infeasible.\n-\n\t- The system must be widely deployed, with nodes that span the globe, to ensure the record is persisted.\n-\n\t- The system must be self-incentivized, so that nodes continue to operate, process, and secure the record over time. The value from operation must come from the system directly, because outside incentive reliance is itself a vector for attack.\n-\n\t- The cost to attack the system through any game theoretically available means must be high enough that it is infeasible to attempt, and even if an ultra-capitalized attacker did, it would require a weaponized mobilization of force and resources that would be obvious, with options for mitigation.\n- The outcome:\n-\n\t- Number 1 eliminates private and permissioned ledgers\n-\n\t- Number 2 eliminates just about all other ledgers and blockchains, simply because they are inadequately tested\n-\n\t- For the metrics detailed in 3-6, Bitcoin is so far beyond all other options, it isn’t even close\n\t- Bitcoin is the most secure option by an absurdly large margin.”\n- On the surface then it might seem that the choice is Bitcoin again, andindeed that the open source Microsoft ION stack is a natural choice, butit’s complex to run, the interactions with the blockchain have a costimplication which can’t be surmounted without every user owning someBitcoin, and as we have seen, there is no formal validation of thissystem. In addition (in the current implementation) an identity proofdoes not need to be published to be valid, just timestamped. In this wayan identity can be stolen and used years later to claim later chains ofproof. It seems that it might be somewhat useful ‘at scale’ and is worthadditional monitoring and investigation, especially given it’sintegration into TBD\n\t- Web5.\n- #### pubky\n- [[Pubky]] is a distributed identity open method being developed byBitfinex and Tether under the Synonym suite. It’s origins date back to2011 and was initially seeded through academia, and governmentinnovation grants to build on the concepts of BitTorrent, and later[DAT](https://dat-ecosystem.org/timeline.html). This eventually becamethe Hypercore protocol, with an additional rebranding to Holepunch in2021. It is essentially this system, a mobile app UX, and Bitcoinintegration which forms the Synonym/pubky stack. There is a lot ofhistorical investment, new focus, and promising product design in theSynonym ecosystem which is forming about the this ‘web of trust’distributed data system. The suite will rely on Pear Credits to enableTether dollars to be passed around within the system. This may fosteradoption in emerging markets. The critical path nature of the Tetherintegration, and the complex intermingling of Synonym, Hypercore,Bitfinex, Tether, and Pear credits are potentially red flags, and thoughthe technology stack is quite interesting only Pear Credit are reallyuseful to our design.\n- #### CivKit\n- CivKit, short for Civilization Kit, is an upcoming white paper from[Commerceblock](https://www.commerceblock.com/), discussing adecentralized and unstoppable free market solution based on Bitcoin. Theproject aims to build on top of Bitcoin to create an environment whereanyone can trade anything with anyone else.\n- Phase one focuses on creating a marketplace built on top of Nostr, aninteroperable communication protocol. This allows different serviceslike Paxful, HODL HODL, or Nostr app to communicate and operate acrosseach other.\n- Phase two aims to develop a mobile-friendly lightning wallet anddecentralized IDs (Know Your Peer) to replace centralized KYC (Know YourCustomer). This will provide a more secure and private environment fortraders.\n- CivKit is intended to be an open-source decentralized toolkit thatvarious brands and platforms can build on top of. The goal is tofacilitate peer-to-peer trading and encourage a more circular economywhere people earn and spend Bitcoin rather than buying and selling it.While details are sparse it seems possible that this technology can beintegrated into our systems.\n- #### Nostr\n- Nostr \\[pronounced no-star\\] is a [decentralized openprotocol](https://www.nostr.how/) that aims to improve the social mediaexperience by addressing issues of censorship and data collection. Theprotocol operates by allowing users to post and view notes on serverscalled relays, and view and post these notes through apps calledclients. The open nature of the protocol allows for competition and afree flow of information, as users can choose to use different relays orclients if they are censored. This is because the protocol isdecentralized and controlled by no one.\n- The decentralized nature of Nostr means that there is no centralauthority that can control the flow of information. This is achievedthrough the use of relays and clients, which are run by differentindividuals or entities. Users have the freedom to choose which relaysand clients they want to use, and as a result, their feeds are populatedwith content from the people they choose to follow. If a relay or clienttries to censor a user, they can simply switch to a different one. Thisis a major advantage over traditional centralized social media platformswhere one entity holds all the control over the flow of information andcan censor or manipulate the content that users see.\n- Nostr is also not beholden to shareholders or investors. This means thatthe protocol can make decisions that prioritize the well-being andquality of discourse for users, rather than solely focusing on profit.This is in contrast to traditional social media networks like Twitter,Facebook, and TikTok, which are driven by the need to collect data onusers and sell ads to generate revenue. In these centralized platforms,users’ data is collected, analyzed and sold to the highest bidder, oftenwithout the user’s knowledge or consent. Nostr, on the other hand,allows users to have more control over their data and the ability tomonetize their content.\n- Nostr also tightly integrates Bitcoin Lightning to support the protocol.This will hopefully enable secure transmission of value alongside theinformation and interactions on the platform. It also gives users theability to monetise their content.\n- This potential step-change improvement to the social media experiencefor everyday people addresses issues of censorship and data collection.\n- Nostr is “The simplest open protocol that is able to create acensorship-resistant global \"social\" network once and for all.”according to it’s [github page](https://github.com/fiatjaf/nostr). Morethan that it’s a client side validated proof of who a user isinteracting with, hence being in this identity section. To be clear,it’s not a completely peer to peer system in that it uses (very dumb)relay servers, but this gives it some of the best characteristics ofboth paradigms. This has the following advantages for our metaverseapplication;\n-\n\t- it’s lightweight, with minimal network overhead and complexity\n-\n\t- it’s real-time using websockets\n-\n\t- anyone can run a relay server, so one can be run in the deployment in the final section of the book.\n-\n\t- Each of the client peers connecting to the metaverse can be a relay and able to pass messages and proofs to the other clients without the metaverse server seeing the data or being online\n-\n\t- it’s open-source\n-\n\t- it is itself [Turing Complete](https://snort.social/e/note1evkdgcg0dw8ckyqsqhnk4wy55h7w97twjf8etcq2tr9sv5urlszqjc9p6v) and therefore able to execute any code within it’s message protocol\n-\n\t- there are multiple usable libraries and tools\n-\n\t- it’s under active development with an excellent team. The lead, ‘Fiatjaf’ is one of the most [prolific developers](https://github.com/fiatjaf) in the lightning space.\n-\n\t- it’s based on the same underlying cryptographic technology we are using elsewhere, indeed with it’s use of Bitcoin keys the identity system is global\n-\n\t- it provides the identity proof that we need to validate users and objects into a virtual space\n-\n\t- it enables message passing\n-\n\t- it scales to be a social network as required\n-\n\t- it need not rely on anything outside of a relay hosted on the metaverse server\n-\n\t- it can be scaled to provide one to many bulletin board style applications within the metaverse\n-\n\t- we can use it in private, group, and public modes as required\n-\n\t- it integrates with the torrent network allowing storage and external referencing of arbitrary data\n-\n\t- it can easily operate outside of the walled garden of the metaverse, extending the reach of the messages\n- [Nostr is incrediblypromising](https://www.forbes.com/sites/rogerhuang/2022/12/29/nostr-is-the-decentralized-protocol-that-might-replace-elon-musks-twitter/),and integrating these relays in the metaverse servers and clients of theproposed technology stack in this book might allow us globally provableidentity, with privacy by design. It can provide message passing. If allentities in the collaborative mixed reality scenegraphs are also Nostrkey pairs then schema can be applied consistently with the economiclayer using the same key system as Bitcoin. Nostr has just received asubstantial grant from Dorsey. It is core to the design later in thebook. A curated list of projects and libraries is [available ongithub](https://github.com/aljazceru/awesome-nostr).\n- Luke Childs [says](https://github.com/nostr-protocol/nips/issues/154):it“Nostr makes a good candidate to be used as a very simple DID layer.Having \"Login with Nostr\" auth on websites solves a lot of problems in avery elegant way, and Nostr’s main use case as a social network protocolmakes it highly suited to be used as your main identity proving key.Compare \"Login with Nostr\" to similar \"Login with Lightning\"(LNURL-auth) specs to see some easy and obvious advantages:  Remote signer vs local signer  Login with Lightning requires access to remote keys, login with Nostrrequires access to local keys ideally stored in a browser extension. Dueto the way Lightning works you can only really have one instance. Youneed all your client devices linked to a single Lightning node, thismeans most clients will be connecting to the signer remotely. Now ifyour Lightning node goes down or you lose your connection you also can’tauth with any service. This could cause circular dependencies where youlose the connection to your Lightning node so you can’t auth with theservices you need to access to debug the issue with your Lightning nodelike your hosting provider or VPN account. You could technically solvethis by replicating your LN keys to other client devices only to be usedfor local auth signing but that introduces other risks.  Unique identifier vs identity  A Lightning node is not really an identity but a unique identifier. Itjust tells you the person that auths is the same random person thatauthed last time, it doesn’t tell you who they are. A nostr pubkey is anidentity. It tells you who they are, what their name is, what they looklike, who they know, how you can pay them, how you can message them.  This is much more useful as an identity layer for an application. Theapplication can show their profile picture, username, send secure crossplatform push notifications via NIP-04 encrypted Nostr DMs, etc.  Consistent identity across services  Lightning pubkeys are sensitive private information and can leakconfidential financial information, Nostr pubkeys are safe to share withanyone. LNURL-auth adds extra steps to solve this by creating derivedsubkeys for identities that are unique to each service you auth with.This does not seem ideal, it seems the default case is that an identityis something that you do want to follow you across all your accounts.Nostr based auth behaves more appropriate in this regard. In the rarecase you need to achieve privacy and separation between certain servicesyou can still do that by using use a throwaway Nostr key for thoseservices.  User relationships across services Since authing with Nostr shares areal social identity with the service, they can also see your Nostrsocial graph. This could be useful for connecting you to people youalready know on the new service.  Low cost identity  Ideally identities should be easy to create but hard to build upreputation to limit spam while avoiding excluding people from thenetwork. It’s not clear that it will be cost effective / scalable foreveryone to run their own Lightning node so tying individual identity toa single Lightning node pubkey is problematic. Nostr keys are easy tocreate and hard reputation can be earned via PoW/DNS or building astrong social graph.”  Figure<a href=\"#fig:starhistory\" data-reference-type=\"ref\" data-reference=\"fig:starhistory\">5.2</a>shows that the adoption is potentially tremendously fast.\n  ![]./assets/431d39316d5fa17f89fa9e1154fa2a267517a245.png\n  An illustration of the enthusiasm for Nostr compared to traditional DID based on GitHub ‘stars’.\n- This provides a web interface into the metaverse providing:\n-\n\t- simple cryptographic identity assurance\n-\n\t- private peer to peer chat\n-\n\t- group chats and channels\n-\n\t- email to private message relay\n-\n\t- links into media on web hosts\n- The pace of development on Nostr is dizzying. Peer to peer video andaudio will allow us to link metaverse instances, between peers, throughapplications such as [Monstr](https://monstr.app/).\n- It’s notable that Nostr has it’s own inexpensive [hardware signingdevice](https://github.com/lnbits/nostr-signing-device) to protectidentity in situations where this might be necessary.  bfThe proposed integration of Nostr social media and messaging, alightning layer with digital objects such as Fedimint, Zerosync or RGB,AI agents, Vircadia, and federated Bitcoin is the core value propositionof this book. This work pre-dates [Meta andZuckerbergs](https://www.theverge.com/2023/4/26/23699633/mark-zuckerberg-meta-generative-ai-chatbots-instagram-facebook-whatsapp)stated intent in this regard by 18 months, and is differentiated stillby our focus on emerging markets and decentralisation.\n- ##### NIP-05\n- At this time, the nascent identity layer in nostr leans on NIP-05. Thisis a distributed identity management system that maps Nostr keys toDNS-based internet identifiers. In events of kind 0 (setmetadata), the“nip05” key can have an internet identifier as its value. Clients splitthe identifier into the local part and domain and make a GET request tothe specified URL. The response should be a JSON document with a “names”key containing a mapping of names to hex-formatted public keys. If thepublic key matches the one from the setmetadata event, the clientaccepts the association and considers the “nip05” identifier valid.\n- Clients may find users’ public keys from internet identifiers by firstfetching the well-known URL and then checking for a matching “nip05”.When following public keys, clients must prioritize the keys over NIP-05addresses. Public keys must be in hex format. Clients can enable userdiscovery through search boxes, allowing users to find profiles byentering internet identifiers. The identifier can be used as the “root”identifier, displayed as just the domain. The protocol supports bothdynamic and static servers by using the local part as a query string.\n- ##### Nostr Protocol as the keystone\n- The Nostr protocol can be used to store and share valuable contentacross the network. This is ably demonstrated by the [‘Highlighter’project](https://highlighter.com/) which allows users to store importantnotes from around the web using nostr. In the context of our federatedsocial media trust model, the Nostr protocol can serve as the underlyinglayer that connects various instances of virtual spaces, thus enablingseamless data exchange and interoperability among them. Highlighterdemonstrates that nostr events can be leveraged to create, store, andinteract with valuable across networks. By utilizing this concept, wecan extend the functionality to support federated social media trust,allowing users to carry their reputation, identity, and cryptographicproofs across different virtual spaces and social media platforms.\n- ##### Nostr marketplace in LnBits\n- The nostr [markets plugin](https://github.com/lnbits/nostrmarket) forLnBits allows virtual ‘stalls’ to be setup and payment to be mediatedthrough nostr. This is obviously a great expansion to the usefulness ofour integration\n- ##### Integrating Cryptographic Proofs and Reputation\n- To create a trusted environment within the federated network, we mustestablish a mechanism for importing and verifying cryptographic proofsfrom various sources, such as social media sites and other digitalplatforms. By doing so, we enable users to bring their existingreputation and trust from these platforms into the new ecosystem, thusfacilitating trust-based interactions and collaboration within thenetwork. We can leverage the Nostr protocol and the NIP05 specificationto import these cryptographic proofs, creating a secure and verifiablesystem for identity management and trust propagation. The NIP05specification allows for the creation and verification of identityproofs within the Nostr protocol, thus enabling the seamless integrationof trust and reputation data from external sources.\n- By utilizing the Nostr protocol as the underlying layer, we canestablish connections between objects, people, and AI actors within thefederated network. This interconnected ecosystem allows for seamlesscollaboration, information sharing, and trust-based interactions amongall participants. The open-source collaboration infrastructure wepropose can facilitate the development of various applications andservices that leverage the federated network, such as virtualworkspaces, AI-assisted creativity tools, and more. The uncensorablenature of this protocol further supports the inclusivity andaccessibility we feel so important, ensuring that participants fromdifferent regions and backgrounds can take part in the digital societyand contribute to its growth.\n- This federated social media trust model, built on the Nostr protocol,allows for the establishment of a robust, inclusive, and trust-basednetwork that connects various virtual spaces, social media platforms,and AI systems. By leveraging the lessons learned from the otherattempts in the space, and by maximising the inclusion of externalcryptographic proofs from multiple sources, we can create acomprehensive trust system that fosters collaboration, innovation, andshared growth within the digital society.\n- The Nostr protocol, with its decentralized and open-source nature,provides a solid foundation for linking and federating objects, people,and AI actors across collaborative spaces in digital society. Byleveraging the Nostr protocol, we can build a robust and trust-basednetwork that interconnects various virtual spaces, social mediaplatforms, and AI systems. One of the key aspects of this trust-basednetwork is the ability to import cryptographic proofs from differentsources, similar to Keybase’s approach to importing proofs from varioussocial media sites [(KeybaseProofs)](https://book.keybase.io/account#proofs).\n- ##### StrFry relays\n- The Stirfry relay software provides high-performance infrastructure forbuilding decentralized social media applications on top of the Nosterprotocol. As an open source project written in C++, Stirfry emphasizesefficiency, flexibility, and community-driven governance.\n- At the core of Stirfry is its high-speed database engine. Rather thanusing a traditional SQL database, Stirfry implements the LightningMemory-Mapped Database (LMDB)\n\t- an embedded key-value store optimizedfor performance. Reads are lock-free, enabling unlimited parallel querythroughput. Writes require only a short-held lock, ensuring minimalinterference. LMDB’s \"shadow paging\" design allows isolated read-onlytransactions via multi-version concurrency control (MVCC). This preventsreads from blocking writes and vice versa.\n- To maximize database performance, Stirfry stores Noster events directlyin FlatBuffers\n\t- an efficient binary format allowing direct accesswithout serialization. The original JSON payloads are preserved tofacilitate transmission back to clients. Additional database files indexevents on fields like timestamps and authors, accelerating filterqueries. Periodic compaction optimizes the layout for faster operations.\n- Stirfry adopts a multi-threaded, modular architecture. A websocketthread accepts new client connections and routes incoming requests. Aningester thread validates and pre-processes each request before passingto appropriate handlers. Doing signature checks and filter compilationupfront avoids repeating work. A single writer thread batches databasewrites to amortize transaction overhead. Multiple worker threads handleread queries, fairly scheduling between long and short requests.Dedicated monitor threads track active filters and stream matchingevents to subscribed clients. Passing messages between threads insteadof sharing data structures improves efficiency.\n- Additional features further enhance Stirfry’s capabilities. Gracefulshutdown support allows stopping new connections while existing onescomplete. Hot configuration reloading provides runtime updates withoutrestarting. Flexible write policy plugins enable custom contentmoderation. Streaming websocket compression and Zstandard dictionariescompress traffic. Syncing protocols like Negentropy facilitate efficientrelay replication, powering mesh network topologies. Geo-replication bythe relay.org community offers low latency worldwide access. The customTemplar HTML templating library assists crafting simple, fastdecentralized frontends.\n- ### Micropayment based web\n- It seems the war against disinformation is now being lost. Much iswritten in the media about Deepfake technology creating plausible fakevideos, but probably more pernicious is the use of toolkits to createentire plausible fake news sites using natural language AI such as GPT3.This makes it cheap to publish potentially market moving news which isthen rehypothecated by online news vendors who are hungry for clicks. Asthese pipelines become more mature it will be difficult to keep fakenews for financial or political gain out of the system. One interestingway to do this that itisn’t webs of trust or true cryptographic identityis to charge micropayments for “one to many” publication models. Thiswould imply a tiny instant payment for clicks, especially on socialmedia sites such as twitter. This kind of model has been discussed butis only possible in the context of systems such as Lightning whereinstant micropayment can be realised. It seems possible that this wouldprice out speculative ‘noise’ spam from the information space. It’sinteresting and ironic that the origin of proof of work was to underpinjust such a spam defeating system,[[dwork1992pricing]] and that Nakamoto[mentioned this application forBitcoin](https://www.metzdowd.com/pipermail/cryptography/2009-January/015014.html)back in 2009. There is now much chatter about the integration of Bitcoinwith Twitter in light of Musks buyout of the social network.\n  ![]./assets/68114e388f76f1dc94eb3a6205c2c1dbee1c9f7a.jpg\n  Comparison of distributed file stores\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Metaverse platforms continue to evolve with focus on interoperability and open standards\n  - Web3 integration accelerating with decentralised identity and asset ownership\n  - Enterprise adoption growing in virtual collaboration, training, and digital twins\n  - UK companies increasingly active in metaverse development and immersive technologies\n\n- Technical capabilities\n  - Real-time rendering at photorealistic quality levels\n  - Low-latency networking enabling seamless multi-user experiences\n  - AI-driven content generation and procedural world building\n  - Spatial audio and haptics enhancing immersion\n\n- UK and North England context\n  - Manchester: Digital Innovation Factory supports metaverse startups and research\n  - Leeds: Holovis leads in immersive experiences for entertainment and training\n  - Newcastle: University research in spatial computing and interactive systems\n  - Sheffield: Advanced manufacturing using digital twin technology\n\n- Standards and frameworks\n  - Metaverse Standards Forum driving interoperability protocols\n  - WebXR enabling browser-based immersive experiences\n  - glTF and USD for 3D asset interchange\n  - Open Metaverse Interoperability Group defining cross-platform standards\n\n## Metadata\n\n- **Last Updated**: 2025-11-16\n- **Review Status**: Automated remediation with 2025 context\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable",
  "properties": {
    "id": "distributed-identity-owl-axioms",
    "collapsed": "true",
    "- ontology": "true",
    "- term-id": "mv-432362532415",
    "- preferred-term": "Distributed Identity",
    "- source-domain": "metaverse",
    "- status": "active",
    "- public-access": "true",
    "- definition": "A component of the metaverse ecosystem focusing on distributed identity.",
    "- maturity": "mature",
    "- authority-score": "0.85",
    "- owl:class": "mv:DistributedIdentity",
    "- owl:physicality": "VirtualEntity",
    "- owl:role": "Object",
    "- belongsToDomain": "[[MetaverseDomain]]",
    "- is-part-of": "[[VirtualWorld]], [[MetaversePlatform]]",
    "- requires": "[[DigitalIdentity]], [[AuthenticationService]]",
    "- enables": "[[SocialInteraction]], [[Presence]], [[UserRepresentation]]",
    "- has-property": "[[Appearance]], [[Customization]], [[Animation]]",
    "public": "true"
  },
  "backlinks": [
    "Suggested Reading Order",
    "Soon-Next-Later (AI futurology)",
    "Public Key",
    "Public Key - CORRECTED",
    "BC-0037-public-key",
    "Agentic Alliance"
  ],
  "wiki_links": [
    "SocialInteraction",
    "AuthenticationService",
    "MetaverseDomain",
    "MetaversePlatform",
    "dwork1992pricing",
    "Pubky",
    "Appearance",
    "Presence",
    "king1966fisher",
    "lockwood2021exploring",
    "DigitalIdentity",
    "VirtualWorld",
    "Customization",
    "UserRepresentation",
    "Animation"
  ],
  "ontology": {
    "term_id": "mv-432362532415",
    "preferred_term": "Distributed Identity",
    "definition": "A component of the metaverse ecosystem focusing on distributed identity.",
    "source_domain": "metaverse",
    "maturity_level": null,
    "authority_score": 0.85
  }
}