{
  "title": "Energy and Power",
  "content": "- ### OntologyBlock\n  id:: energy-and-power-ontology\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: mv-961582748519\n\t- preferred-term:: Energy and Power\n\t- source-domain:: metaverse\n\t- status:: active\n\t- public-access:: true\n\t- definition:: A component of the metaverse ecosystem focusing on energy and power.\n\t- maturity:: mature\n\t- authority-score:: 0.85\n\t- owl:class:: mv:EnergyAndPower\n\t- owl:physicality:: ConceptualEntity\n\t- owl:role:: Concept\n\t- belongsToDomain:: [[MetaverseDomain]]\n\t- #### Relationships\n\t  id:: energy-and-power-relationships\n\t\t- enables:: [[ImmersiveExperience]], [[Presence]], [[SpatialComputing]]\n\t\t- requires:: [[DisplayTechnology]], [[TrackingSystem]], [[RenderingEngine]]\n\t\t- bridges-to:: [[HumanComputerInteraction]], [[ComputerVision]], [[Robotics]]\n\n\t- #### OWL Axioms\n\t  id:: energy-and-power-owl-axioms\n\t  collapsed:: true\n\t\t- ```clojure\n\t\t  Declaration(Class(mv:EnergyAndPower))\n\n\t\t  # Classification\n\t\t  SubClassOf(mv:EnergyAndPower mv:ConceptualEntity)\n\t\t  SubClassOf(mv:EnergyAndPower mv:Concept)\n\n\t\t  # Domain classification\n\t\t  SubClassOf(mv:EnergyAndPower\n\t\t    ObjectSomeValuesFrom(mv:belongsToDomain mv:MetaverseDomain)\n\t\t  )\n\n\t\t  # Annotations\n\t\t  AnnotationAssertion(rdfs:label mv:EnergyAndPower \"Energy and Power\"@en)\n\t\t  AnnotationAssertion(rdfs:comment mv:EnergyAndPower \"A component of the metaverse ecosystem focusing on energy and power.\"@en)\n\t\t  AnnotationAssertion(dcterms:identifier mv:EnergyAndPower \"mv-961582748519\"^^xsd:string)\n\t\t  ```\n\npublic:: true\n\n- # Data Centres and AI\n\t- Energy Grid Challenges:\n\t\t- Growing demand from AI/data centers, industrial onshoring, and electrification is straining power grids\n\t\t- Google have reported a 48% increase in emissions in 5 years, [google-2024-environmental-report.pdf (gstatic.com)](https://www.gstatic.com/gumdrop/sustainability/google-2024-environmental-report.pdf)\n\t\t- Utilities face challenges in forecasting and meeting rapidly increasing electricity needs\n\t\t- Grid infrastructure upgrades and expansion are needed but face regulatory and financing hurdles\n\t- AI and Data Centers:\n\t\t- AI is driving unprecedented growth in data center power consumption\n\t\t- Data center siting now prioritizes access to abundant, reliable, and ideally clean energy sources\n\t\t- Efficiency gains in data centers are offset by rapidly increasing computational demands\n\t- Renewable Energy Integration:\n\t\t- Push for net-zero emissions conflicts with urgent need for more power generation\n\t\t- Intermittency of renewables creates grid stability challenges\n\t\t- Energy storage technologies (batteries, pumped hydro) are critical but still limited in scale\n\t- Geopolitical Implications:\n\t\t- Race for AI supremacy driving national investments in compute infrastructure\n\t\t- Control of energy resources and supply chains impacts AI/tech competitiveness\n\t\t- Potential for energy constraints to limit economic growth and technological progress\n\t- Grid Modernization:\n\t\t- Need for more flexible, resilient \"smart grid\" to handle variable renewables and distributed resources\n\t\t- Microgrids and demand response can help but won't fully replace centralized grid\n\t\t- Regulatory reforms required to enable new grid technologies and business models\n\t- Energy-AI Feedback Loop:\n\t\t- AI enables more efficient grid management and integration of renewables\n\t\t- But also drives massive increase in energy demand through data centers\n\t\t- Net impact on energy consumption and emissions remains uncertain\n- # Private Nuclear\n\t- [AI turning nuclear power plants into prime DC real-estate • The Register](https://www.theregister.com/2024/03/25/ai_boom_nuclear/) [[Convergence]] [[Energy and Power]] [[Artificial Intelligence]]\n\t- [Google signs nuclear power deal with startup Kairos - Insider Paper](https://insiderpaper.com/google-signs-nuclear-power-deal-with-startup-kairos/)\n\t- Constellation signed a 20-year power purchase agreement (PPA) with Microsoft to restart Three Mile Island Unit 1, which had been shut down since 2019 for economic reasons. The plant faced competition from cheaper natural gas due to the fracking boom, leading to its closure.\n\t- Unlike other nuclear plants in the region, Three Mile Island was a single-unit facility, which contributed to higher operational costs compared to multi-unit plants. The plant's reputation was affected by the 1979 meltdown of Unit 2, impacting public perception of nuclear energy.\n\t- The plant required significant investments (estimated $1.6 billion) for upgrades to restart and operate efficiently. Projected annual revenue from the PPA is estimated at £800 million, with potential profits being several hundred million, depending on operational costs.\n\t- ### Costs and Benefits\n\t\t- Energy Market Dynamics: The reliance on fluctuating energy markets poses risks for nuclear power, which has high fixed costs and is best suited for baseload power generation.\n\t\t- Tech Companies' Role: Big tech firms initially claimed 100% renewable energy while relying heavily on fossil fuels, leading to credibility issues and increased demand for stable power sources.\n\t\t- Offshore Wind vs. Nuclear: Offshore wind projects are generally more expensive (£140-£260 per megawatt hour) and do not provide the guaranteed power delivery that nuclear can, especially critical for large data centres.\n\t\t- Reliability of Power Supply: Nuclear energy offers a more reliable power source compared to intermittent renewable sources, particularly for meeting peak demand.\n\t\t- The successful restart of Three Mile Island could pave the way for new nuclear projects, leveraging existing sites and infrastructure.\n\t\t- Low-Hanging Fruit: Several unfinished nuclear plants across the U.S. could be viable candidates for completion due to their existing permits and infrastructure.\n\t\t- The changing stance of tech companies toward nuclear energy reflects a broader acceptance of nuclear as a clean energy source, potentially influencing future energy policy.\n\t\t- Impact on Energy Prices: As nuclear plants resume operation, the energy market dynamics may shift, leading to higher electricity prices for consumers while providing significant revenue for operators.\n- # Bitcoin and AI data centres\n\t- ![Bitcoin electricity consumption](https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Bitcoin_electricity_consumption.svg/1920px-Bitcoin_electricity_consumption.svg.png)\n\t-\n\t- Bitcoin miners like Iris Energy are uniquely positioned with access to large amounts of power and data center capacity. This is becoming increasingly scarce and valuable as demand for AI computing grows exponentially.\n\t- The Bitcoin mining data centers can be repurposed to provide AI cloud services by swapping out Bitcoin mining ASICs for Nvidia GPUs. This allows miners to monetize their power and infrastructure for both crypto mining and AI.\n\t- There are parallels between the Bitcoin ASIC and AI GPU markets - both have a dominant player (Bitmain for ASICs, Nvidia for GPUs) and prices are set based on what the market is willing to pay vs cost of production.\n\t- The growth in AI seems to be shifting the narrative and reducing criticism around Bitcoin mining's energy use. As people realize AI's value, they accept that the energy use is justified, similar to Bitcoin.\n\t- Major banks like Morgan Stanley are now writing serious research reports on how Bitcoin miners are positioned to support AI's growth by providing much-needed power capacity. This validates the industry's maturity.\n\t- Time to accessing power is becoming the key constraint and source of value as demand for AI computing capacity far outstrips supply. Bitcoin miners with existing power access have a major advantage.\n\t- By locating in areas with excess renewable energy that can't be fully exported, Bitcoin miners are actually helping make these renewable installations more economically viable and efficient.\n\t- [Mike Alfred on X: \"Morgan Stanley out with new research suggesting that BTC miners are the fastest path to put new data centers online because they already have access to huge amounts of power. Their models show BTC miners trade at a large discount to the intrinsic value of their secured power. https://t.co/rwJJLBPdYN\" / X (twitter.com)](https://twitter.com/mikealfred/status/1781333730071896152)\n\t- {{twitter https://twitter.com/mikealfred/status/1781333730071896152}}\n\t-\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Metaverse platforms continue to evolve with focus on interoperability and open standards\n  - Web3 integration accelerating with decentralised identity and asset ownership\n  - Enterprise adoption growing in virtual collaboration, training, and digital twins\n  - UK companies increasingly active in metaverse development and immersive technologies\n\n- Technical capabilities\n  - Real-time rendering at photorealistic quality levels\n  - Low-latency networking enabling seamless multi-user experiences\n  - AI-driven content generation and procedural world building\n  - Spatial audio and haptics enhancing immersion\n\n- UK and North England context\n  - Manchester: Digital Innovation Factory supports metaverse startups and research\n  - Leeds: Holovis leads in immersive experiences for entertainment and training\n  - Newcastle: University research in spatial computing and interactive systems\n  - Sheffield: Advanced manufacturing using digital twin technology\n\n- Standards and frameworks\n  - Metaverse Standards Forum driving interoperability protocols\n  - WebXR enabling browser-based immersive experiences\n  - glTF and USD for 3D asset interchange\n  - Open Metaverse Interoperability Group defining cross-platform standards\n\n## Metadata\n\n- **Last Updated**: 2025-11-16\n- **Review Status**: Automated remediation with 2025 context\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable",
  "properties": {
    "id": "energy-and-power-owl-axioms",
    "collapsed": "true",
    "- ontology": "true",
    "- term-id": "mv-961582748519",
    "- preferred-term": "Energy and Power",
    "- source-domain": "metaverse",
    "- status": "active",
    "- public-access": "true",
    "- definition": "A component of the metaverse ecosystem focusing on energy and power.",
    "- maturity": "mature",
    "- authority-score": "0.85",
    "- owl:class": "mv:EnergyAndPower",
    "- owl:physicality": "ConceptualEntity",
    "- owl:role": "Concept",
    "- belongsToDomain": "[[MetaverseDomain]]",
    "- enables": "[[ImmersiveExperience]], [[Presence]], [[SpatialComputing]]",
    "- requires": "[[DisplayTechnology]], [[TrackingSystem]], [[RenderingEngine]]",
    "- bridges-to": "[[HumanComputerInteraction]], [[ComputerVision]], [[Robotics]]",
    "public": "true"
  },
  "backlinks": [
    "Leopold Aschenbrenner",
    "Blockchain",
    "Private Key",
    "BC-0037-public-key",
    "BC-0036-private-key",
    "Energy and Power"
  ],
  "wiki_links": [
    "Convergence",
    "MetaverseDomain",
    "RenderingEngine",
    "Artificial Intelligence",
    "Robotics",
    "Presence",
    "Energy and Power",
    "HumanComputerInteraction",
    "SpatialComputing",
    "TrackingSystem",
    "ImmersiveExperience",
    "DisplayTechnology",
    "ComputerVision"
  ],
  "ontology": {
    "term_id": "mv-961582748519",
    "preferred_term": "Energy and Power",
    "definition": "A component of the metaverse ecosystem focusing on energy and power.",
    "source_domain": "metaverse",
    "maturity_level": null,
    "authority_score": 0.85
  }
}