{
  "title": "Human Centred Values",
  "content": "- ### OntologyBlock\n  id:: human-centred-values-ontology\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: AI-0159\n\t- preferred-term:: Human Centred Values\n\t- source-domain:: ai\n\t- status:: draft\n    - public-access:: true\n\n\n### Relationships\n- is-subclass-of:: [[AIGovernance]]\n\t- definition:: AI systems should be designed and operated in ways that respect the rule of law, human rights, democratic values and diversity, with appropriate safeguards to ensure human determination and control over consequential decisions (human agency), whilst incorporating mechanisms to protect fairness and human dignity.\n\n\n\n## Academic Context & Current Developments\n\n# Human Centred Values in Artificial Intelligence: Current State (2024–2025)\n\nHuman centred values in AI refer to the principle that AI systems should be designed and operated in ways that respect the rule of law, human rights, democratic values, and diversity, with appropriate safeguards to ensure human determination and control over consequential decisions (human agency), whilst incorporating mechanisms to protect fairness and human dignity. This approach is increasingly central to global AI policy, industry practice, and academic research.\n\n---\n\n## 1. Current Developments\n\nThe period 2024–2025 has seen a marked shift towards embedding human centred values into the core of AI development and deployment. Key trends include:\n\n- **Increased regulatory activity**: Governments worldwide have intensified efforts to regulate AI in line with human rights and democratic principles. In 2024, U.S. federal agencies introduced 59 AI-related regulations—more than double the number in 2023—and issued by twice as many agencies. Similar regulatory momentum is evident in the EU, UK, and Asia-Pacific regions ([Stanford HAI, 2025 AI Index Report](https://hai.stanford.edu/ai-index/2025-ai-index-report)).\n\n- **Advancements in value alignment**: There is growing emphasis on AI value alignment—ensuring that AI systems act in accordance with shared human values and ethical principles. This includes tailoring AI to specific cultural, legal, and societal contexts, and engaging stakeholders from government, business, and civil society in the design process ([WEF, AI Value Alignment](https://www.weforum.org/stories/2024/10/ai-value-alignment-how-we-can-align-artificial-intelligence-with-human-values/)).\n\n- **New evaluation benchmarks**: The development of new benchmarks such as HELM Safety, AIR-Bench, and FACTS is enabling more rigorous assessment of AI systems for factuality, safety, and alignment with human values. These tools are helping to close the gap between recognising responsible AI (RAI) risks and taking meaningful action ([Stanford HAI, 2025 AI Index Report](https://hai.stanford.edu/ai-index/2025-ai-index-report)).\n\n- **Global cooperation on AI governance**: International organisations such as the OECD, EU, UN, and African Union have released frameworks focused on transparency, trustworthiness, and human centred values in AI. These frameworks are being adopted by governments and industry to guide responsible AI development ([OECD AI Principles](https://www.oecd.org/en/topics/sub-issues/ai-principles.html)).\n\n---\n\n## 2. Key Applications\n\nHuman centred values are being applied across a range of sectors, with notable use cases in:\n\n- **Healthcare**: AI systems are being designed to support, rather than replace, healthcare professionals. For example, platforms like Doctronic and Surgery Hero use AI to provide contextual insights and personalised advice, empowering both physicians and patients while maintaining human agency and oversight ([Tredence, Human Centered AI](https://www.tredence.com/blog/human-centered-ai)).\n\n- **Education**: Human centred AI is transforming education by creating personalised learning experiences that cater to individual student needs, while ensuring ethical use of technology and respect for student privacy ([Lindenwood University, Human-Centered AI](https://online.lindenwood.edu/blog/human-centered-ai-what-is-human-centric-artificial-intelligence/)).\n\n- **Business**: Companies are using AI to personalise marketing, streamline operations, and enhance customer satisfaction, all while ensuring transparency, fairness, and ethical decision-making. Human centred AI is helping businesses navigate the complex ethical landscape of AI adoption and build trust with customers and stakeholders ([Lindenwood University, Human-Centered AI](https://online.lindenwood.edu/blog/human-centered-ai-what-is-human-centric-artificial-intelligence/)).\n\n---\n\n## 3. Industry Standards\n\nSeveral international standards and frameworks have been developed to guide the implementation of human centred values in AI:\n\n- **OECD AI Principles**: These principles promote the use of AI that is innovative and trustworthy, respects human rights and democratic values, and includes mechanisms for human agency and oversight. They cover non-discrimination, equality, freedom, dignity, autonomy, privacy, diversity, fairness, social justice, and internationally recognised labour rights ([OECD AI Principles](https://www.oecd.org/en/topics/sub-issues/ai-principles.html)).\n\n- **UNESCO Recommendation on the Ethics of AI**: This recommendation provides a global framework for the ethical development and use of AI, with a focus on human rights, diversity, and the protection of human dignity ([UNESCO Ethics of AI](https://www.unesco.org/en/artificial-intelligence/recommendation-ethics)).\n\n- **EU AI Act**: The EU AI Act establishes a legal framework for AI that prioritises human centred values, including requirements for transparency, human oversight, and the protection of fundamental rights ([European Commission, AI Act](https://digital-strategy.ec.europa.eu/en/policies/european-approach-artificial-intelligence)).\n\n---\n\n## 4. Academic Literature\n\nRecent academic research has focused on the challenges and opportunities of aligning AI with human centred values:\n\n- Dignum, V. (2024). *AI Value Alignment: Guiding Artificial Intelligence Towards Shared Human Goals*. Global Future Council White Paper. This paper explores the technical and societal challenges of aligning AI with human values and provides recommendations for policymakers and practitioners ([WEF, AI Value Alignment](https://www.weforum.org/stories/2024/10/ai-value-alignment-how-we-can-align-artificial-intelligence-with-human-values/)).\n\n- Russell, S. (2024). *Humanity AI: Human-Centric Solutions for 2025*. AI Tool Report. This article discusses the shift from AI-first to human-first thinking and the importance of embedding ethical frameworks, transparency, and inclusivity in AI system design ([AI Tool Report, Humanity AI](https://www.theaireport.ai/articles/humanity-ai-human-centric-solutions-for-2025)).\n\n- Brookings Institution. (2024). *Hype and harm: Why we must ask harder questions about AI and its alignment with human values*. This article examines the ethical implications of AI and the need for robust mechanisms to ensure alignment with human values ([Brookings, Hype and Harm](https://www.brookings.edu/articles/hype-and-harm-why-we-must-ask-harder-questions-about-ai-and-its-alignment-with-human-values/)).\n\n---\n\n## 5. Notable Examples\n\nSeveral products, platforms, and organisations are leading the way in implementing human centred values in AI:\n\n- **Doctronic**: An AI platform that provides contextual insights to healthcare professionals, supporting rather than replacing human decision-making ([Tredence, Human Centered AI](https://www.tredence.com/blog/human-centered-ai)).\n\n- **Surgery Hero by C2-Ai**: An AI system that empowers patients to prepare for surgery with personalised, actionable advice, enhancing patient agency and control ([Tredence, Human Centered AI](https://www.tredence.com/blog/human-centered-ai)).\n\n- **OECD AI Principles**: Adopted by over 50 countries, these principles provide a global standard for the ethical development and use of AI ([OECD AI Principles](https://www.oecd.org/en/topics/sub-issues/ai-principles.html)).\n\n- **UNESCO Recommendation on the Ethics of AI**: This global framework is being implemented by governments and organisations worldwide to ensure that AI respects human rights and democratic values ([UNESCO Ethics of AI](https://www.unesco.org/en/artificial-intelligence/recommendation-ethics)).\n\n---\n\n## 6. Future Outlook\n\nThe future of human centred values in AI is likely to be shaped by several emerging trends:\n\n- **Greater emphasis on cultural and contextual adaptation**: As AI systems are deployed in diverse cultural and legal contexts, there will be a growing need to tailor AI to local values and norms.\n\n- **Enhanced stakeholder engagement**: Continuous engagement with governments, businesses, civil society, and the public will be essential to ensure that AI systems reflect and uphold shared human values.\n\n- **Development of new evaluation tools**: The creation of more sophisticated benchmarks and evaluation tools will enable more rigorous assessment of AI systems for alignment with human centred values.\n\n- **Increased global cooperation**: International collaboration on AI governance and standard-setting will continue to grow, with a focus on transparency, trustworthiness, and the protection of human rights and democratic values.\n\n- **Growing public awareness and demand for ethical AI**: As public awareness of AI’s ethical implications increases, there will be greater demand for AI systems that respect human centred values and protect human dignity.\n\n---\n\n**References**\n\n- OECD. (2019). *OECD AI Principles*. https://www.oecd.org/en/topics/sub-issues/ai-principles.html\n- UNESCO. (2021). *Recommendation on the Ethics of Artificial Intelligence*. https://www.unesco.org/en/artificial-intelligence/recommendation-ethics\n- World Economic Forum. (2024). *AI Value Alignment: Aligning AI with Human Values*. https://www.weforum.org/stories/2024/10/ai-value-alignment-how-we-can-align-artificial-intelligence-with-human-values/\n- Stanford HAI. (2025). *AI Index Report 2025*. https://hai.stanford.edu/ai-index/2025-ai-index-report\n- Lindenwood University. (2024). *Human-Centered AI: What Is Human-Centric Artificial Intelligence?* https://online.lindenwood.edu/blog/human-centered-ai-what-is-human-centric-artificial-intelligence/\n- Tredence. (2024). *Human Centered AI: Principles, Benefits, Challenges, and Industry*. https://www.tredence.com/blog/human-centered-ai\n- Brookings Institution. (2024). *Hype and harm: Why we must ask harder questions about AI and its alignment with human values*. https://www.brookings.edu/articles/hype-and-harm-why-we-must-ask-harder-questions-about-ai-and-its-alignment-with-human-values/\n\n\n## Related Resources\n\nFor more information, see:\n- [[Metaverse]]\n- [[MetaverseDomain]]\n\n\n## Citations & Sources\n\n1. [https://www.theaireport.ai/articles/humanity-ai-human-centric-solutions-for-2025](https://www.theaireport.ai/articles/humanity-ai-human-centric-solutions-for-2025)\n\n2. [https://www.weforum.org/stories/2024/10/ai-value-alignment-how-we-can-align-artificial-intelligence-with-human-values/](https://www.weforum.org/stories/2024/10/ai-value-alignment-how-we-can-align-artificial-intelligence-with-human-values/)\n\n3. [https://online.lindenwood.edu/blog/human-centered-ai-what-is-human-centric-artificial-intelligence/](https://online.lindenwood.edu/blog/human-centered-ai-what-is-human-centric-artificial-intelligence/)\n\n4. [https://www.tredence.com/blog/human-centered-ai](https://www.tredence.com/blog/human-centered-ai)\n\n5. [https://www.oecd.org/en/topics/sub-issues/ai-principles.html](https://www.oecd.org/en/topics/sub-issues/ai-principles.html)\n\n6. [https://hai.stanford.edu/ai-index/2025-ai-index-report](https://hai.stanford.edu/ai-index/2025-ai-index-report)\n\n7. [https://www.mckinsey.com/capabilities/quantumblack/our-insights/the-state-of-ai](https://www.mckinsey.com/capabilities/quantumblack/our-insights/the-state-of-ai)\n\n8. [https://www.unesco.org/en/artificial-intelligence/recommendation-ethics](https://www.unesco.org/en/artificial-intelligence/recommendation-ethics)\n\n9. [https://www.brookings.edu/articles/hype-and-harm-why-we-must-ask-harder-questions-about-ai-and-its-alignment-with-human-values/](https://www.brookings.edu/articles/hype-and-harm-why-we-must-ask-harder-questions-about-ai-and-its-alignment-with-human-values/)\n\n\n\n## Metadata\n\n- **Last Enriched**: 2025-11-11\n- **Enrichment Source**: Perplexity AI (Sonar)\n- **Verification Status**: Automated enrichment - human review recommended\n\n\n\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Metaverse platforms continue to evolve with focus on interoperability and open standards\n  - Web3 integration accelerating with decentralised identity and asset ownership\n  - Enterprise adoption growing in virtual collaboration, training, and digital twins\n  - UK companies increasingly active in metaverse development and immersive technologies\n\n- Technical capabilities\n  - Real-time rendering at photorealistic quality levels\n  - Low-latency networking enabling seamless multi-user experiences\n  - AI-driven content generation and procedural world building\n  - Spatial audio and haptics enhancing immersion\n\n- UK and North England context\n  - Manchester: Digital Innovation Factory supports metaverse startups and research\n  - Leeds: Holovis leads in immersive experiences for entertainment and training\n  - Newcastle: University research in spatial computing and interactive systems\n  - Sheffield: Advanced manufacturing using digital twin technology\n\n- Standards and frameworks\n  - Metaverse Standards Forum driving interoperability protocols\n  - WebXR enabling browser-based immersive experiences\n  - glTF and USD for 3D asset interchange\n  - Open Metaverse Interoperability Group defining cross-platform standards\n\n## Metadata\n\n- **Last Updated**: 2025-11-16\n- **Review Status**: Automated remediation with 2025 context\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable",
  "properties": {
    "id": "human-centred-values-ontology",
    "collapsed": "true",
    "- ontology": "true",
    "- term-id": "AI-0159",
    "- preferred-term": "Human Centred Values",
    "- source-domain": "ai",
    "- status": "draft",
    "- public-access": "true"
  },
  "backlinks": [
    "Human-Rights"
  ],
  "wiki_links": [
    "MetaverseDomain",
    "Metaverse",
    "AIGovernance"
  ],
  "ontology": {
    "term_id": "AI-0159",
    "preferred_term": "Human Centred Values",
    "definition": "AI systems should be designed and operated in ways that respect the rule of law, human rights, democratic values and diversity, with appropriate safeguards to ensure human determination and control over consequential decisions (human agency), whilst incorporating mechanisms to protect fairness and human dignity.",
    "source_domain": "ai",
    "maturity_level": null,
    "authority_score": null
  }
}