{
  "title": "infrastructure",
  "content": "- ### OntologyBlock\n  id:: infrastructure-ontology\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: mv-94823352766\n\t- preferred-term:: infrastructure\n\t- source-domain:: metaverse\n\t- status:: active\n\t- public-access:: true\n\t- definition:: A component of the metaverse ecosystem focusing on infrastructure.\n\t- maturity:: mature\n\t- authority-score:: 0.85\n\t- owl:class:: mv:Infrastructure\n\t- owl:physicality:: ConceptualEntity\n\t- owl:role:: Process\n\t- belongsToDomain:: [[MetaverseDomain]]\n\n\t- #### OWL Axioms\n\t  id:: infrastructure-owl-axioms\n\t  collapsed:: true\n\t\t- ```clojure\n\t\t  Declaration(Class(mv:Infrastructure))\n\n\t\t  # Classification\n\t\t  SubClassOf(mv:Infrastructure mv:ConceptualEntity)\n\t\t  SubClassOf(mv:Infrastructure mv:Process)\n\n\t\t  # Domain classification\n\t\t  SubClassOf(mv:Infrastructure\n\t\t    ObjectSomeValuesFrom(mv:belongsToDomain mv:MetaverseDomain)\n\t\t  )\n\n\t\t  # Annotations\n\t\t  AnnotationAssertion(rdfs:label mv:Infrastructure \"infrastructure\"@en)\n\t\t  AnnotationAssertion(rdfs:comment mv:Infrastructure \"A component of the metaverse ecosystem focusing on infrastructure.\"@en)\n\t\t  AnnotationAssertion(dcterms:identifier mv:Infrastructure \"mv-94823352766\"^^xsd:string)\n\t\t  ```\n\npublic:: true\n\n- #Public page\n\t- automatically published\n- [Microsoft to launch AI hub in London (msn.com)](https://www.msn.com/en-gb/money/technology/microsoft-to-launch-ai-hub-in-london/)\n\t- “I know – through my close work with thought leaders in the UK Government, business community and academia – that the country is committed to advancing AI responsibly and with a safety-first commitment to drive investment, innovation and economic growth,\" Suleyman wrote in a company blog post published on Monday. [[Privacy, Trust and Safety]]\n- [Microsoft to invest £2.5bn in UK to boost AI plans | The Independent](https://www.independent.co.uk/business/microsoft-to-invest-ps2-5bn-in-uk-to-boost-ai-plans-b2456219.html)\n- [Boost for UK AI as Microsoft unveils £2.5 billion investment\n\t- GOV.UK (www.gov.uk)](https://www.gov.uk/government/news/boost-for-uk-ai-as-microsoft-unveils-25-billion-investment)\n- HP thin client [Teradici Documentation and Downloads | Documents and Downloads for Teradici products](https://docs.teradici.com/knowledge)\n- [Fireworks - Generative AI For Product Innovation!](https://fireworks.ai/) - fine tuning and high speed inferencing\n-\n- ## Filesystems\n\t- ### Regata\n\t\t- [Regatta Storage – Mount your S3 bucket as a high performance, local file system.](https://regattastorage.com/)\n\t\t- |\n\t\t  Hey HN, I’m Hunter the founder of Regatta Storage ([https://regattastorage.com](https://regattastorage.com/)). Regatta Storage is a new cloud file system that provides unlimited pay-as-you-go capacity, local-like performance, and automatic synchronization to S3-compatible storage. For example, you can use Regatta to instantly access massive data sets in S3 with Spark, Pytorch, or pandas without paying for large, local disks or waiting for the data to download.Check out an overview of how the service works here: [https://www.youtube.com/watch?v=xh1q5p7E4JY](https://www.youtube.com/watch?v=xh1q5p7E4JY), and you can try it for free at [https://regattastorage.com](https://regattastorage.com/) after signing up for an account. e wanted to let you try it without an account, but we figured that “Hacker News shares a file system and S3 bucket” wouldn’t be the best experience for the community.I built Regatta after spending nearly a decade building and operating at-scale cloud storage at places like Amazon’s Elastic File System (EFS) and Netflix. During my 8 years at EFS, I learned a lot about how teams thought about their storage usage. Users frequently told me that they loved how simple and scalable EFS was, and -- like S3 -- they didn’t have to guess how much capacity they needed up front.When I got to Netflix, I was surprised that there wasn’t more usage of EFS. If you looked around, it seemed like a natural fit. Every application needed a POSIX file system. Lots of applications had unclear or spikey storage needs.\n\t\t- Often, developers wanted their storage to last beyond the lifetime of an individual instance or container. In fact, if you looked across all Netflix applications, some ridiculous amount of money was being spent on *empty storage space* because each of these local drives had to be overprovisioned for potential usage.However, in many cases, EFS wasn’t the perfect choice for these workloads. Moving workloads from local disks to NFS often encountered performance issues. Further, applications which treated their local disks as ephemeral would have to manually “clean up” left over data in a persistent storage system.At this point, I realized that there was a missing solution in the cloud storage market which wasn’t being filled by either block or file storage, and I decided to build Regatta.\n\t\t- Regatta is a pay-as-you-go cloud file system that automatically expands with your application. Because it automatically synchronizes with S3 using native file formats, you can connect it to existing data sets and use recently written file data directly from S3. When data isn’t actively being used, it’s removed from the Regatta cache, so you only pay for the backing S3 storage. Finally, we’re developing a custom file protocol which allows us to achieve local-like performance for small-file workloads *and* Lustre-like scale-out performance for distributed data jobs.Under the hood, customers mount a Regatta file system by connecting to our fleet of caching instances over NFSv3 (soon, our custom protocol). Our instances then connect to the customer’s S3 bucket on the backend, and provide sub-millisecond cached-read and write performance. This durable cache allows us to provide a strongly consistent, efficient view of the file system to all connected file clients. We can perform challenging operations (like directory renaming) quickly and durably, while they asynchronously propagate to the S3 bucket.\n\t\t- We’re excited to see users share our vision for Regatta. We have teams who are using us to build totally serverless Jupyter notebook servers for their AI researchers who prefer to upload and share data using the S3 web UI. We have teams who are using us as a distributed caching layer on top of S3 for low-latency access to common files. We have teams who are replacing their thin-provisioned Ceph boot volumes with Regatta for significant savings. We can’t wait to see what other things people will build and we hope you’ll give us a try at regattastorage.com.We’d love to get any early feedback from the community, ideas for future direction, or experiences in this space. I’ll be in the comments for the next few hours to respond!\n\t\t- |\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Metaverse platforms continue to evolve with focus on interoperability and open standards\n  - Web3 integration accelerating with decentralised identity and asset ownership\n  - Enterprise adoption growing in virtual collaboration, training, and digital twins\n  - UK companies increasingly active in metaverse development and immersive technologies\n\n- Technical capabilities\n  - Real-time rendering at photorealistic quality levels\n  - Low-latency networking enabling seamless multi-user experiences\n  - AI-driven content generation and procedural world building\n  - Spatial audio and haptics enhancing immersion\n\n- UK and North England context\n  - Manchester: Digital Innovation Factory supports metaverse startups and research\n  - Leeds: Holovis leads in immersive experiences for entertainment and training\n  - Newcastle: University research in spatial computing and interactive systems\n  - Sheffield: Advanced manufacturing using digital twin technology\n\n- Standards and frameworks\n  - Metaverse Standards Forum driving interoperability protocols\n  - WebXR enabling browser-based immersive experiences\n  - glTF and USD for 3D asset interchange\n  - Open Metaverse Interoperability Group defining cross-platform standards\n\n## Metadata\n\n- **Last Updated**: 2025-11-16\n- **Review Status**: Automated remediation with 2025 context\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable",
  "properties": {
    "id": "infrastructure-owl-axioms",
    "collapsed": "true",
    "- ontology": "true",
    "- term-id": "mv-94823352766",
    "- preferred-term": "infrastructure",
    "- source-domain": "metaverse",
    "- status": "active",
    "- public-access": "true",
    "- definition": "A component of the metaverse ecosystem focusing on infrastructure.",
    "- maturity": "mature",
    "- authority-score": "0.85",
    "- owl:class": "mv:Infrastructure",
    "- owl:physicality": "ConceptualEntity",
    "- owl:role": "Process",
    "- belongsToDomain": "[[MetaverseDomain]]",
    "public": "true"
  },
  "backlinks": [
    "x402 and l402 payment protocols",
    "RGB and Client Side Validation",
    "Bitcoin Mining",
    "Bitcoin Technical Overview"
  ],
  "wiki_links": [
    "MetaverseDomain",
    "Privacy, Trust and Safety"
  ],
  "ontology": {
    "term_id": "mv-94823352766",
    "preferred_term": "infrastructure",
    "definition": "A component of the metaverse ecosystem focusing on infrastructure.",
    "source_domain": "metaverse",
    "maturity_level": null,
    "authority_score": 0.85
  }
}