{
  "title": "On Chain Voting",
  "content": "- ### OntologyBlock\n  id:: bc-0462-on-chain-voting-ontology\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: BC-0462\n\t- preferred-term:: On Chain Voting\n\t- source-domain:: metaverse\n\t- status:: stub-needs-content\n    - public-access:: true\n\t- content-status:: minimal-placeholder-requires-authoring\n    - public-access:: true\n\t- definition:: A component of the blockchain ecosystem.\n\t- maturity:: draft\n\t- owl:class:: bc:OnChainVoting\n\t- owl:physicality:: ConceptualEntity\n\t- owl:role:: Concept\n\t- belongsToDomain:: [[BlockchainDomain]]\n\n\n## Academic Context\n\n- On-chain voting is a blockchain-based mechanism enabling secure, transparent, and tamper-resistant casting and counting of votes within a distributed ledger environment.\n  - It builds on cryptographic principles, decentralisation, and immutability to enhance electoral integrity and verifiability.\n  - Academically, it intersects computer science, cryptography, political science, and governance studies, with foundational work on distributed consensus and smart contracts underpinning its design.\n  - Key developments include formal models of voting protocols on blockchains and analyses of security properties such as voter anonymity, verifiability, and resistance to coercion.\n\n## Current Landscape (2025)\n\n- Industry adoption of on-chain voting remains cautious but growing, primarily in corporate governance, academic institutions, and limited governmental pilots.\n  - Notable platforms include Polyas (Europe-based), Luxoft, and various Ethereum-based smart contract implementations.\n  - These systems emphasise end-to-end encryption, real-time monitoring, and compliance with regional electoral laws.\n- In the UK, blockchain voting is mostly experimental, with no widespread governmental deployment due to ongoing security and regulatory concerns.\n  - North England cities such as Manchester and Leeds host fintech and blockchain innovation hubs exploring governance applications, including voting.\n- Technical capabilities:\n  - On-chain voting ensures immutability and auditability of votes.\n  - Limitations include scalability challenges, vulnerability to denial-of-service (DoS) attacks, and the persistent risk of endpoint device compromise.\n- Standards and frameworks are emerging but not yet universally adopted, with ongoing efforts to align blockchain voting with existing electoral regulations and cybersecurity standards.\n\n## Research & Literature\n\n- Key academic papers:\n  - Shaikh, A., Adhikari, N., Nazir, A., et al. (2025). \"Blockchain-enhanced electoral integrity: a robust model for secure voting.\" *F1000Research*, 14:223. DOI: 10.12688/f1000research.160087.3\n  - Park, S., Specter, M., Narula, N., Rivest, R.L. (2021). \"Going from bad to worse: from Internet voting to blockchain voting.\" *Journal of Cybersecurity*, 7(1), tyaa025. DOI: 10.1093/cybsec/tyaa025\n  - Jefferson, D. (2023). \"The Myth of ‘Secure’ Blockchain Voting.\" U.S. Vote Foundation.\n  - ACM Computing Surveys (2025). \"A Comprehensive Analysis of Blockchain-Based Voting Systems.\"\n- Ongoing research focuses on scalability solutions (Layer 2 protocols), threat modelling, usability, and integration with e-governance frameworks.\n\n## UK Context\n\n- The UK contributes through academic research in cryptography and distributed systems, with institutions in Manchester and Newcastle leading blockchain governance studies.\n- North England innovation hubs, including Sheffield’s blockchain incubators and Leeds’ fintech clusters, explore practical applications of on-chain voting in corporate and civic contexts.\n- Regional case studies:\n  - Pilot projects in Manchester have trialled blockchain for university student elections, demonstrating increased transparency but highlighting user experience challenges.\n  - Leeds-based startups are developing blockchain voting modules aimed at local council consultations, balancing regulatory compliance with technological innovation.\n\n## Future Directions\n\n- Emerging trends include integration of zero-knowledge proofs to enhance voter privacy, and hybrid models combining blockchain with traditional voting infrastructure.\n- Anticipated challenges:\n  - Overcoming cybersecurity threats such as DoS attacks and endpoint vulnerabilities.\n  - Achieving regulatory acceptance and public trust, especially in politically sensitive environments.\n- Research priorities:\n  - Developing scalable, user-friendly architectures.\n  - Formal verification of smart contracts used in voting.\n  - Comprehensive threat models addressing both technical and social attack vectors.\n\n## References\n\n1. Shaikh, A., Adhikari, N., Nazir, A., Shah, A.S., Baig, S., Al Shihi, H. (2025). Blockchain-enhanced electoral integrity: a robust model for secure voting. *F1000Research*, 14:223. DOI: 10.12688/f1000research.160087.3. PMCID: PMC12397734.\n2. Park, S., Specter, M., Narula, N., Rivest, R.L. (2021). Going from bad to worse: from Internet voting to blockchain voting. *Journal of Cybersecurity*, 7(1), tyaa025. DOI: 10.1093/cybsec/tyaa025.\n3. Jefferson, D. (2023). The Myth of “Secure” Blockchain Voting. U.S. Vote Foundation.\n4. ACM Computing Surveys (2025). A Comprehensive Analysis of Blockchain-Based Voting Systems. DOI: 10.1145/3723178.3723275.\n5. Debut Infotech (2025). Building Secure Blockchain Voting Systems in 2025.  \n6. Rapid Innovation (2025). Blockchain Voting 2025 Ultimate Guide.\n\n\n## Metadata\n\n\n- **Migration Status**: Ontology block enriched on 2025-11-12\n- **Last Updated**: 2025-11-12\n- **Review Status**: Comprehensive editorial review\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable",
  "properties": {
    "id": "bc-0462-on-chain-voting-ontology",
    "collapsed": "true",
    "- ontology": "true",
    "- term-id": "BC-0462",
    "- preferred-term": "On Chain Voting",
    "- source-domain": "metaverse",
    "- status": "stub-needs-content",
    "- public-access": "true",
    "- content-status": "minimal-placeholder-requires-authoring",
    "- definition": "A component of the blockchain ecosystem.",
    "- maturity": "draft",
    "- owl:class": "bc:OnChainVoting",
    "- owl:physicality": "ConceptualEntity",
    "- owl:role": "Concept",
    "- belongsToDomain": "[[BlockchainDomain]]"
  },
  "backlinks": [],
  "wiki_links": [
    "BlockchainDomain"
  ],
  "ontology": {
    "term_id": "BC-0462",
    "preferred_term": "On Chain Voting",
    "definition": "A component of the blockchain ecosystem.",
    "source_domain": "metaverse",
    "maturity_level": null,
    "authority_score": null
  }
}