{
  "title": "Post-Quantum Cryptography",
  "content": "- ### OntologyBlock\n  id:: post-quantum-cryptography-ontology\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: 20210\n\t- source-domain:: metaverse\n\t- status:: draft\n\t- public-access:: true\n\n\n## Academic Context\n\n- Post-Quantum Cryptography (PQC) encompasses cryptographic algorithms and protocols designed to remain secure against adversaries equipped with both classical and quantum computers.\n  - The academic foundation lies in the recognition that quantum computers, exploiting qubits and quantum phenomena such as superposition and entanglement, threaten to break widely used public-key cryptosystems like RSA and ECC.\n  - Key developments include the formulation and analysis of quantum-resistant algorithms based on hard mathematical problems such as lattice problems, multivariate equations, and hash-based constructions.\n  - The field builds on decades of cryptographic research, integrating quantum computing theory with classical cryptanalysis to anticipate future threats.\n\n## Current Landscape (2025)\n\n- Industry adoption of PQC is accelerating, driven by the imminent threat posed by quantum computing and the need to protect long-term data confidentiality.\n  - The National Institute of Standards and Technology (NIST) completed its first round of PQC standardisation in August 2024, endorsing algorithms such as Crystals-KYBER (key encapsulation) and Crystals-DILITHIUM (digital signatures), both lattice-based, alongside stateless hash-based signatures like SPHINCS+.\n  - Hybrid cryptographic schemes combining classical and post-quantum algorithms are widely recommended to ensure a smooth transition and mitigate risks from premature adoption.\n  - Technical limitations include increased computational overhead and larger key sizes compared to classical algorithms, which impact performance and implementation complexity.\n- Notable organisations implementing PQC include major cloud providers and cybersecurity firms globally, with increasing integration into TLS protocols and VPNs.\n- In the UK, government bodies and industry are actively preparing for PQC adoption, with a focus on standards compliance and infrastructure readiness.\n\n## Research & Literature\n\n- Key academic papers and sources:\n  - Peikert, C. (2016). \"A Decade of Lattice Cryptography.\" Foundations and Trends® in Theoretical Computer Science, 10(4), 283–424. DOI: 10.1561/0400000072\n  - Bernstein, D. J., Lange, T., & Peters, C. (2017). \"Post-Quantum Cryptography.\" In Post-Quantum Cryptography (pp. 1–14). Springer. DOI: 10.1007/978-3-319-40049-5_1\n  - Alagic, G., et al. (2022). \"Status Report on the Second Round of the NIST Post-Quantum Cryptography Standardization Process.\" NISTIR 8413. DOI: 10.6028/NIST.IR.8413\n- Ongoing research focuses on improving algorithm efficiency, reducing key sizes, and developing quantum-resistant signature schemes.\n- Studies also explore crypto-agility frameworks and hybrid protocols to facilitate seamless migration.\n\n## UK Context\n\n- The UK government has prioritised PQC within its National Cyber Security Strategy, funding research and pilot projects to prepare critical infrastructure.\n- North England hosts several innovation hubs contributing to PQC research and development:\n  - Manchester’s Quantum Technology Hub focuses on quantum-safe communications.\n  - Leeds and Sheffield universities conduct applied cryptography research with industry partnerships.\n  - Newcastle supports cybersecurity startups integrating PQC solutions.\n- Regional case studies include collaborative projects between academia and industry to trial PQC in financial services and public sector networks.\n\n## Future Directions\n\n- Emerging trends include:\n  - Development of standardised hybrid cryptographic protocols combining classical and post-quantum algorithms.\n  - Enhanced focus on implementation security to prevent side-channel and fault attacks on PQC schemes.\n  - Integration of PQC into Internet of Things (IoT) devices and constrained environments.\n- Anticipated challenges:\n  - Balancing security with performance and usability, especially in legacy systems.\n  - Managing the complexity of crypto-agility and ensuring rapid response to potential vulnerabilities.\n- Research priorities:\n  - Refinement of lattice-based and code-based algorithms.\n  - Exploration of new mathematical foundations for PQC.\n  - Development of comprehensive migration frameworks and tooling.\n\n## References\n\n1. Peikert, C. (2016). A Decade of Lattice Cryptography. *Foundations and Trends® in Theoretical Computer Science*, 10(4), 283–424. https://doi.org/10.1561/0400000072  \n2. Bernstein, D. J., Lange, T., & Peters, C. (2017). Post-Quantum Cryptography. In *Post-Quantum Cryptography* (pp. 1–14). Springer. https://doi.org/10.1007/978-3-319-40049-5_1  \n3. Alagic, G., et al. (2022). Status Report on the Second Round of the NIST Post-Quantum Cryptography Standardization Process. *NISTIR 8413*. https://doi.org/10.6028/NIST.IR.8413  \n4. NIST. (2024). Post-Quantum Cryptography Project. National Institute of Standards and Technology. https://csrc.nist.gov/projects/post-quantum-cryptography  \n5. Stormshield. (2025). Challenges & Adoption of Post-Quantum Cryptography. Stormshield News.  \n6. Cloudflare. (2025). State of the Post-Quantum Internet in 2025. Cloudflare Blog.  \n7. ISACA. (2025). Post Quantum Cryptography: A Call to Action. Industry News.  \n\n*If quantum computers ever do break all encryption, at least we'll have a good excuse for forgetting our passwords.*\n\n\n## Metadata\n\n- **Last Updated**: 2025-11-11\n- **Review Status**: Comprehensive editorial review\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable",
  "properties": {
    "id": "post-quantum-cryptography-ontology",
    "collapsed": "true",
    "- ontology": "true",
    "- term-id": "20210",
    "- source-domain": "metaverse",
    "- status": "draft",
    "- public-access": "true"
  },
  "backlinks": [
    "Consensus Mechanism",
    "Cryptography",
    "Bitcoin Value Proposition",
    "Digital Signature",
    "Public Key",
    "Public Key - CORRECTED",
    "Zero-Knowledge Proof (ZKP)",
    "SHA-256"
  ],
  "wiki_links": [],
  "ontology": {
    "term_id": "20210",
    "preferred_term": "Post-Quantum Cryptography",
    "definition": "",
    "source_domain": "metaverse",
    "maturity_level": null,
    "authority_score": null
  }
}