{
  "title": "Private Key",
  "content": "- ### OntologyBlock\n  id:: private-key-ontology\n  collapsed:: true\n\n  - **Identification**\n\n    - domain-prefix:: BC\n\n    - sequence-number:: 0036\n\n    - filename-history:: [\"BC-0036-private-key.md\"]\n    - public-access:: true\n    - ontology:: true\n    - term-id:: BC-0036\n    - preferred-term:: Private Key\n    - source-domain:: blockchain\n    - status:: complete\n    - version:: 1.0.0\n    - last-updated:: 2025-10-28\n\n  - **Definition**\n    - definition:: Secret cryptographic key within blockchain systems, providing essential functionality for distributed ledger technology operations and properties.\n    - maturity:: mature\n    - source:: [[ISO/IEC 23257:2021]], [[IEEE 2418.1]], [[NIST NISTIR]]\n    - authority-score:: 0.95\n\n  - **Semantic Classification**\n    - owl:class:: bc:PrivateKey\n    - owl:physicality:: VirtualEntity\n    - owl:role:: Object\n    - owl:inferred-class:: bc:VirtualObject\n    - belongsToDomain:: [[CryptographicDomain]]\n    - implementedInLayer:: [[SecurityLayer]]\n\n  - #### Relationships\n    id:: private-key-relationships\n    - is-subclass-of:: [[Blockchain Entity]], [[CryptographicPrimitive]]\n\n  - #### OWL Axioms\n    id:: private-key-owl-axioms\n    collapsed:: true\n    - ```clojure\n      Prefix(:=<http://metaverse-ontology.org/blockchain#>)\nPrefix(owl:=<http://www.w3.org/2002/07/owl#>)\nPrefix(rdf:=<http://www.w3.org/1999/02/22-rdf-syntax-ns#>)\nPrefix(xml:=<http://www.w3.org/XML/1998/namespace>)\nPrefix(xsd:=<http://www.w3.org/2001/XMLSchema#>)\nPrefix(rdfs:=<http://www.w3.org/2000/01/rdf-schema#>)\nPrefix(dct:=<http://purl.org/dc/terms/>)\n\nOntology(<http://metaverse-ontology.org/blockchain/BC-0036>\n  Import(<http://metaverse-ontology.org/blockchain/core>)\n\n  ## Class Declaration\n  Declaration(Class(:PrivateKey))\n\n  ## Subclass Relationships\n  SubClassOf(:PrivateKey :CryptographicPrimitive)\n  SubClassOf(:PrivateKey :BlockchainEntity)\n\n  ## Essential Properties\n  SubClassOf(:PrivateKey\n    (ObjectSomeValuesFrom :partOf :Blockchain))\n\n  SubClassOf(:PrivateKey\n    (ObjectSomeValuesFrom :hasProperty :Property))\n\n  ## Data Properties\n  DataPropertyAssertion(:hasIdentifier :PrivateKey \"BC-0036\"^^xsd:string)\n  DataPropertyAssertion(:hasAuthorityScore :PrivateKey \"1.0\"^^xsd:decimal)\n  DataPropertyAssertion(:isFoundational :PrivateKey \"true\"^^xsd:boolean)\n\n  ## Object Properties\n  ObjectPropertyAssertion(:enablesFeature :PrivateKey :BlockchainFeature)\n  ObjectPropertyAssertion(:relatesTo :PrivateKey :RelatedConcept)\n\n  ## Annotations\n  AnnotationAssertion(rdfs:label :PrivateKey \"Private Key\"@en)\n  AnnotationAssertion(rdfs:comment :PrivateKey\n    \"Secret cryptographic key\"@en)\n  AnnotationAssertion(dct:description :PrivateKey\n    \"Foundational blockchain concept with formal ontological definition\"@en)\n  AnnotationAssertion(:termID :PrivateKey \"BC-0036\")\n  AnnotationAssertion(:priority :PrivateKey \"1\"^^xsd:integer)\n  AnnotationAssertion(:category :PrivateKey \"cryptographic-foundations\"@en)\n)\n      ```\n\n- ## About Private Key\n  id:: private-key-about\n\n  - Secret cryptographic key within blockchain systems, providing essential functionality for distributed ledger technology operations and properties.\n  -\n  - ### Key Characteristics\n    id:: private-key-characteristics\n    - 1. **Definitional Property**: Core defining characteristic\n    - 2. **Functional Property**: Operational behavior\n    - 3. **Structural Property**: Compositional elements\n    - 4. **Security Property**: Security guarantees provided\n    - 5. **Performance Property**: Efficiency considerations\n  -\n  - ### Technical Components\n    id:: private-key-components\n    - **Implementation**: How concept is realized technically\n    - **Verification**: Methods for validating correctness\n    - **Interaction**: Relationships with other components\n    - **Constraints**: Technical limitations and requirements\n  -\n  - ### Use Cases\n    id:: private-key-use-cases\n    - **1. Core Blockchain Operation**\n    - **Application**: Fundamental blockchain functionality\n    - **Example**: Practical implementation in major blockchains\n    - **Requirements**: Technical prerequisites\n    - **Benefits**: Value provided to blockchain systems\n  -\n  - ### Standards & References\n    id:: private-key-standards\n    - [[ISO/IEC 23257:2021]] - Blockchain and distributed ledger technologies\n    - [[IEEE 2418.1]] - Blockchain and distributed ledger technologies\n    - [[NIST NISTIR]] - Blockchain and distributed ledger technologies\n  -\n\n- # Layer 2 and sidechains\n\t- [RGB is a smart contract platform that is scalable, private, and interoperable with Bitcoin and Lightning Network. It is possible to issue assets, create NFTs, and run DAOs on RGB.](https://rgb.tech/)\n\t- [RGB 20 longhand manual](https://github.com/oneforalone/rgb20-usdt/blob/8ee4243d415ccd3ab76d750614148cd1cb44c1b9/Readme.md)\n\t- [RGB22](https://standards.lnp-bp.org/rgb/lnpbp-0022)\n\t- [RGB report](https://www.utxo.management/content/files/2023/10/UTXO_Management_RGB_Report.pdf)\n\t- [Taproot Assets](https://docs.lightning.engineering/the-lightning-network/taproot-assets/)\n\t- [Ark](https://www.arkpill.me/faq)\n\t- [Zerosync bitcoin rollup proofs](https://zerosync.org/)\n\t- [10101 custodial DLC trading](https://medium.com/10101-finance/itchysats-becomes-10101-216dd64941d2)\n\n\t\t- ## Government and Private Sector Collaboration\n\n\t\t\t- ### Increased Surveillance\n\t\t\t\t- The French government has significantly expanded its surveillance capabilities through collaboration with private tech companies:\n\t\t\t\t- **Classified Provisional Decree:** A confidential decree has been issued, allowing for more extensive electronic surveillance. This includes data gathering, wiretapping, and the monitoring of communications such as text messages and emails.\n\n\t\t\t\t- ### Fast GPU voice to voice on the private servers\n\n\t\t\t\t- ### Interacts with private Git (not just github) including distributed\n\n\t\t\t\t- ### Either uses Private GPU or any of the major AI providers, or all of them at once\n\n\t- ### Investment Trends: Generative AI's Surge\n\t\t- While overall private AI investment saw a decline, funding for generative AI experienced a significant uptick, reaching $25.2 billion in 2023—a nearly eightfold increase from the previous year.  ([Economy | The 2024 AI Index Report | Stanford HAI](https://hai.stanford.edu/ai-index/2024-ai-index-report/economy?utm_source=chatgpt.com))\n\t\t- This surge reflects the growing interest and potential seen in generative AI applications across various industries.\n\n\t\t- #### **Nostr as the Communication and Identity Layer**\n\t\t- Nostr (\"Notes and Other Stuff Transmitted by Relays\") is a simple, open protocol for global, decentralized, and censorship-resistant communication.\n\t\t- *   **Decentralized Identity (DID):** A user's cryptographic keypair serves as their sovereign identity. The `did:nostr` method provides a straightforward way to integrate Nostr identities with the W3C DID standard, enabling interoperability across the decentralized identity ecosystem. This allows an agent or human to prove control over their identity without relying on a central authority.\n\t\t  *   **Secure and Private Messaging:** Nostr's architecture is ideal for private, end-to-end encrypted communication between agents for negotiating contracts and exchanging sensitive information.\n\n\t- ### 8. Conclusion\n\t\t- The next stage of the internet promises to correct the architectural flaws of the current centralized web. By combining the security of Bitcoin, the scalability of the Lightning Network, the programmability of RGB, and the decentralized communication of Nostr, we can construct a robust, private, and efficient foundation for an economy of autonomous agents. This is not a speculative future; the technologies are maturing rapidly, and the strategic imperative is clear. Leaders who understand and embrace this shift will be positioned to build the truly innovative and resilient enterprises of tomorrow.\n\n\t\t- ### Bots and AI Agents:\n\t\t\t- Autonomous AI [[Agents]], bonded to, but not bounded by, each federated mixed reality instance, can be self-governing entities that operate within their federated virtual social spaces, drawing upon private Bitcoin and Lightning wallets to perform and mediate economic exchanges within the spaces. They could also trivially operate outside the virtual space, and within other spaces on the same metaverse federation. They would accomplish this by drawing on their 'home' GPU/TPU processors where appropriate, or else using distributed large language model (LLM) processing to accomplish tasks assigned by their instructors. They can interact with the 'web2' world using open-source software called auto-gpt and have constraints, such as \"time to live\" and limited access to funds through their Bitcoin Lightning wallets.\n\n\t\t- ### Treasury's Approach to Crypto and DeFi\n\t\t- **Improving AML/CFT Framework**: The Treasury is working to refine its approach to AML/CFT in the crypto world.\n\t\t- **Engagement for Responsible Innovation**: The department plans to collaborate with the private sector to support responsible innovation in DeFi.\n\n- # Layer 2 and sidechains\n\t- [RGB is a smart contract platform that is scalable, private, and interoperable with Bitcoin and Lightning Network. It is possible to issue assets, create NFTs, and run DAOs on RGB.](https://rgb.tech/)\n\t- [RGB 20 longhand manual](https://github.com/oneforalone/rgb20-usdt/blob/8ee4243d415ccd3ab76d750614148cd1cb44c1b9/Readme.md)\n\t- [RGB22](https://standards.lnp-bp.org/rgb/lnpbp-0022)\n\t- [RGB report](https://www.utxo.management/content/files/2023/10/UTXO_Management_RGB_Report.pdf)\n\t- [Taproot Assets](https://docs.lightning.engineering/the-lightning-network/taproot-assets/)\n\t- [Ark](https://www.arkpill.me/faq)\n\t- [Zerosync bitcoin rollup proofs](https://zerosync.org/)\n\t- [10101 custodial DLC trading](https://medium.com/10101-finance/itchysats-becomes-10101-216dd64941d2)\n\n\t\t\t- ##### Secure Digital Provenance\n\t\t\t\t- [Provenance](https://en.wikipedia.org/wiki/Provenance) (or the chain ofcustody) is an important aspect in works of art, antiques andantiquities. Provenance not only helps assign work to an artist but alsodocuments ownership history. Digital provenance, an inherent feature ofNFT’s means provenance now no longer becomes what has historicallysometime been a contentious detective’s game at the best of times; onethat is open to fraud, misinterpretation and entirely reliant on goodrecord keeping.\n\t\t\t\t- Since provenance can contribute to the value of a piece of art(benefiting both the creator and collector) the use of the blockchain asan open, secure ledger is a far more trustworthy system than traditionalmethods of artistic provenance that were cobbled together; oftenconsisting of a mix of physical and digital documents spanning private &public sale receipts, art/museum gallery exhibitions and private recordkeeping). Digital provenance provided when an artist ‘mints’ a piece ofart into an NFT allows artists and collectors to record a secure,permanent unalterable history of transactions for a specific piece ofart, providing future collector complete trust in the origin and custodyof a piece of art.\n\n- # Misc links\n- [Signal Foundation Warns Against EU's Plan to Scan Private Messages for CSAM (thehackernews.com)](https://thehackernews.com/2024/06/signal-foundation-warns-against-eus.html?m=1)\n- [Sealed Court Files Obscure Rise in Electronic Surveillance WSJ](https://www.wsj.com/articles/sealed-court-files-obscure-rise-in-electronic-surveillance-1401761770)\n- [Portfolio – Jennifer Valentino DeVries (jennifervalentinodevries.com)](https://jennifervalentinodevries.com/portfolio/)\n\n- # Private Nuclear\n\t- [AI turning nuclear power plants into prime DC real-estate • The Register](https://www.theregister.com/2024/03/25/ai_boom_nuclear/) [[Convergence]] [[Energy and Power]] [[Artificial Intelligence]]\n\t- [Google signs nuclear power deal with startup Kairos - Insider Paper](https://insiderpaper.com/google-signs-nuclear-power-deal-with-startup-kairos/)\n\t- Constellation signed a 20-year power purchase agreement (PPA) with Microsoft to restart Three Mile Island Unit 1, which had been shut down since 2019 for economic reasons. The plant faced competition from cheaper natural gas due to the fracking boom, leading to its closure.\n\t- Unlike other nuclear plants in the region, Three Mile Island was a single-unit facility, which contributed to higher operational costs compared to multi-unit plants. The plant's reputation was affected by the 1979 meltdown of Unit 2, impacting public perception of nuclear energy.\n\t- The plant required significant investments (estimated $1.6 billion) for upgrades to restart and operate efficiently. Projected annual revenue from the PPA is estimated at £800 million, with potential profits being several hundred million, depending on operational costs.\n\n\t\t\t\t- ### Credit Growth vs. Monetary Policy\n\t\t\t\t\t- Despite expectations that higher rates would restrain credit growth, King highlights that borrowing remains lackluster. He attributes credit creation primarily to fiscal policies rather than private sector demand. This disconnect between interest rates and actual borrowing underscores his argument that monetary policy, especially rate hikes, does not always work as anticipated[](https://www.bis.org/publ/mktc11.pdf)[](https://www.ecb.europa.eu/pub/pdf/other/mb201309_focus05.en.pdf).\n\n\t- ## Private credit drives money creation and asset inflation\n\t\t- Private credit creation through bank lending also increases the money supply by allowing households and businesses to purchase assets they couldn’t otherwise afford. When banks create new loans, they are simultaneously creating new purchasing power in the form of deposits for the borrower, allowing asset purchases with new credit. This increases broader money supply and spending capacity, but also creates anoffsetting debt liability owed back to the bank. Rapid private credit growth risks fueling asset bubbles and financial instability if debts can’t be repaid. This primarily benefits those who already own assets.Private credit growth is more disciplined by market forces compared to unchecked government deficits, but still risks inflating asset prices.\n\n\t- ## Metaverse use of nostr\n\t\t- This provides a web interface into the metaverse providing:\n\t\t\t- simple cryptographic identity assurance\n\t\t\t- private peer to peer chat\n\t\t\t- group chats and channels\n\t\t\t- email to private message relay\n\t\t\t- links into media on web hosts\n\t\t- The pace of development on Nostr is dizzying. Peer to peer video andaudio will allow us to link metaverse instances, between peers, throughapplications such as [Monstr](https://monstr.app/).\n\t\t- It’s notable that Nostr has it’s own inexpensive [hardware signingdevice](https://github.com/lnbits/nostr-signing-device) to protectidentity in situations where this might be necessary.  bfThe proposed integration of Nostr social media and messaging, alightning layer with digital objects such as Fedimint, Zerosync or RGB,AI agents, Vircadia, and federated Bitcoin is the core value propositionof this book. This work pre-dates [Meta andZuckerbergs](https://www.theverge.com/2023/4/26/23699633/mark-zuckerberg-meta-generative-ai-chatbots-instagram-facebook-whatsapp)stated intent in this regard by 18 months, and is differentiated stillby our focus on emerging markets and decentralisation.\n\n\t\t- ### Techno-Feudalism\n\t - **Fragmented Society:** Describes a future where societal fragmentation occurs due to the rise of powerful AI platforms that take over traditional state roles. Envisions a world where loyalty shifts from states to platform-centric communities.\n\t - **Private Governance:** Explores the potential trajectory of AI leading to a future where traditional state functions are increasingly replaced or supplemented by private, AI-driven platforms. This rise of corporate entities or conglomerates that provide governance, security, and social services, side-lining traditional state functions and leading to a complex web of interdependencies and power dynamics. This shift in societal organisation resembles medieval structures, and he terms it 'techno-feudalism'. I had been calling this the fracturing of society in my writing, but I might start to adopt this phase.\n\t - **Implications for Society:** Discusses how the decentralization of authority and the rise of powerful private entities could shape societal norms, governance, and daily life, leading to a redefinition of citizenship, rights, and [[Social contract and jobs]]. He identifies Uber as a social credit system which we blithely accept. Over time this trends to separation like that seen in the insurance markets, where \"all the 1 star Uber drivers drive the 1 star passenger\", but writ large across society. This is also \"gated communities\" and the micro-states defended by AI as posited by authors like Neal Stephenson in Diamond Age.\n\t - **Adversarial Renaissance:** This might well be dystopian, but equally it could be a renaissance moment, with national governments losing their hegemonic control to exascale compute powered conglomerates, city states, micro countries etc. This is for sure more adversarial, but not **necessarily** bad. This is a libertarian viewpoint, but also perhaps a classic liberal one.\n\n- # Distributed Human-AI Collaboration on Private Datasets\n\n\t- ## The Utility of VisionFlow\n\t\t- In today's data-driven world, knowledge is often scattered across documents, databases, and tools, making it hard for experts to collaborate effectively, specially when integrating AI. VisionFlow solves this by providing a **unified canvas** where humans and AI agents work together on **grounded private datasets**. Here's why it's a game-changer:\n\n\t\t\t- ### 3. **Pliability for General-Purpose Use**\n\t\t\t- VisionFlow is designed as a **general-purpose platform**, adaptable to diverse domains:\n\t\t\t\t- **Research & Analysis**: Visualize literature or datasets; spawn researcher agents for insights.\n\t\t\t\t- **Software Engineering**: Map codebases; use coder agents for refactoring, tester agents for validation.\n\t\t\t\t- **Business Intelligence**: Model organizational knowledge; analysts can query and refine in real time.\n\t\t\t\t- **Creative Collaboration**: Teams co-edit graphs; AI agents generate ideas, documentation, or prototypes.\n\t\t\t\t- **Education**: Interactive 3D mind maps; students collaborate with AI tutors on private notes.\n\t\t\t- Its modular architecture allows custom extensions, making it pliable for any problem requiring human-AI synergy on private data.\n\n\t\t\t- ### Semantic Analysis & Constraints\n\t\t\t\t- **Multi-Modal Pipeline**: Extracts features (topics, domains, structure) to generate dynamic edges and forces.\n\t\t\t\t- **Ontology Validation**: Maps graph to OWL/RDF for logical consistency checks and inference.\n\t\t\t\t- **Grounded Insights**: AI agents operate on your private data, ensuring privacy while providing context-aware responses.\n\n\t\t- ## Government and Private Sector Collaboration\n\n\t\t\t- ### Increased Surveillance\n\t\t\t\t- The French government has significantly expanded its surveillance capabilities through collaboration with private tech companies:\n\t\t\t\t- **Classified Provisional Decree:** A confidential decree has been issued, allowing for more extensive electronic surveillance. This includes data gathering, wiretapping, and the monitoring of communications such as text messages and emails.\n\n\t\t\t\t- ### Fast GPU voice to voice on the private servers\n\n\t\t\t\t- ### Interacts with private Git (not just github) including distributed\n\n\t\t\t\t- ### Either uses Private GPU or any of the major AI providers, or all of them at once\n\n\t- ### Investment Trends: Generative AI's Surge\n\t\t- While overall private AI investment saw a decline, funding for generative AI experienced a significant uptick, reaching $25.2 billion in 2023—a nearly eightfold increase from the previous year.  ([Economy | The 2024 AI Index Report | Stanford HAI](https://hai.stanford.edu/ai-index/2024-ai-index-report/economy?utm_source=chatgpt.com))\n\t\t- This surge reflects the growing interest and potential seen in generative AI applications across various industries.\n\n\t\t- #### **Nostr as the Communication and Identity Layer**\n\t\t- Nostr (\"Notes and Other Stuff Transmitted by Relays\") is a simple, open protocol for global, decentralized, and censorship-resistant communication.\n\t\t- *   **Decentralized Identity (DID):** A user's cryptographic keypair serves as their sovereign identity. The `did:nostr` method provides a straightforward way to integrate Nostr identities with the W3C DID standard, enabling interoperability across the decentralized identity ecosystem. This allows an agent or human to prove control over their identity without relying on a central authority.\n\t\t  *   **Secure and Private Messaging:** Nostr's architecture is ideal for private, end-to-end encrypted communication between agents for negotiating contracts and exchanging sensitive information.\n\n\t- ### 8. Conclusion\n\t\t- The next stage of the internet promises to correct the architectural flaws of the current centralized web. By combining the security of Bitcoin, the scalability of the Lightning Network, the programmability of RGB, and the decentralized communication of Nostr, we can construct a robust, private, and efficient foundation for an economy of autonomous agents. This is not a speculative future; the technologies are maturing rapidly, and the strategic imperative is clear. Leaders who understand and embrace this shift will be positioned to build the truly innovative and resilient enterprises of tomorrow.\n\n\t\t- ### Bots and AI Agents:\n\t\t\t- Autonomous AI [[Agents]], bonded to, but not bounded by, each federated mixed reality instance, can be self-governing entities that operate within their federated virtual social spaces, drawing upon private Bitcoin and Lightning wallets to perform and mediate economic exchanges within the spaces. They could also trivially operate outside the virtual space, and within other spaces on the same metaverse federation. They would accomplish this by drawing on their 'home' GPU/TPU processors where appropriate, or else using distributed large language model (LLM) processing to accomplish tasks assigned by their instructors. They can interact with the 'web2' world using open-source software called auto-gpt and have constraints, such as \"time to live\" and limited access to funds through their Bitcoin Lightning wallets.\n\n\t\t- ### Treasury's Approach to Crypto and DeFi\n\t\t- **Improving AML/CFT Framework**: The Treasury is working to refine its approach to AML/CFT in the crypto world.\n\t\t- **Engagement for Responsible Innovation**: The department plans to collaborate with the private sector to support responsible innovation in DeFi.\n\n- # Layer 2 and sidechains\n\t- [RGB is a smart contract platform that is scalable, private, and interoperable with Bitcoin and Lightning Network. It is possible to issue assets, create NFTs, and run DAOs on RGB.](https://rgb.tech/)\n\t- [RGB 20 longhand manual](https://github.com/oneforalone/rgb20-usdt/blob/8ee4243d415ccd3ab76d750614148cd1cb44c1b9/Readme.md)\n\t- [RGB22](https://standards.lnp-bp.org/rgb/lnpbp-0022)\n\t- [RGB report](https://www.utxo.management/content/files/2023/10/UTXO_Management_RGB_Report.pdf)\n\t- [Taproot Assets](https://docs.lightning.engineering/the-lightning-network/taproot-assets/)\n\t- [Ark](https://www.arkpill.me/faq)\n\t- [Zerosync bitcoin rollup proofs](https://zerosync.org/)\n\t- [10101 custodial DLC trading](https://medium.com/10101-finance/itchysats-becomes-10101-216dd64941d2)\n\n\t\t\t- ##### Secure Digital Provenance\n\t\t\t\t- [Provenance](https://en.wikipedia.org/wiki/Provenance) (or the chain ofcustody) is an important aspect in works of art, antiques andantiquities. Provenance not only helps assign work to an artist but alsodocuments ownership history. Digital provenance, an inherent feature ofNFT’s means provenance now no longer becomes what has historicallysometime been a contentious detective’s game at the best of times; onethat is open to fraud, misinterpretation and entirely reliant on goodrecord keeping.\n\t\t\t\t- Since provenance can contribute to the value of a piece of art(benefiting both the creator and collector) the use of the blockchain asan open, secure ledger is a far more trustworthy system than traditionalmethods of artistic provenance that were cobbled together; oftenconsisting of a mix of physical and digital documents spanning private &public sale receipts, art/museum gallery exhibitions and private recordkeeping). Digital provenance provided when an artist ‘mints’ a piece ofart into an NFT allows artists and collectors to record a secure,permanent unalterable history of transactions for a specific piece ofart, providing future collector complete trust in the origin and custodyof a piece of art.\n\n- # Misc links\n- [Signal Foundation Warns Against EU's Plan to Scan Private Messages for CSAM (thehackernews.com)](https://thehackernews.com/2024/06/signal-foundation-warns-against-eus.html?m=1)\n- [Sealed Court Files Obscure Rise in Electronic Surveillance WSJ](https://www.wsj.com/articles/sealed-court-files-obscure-rise-in-electronic-surveillance-1401761770)\n- [Portfolio – Jennifer Valentino DeVries (jennifervalentinodevries.com)](https://jennifervalentinodevries.com/portfolio/)\n\n- # Private Nuclear\n\t- [AI turning nuclear power plants into prime DC real-estate • The Register](https://www.theregister.com/2024/03/25/ai_boom_nuclear/) [[Convergence]] [[Energy and Power]] [[Artificial Intelligence]]\n\t- [Google signs nuclear power deal with startup Kairos - Insider Paper](https://insiderpaper.com/google-signs-nuclear-power-deal-with-startup-kairos/)\n\t- Constellation signed a 20-year power purchase agreement (PPA) with Microsoft to restart Three Mile Island Unit 1, which had been shut down since 2019 for economic reasons. The plant faced competition from cheaper natural gas due to the fracking boom, leading to its closure.\n\t- Unlike other nuclear plants in the region, Three Mile Island was a single-unit facility, which contributed to higher operational costs compared to multi-unit plants. The plant's reputation was affected by the 1979 meltdown of Unit 2, impacting public perception of nuclear energy.\n\t- The plant required significant investments (estimated $1.6 billion) for upgrades to restart and operate efficiently. Projected annual revenue from the PPA is estimated at £800 million, with potential profits being several hundred million, depending on operational costs.\n\n\t\t\t\t- ### Credit Growth vs. Monetary Policy\n\t\t\t\t\t- Despite expectations that higher rates would restrain credit growth, King highlights that borrowing remains lackluster. He attributes credit creation primarily to fiscal policies rather than private sector demand. This disconnect between interest rates and actual borrowing underscores his argument that monetary policy, especially rate hikes, does not always work as anticipated[](https://www.bis.org/publ/mktc11.pdf)[](https://www.ecb.europa.eu/pub/pdf/other/mb201309_focus05.en.pdf).\n\n\t- ## Private credit drives money creation and asset inflation\n\t\t- Private credit creation through bank lending also increases the money supply by allowing households and businesses to purchase assets they couldn’t otherwise afford. When banks create new loans, they are simultaneously creating new purchasing power in the form of deposits for the borrower, allowing asset purchases with new credit. This increases broader money supply and spending capacity, but also creates anoffsetting debt liability owed back to the bank. Rapid private credit growth risks fueling asset bubbles and financial instability if debts can’t be repaid. This primarily benefits those who already own assets.Private credit growth is more disciplined by market forces compared to unchecked government deficits, but still risks inflating asset prices.\n\n\t- ## Metaverse use of nostr\n\t\t- This provides a web interface into the metaverse providing:\n\t\t\t- simple cryptographic identity assurance\n\t\t\t- private peer to peer chat\n\t\t\t- group chats and channels\n\t\t\t- email to private message relay\n\t\t\t- links into media on web hosts\n\t\t- The pace of development on Nostr is dizzying. Peer to peer video andaudio will allow us to link metaverse instances, between peers, throughapplications such as [Monstr](https://monstr.app/).\n\t\t- It’s notable that Nostr has it’s own inexpensive [hardware signingdevice](https://github.com/lnbits/nostr-signing-device) to protectidentity in situations where this might be necessary.  bfThe proposed integration of Nostr social media and messaging, alightning layer with digital objects such as Fedimint, Zerosync or RGB,AI agents, Vircadia, and federated Bitcoin is the core value propositionof this book. This work pre-dates [Meta andZuckerbergs](https://www.theverge.com/2023/4/26/23699633/mark-zuckerberg-meta-generative-ai-chatbots-instagram-facebook-whatsapp)stated intent in this regard by 18 months, and is differentiated stillby our focus on emerging markets and decentralisation.\n\n\t\t- ### Techno-Feudalism\n\t - **Fragmented Society:** Describes a future where societal fragmentation occurs due to the rise of powerful AI platforms that take over traditional state roles. Envisions a world where loyalty shifts from states to platform-centric communities.\n\t - **Private Governance:** Explores the potential trajectory of AI leading to a future where traditional state functions are increasingly replaced or supplemented by private, AI-driven platforms. This rise of corporate entities or conglomerates that provide governance, security, and social services, side-lining traditional state functions and leading to a complex web of interdependencies and power dynamics. This shift in societal organisation resembles medieval structures, and he terms it 'techno-feudalism'. I had been calling this the fracturing of society in my writing, but I might start to adopt this phase.\n\t - **Implications for Society:** Discusses how the decentralization of authority and the rise of powerful private entities could shape societal norms, governance, and daily life, leading to a redefinition of citizenship, rights, and [[Social contract and jobs]]. He identifies Uber as a social credit system which we blithely accept. Over time this trends to separation like that seen in the insurance markets, where \"all the 1 star Uber drivers drive the 1 star passenger\", but writ large across society. This is also \"gated communities\" and the micro-states defended by AI as posited by authors like Neal Stephenson in Diamond Age.\n\t - **Adversarial Renaissance:** This might well be dystopian, but equally it could be a renaissance moment, with national governments losing their hegemonic control to exascale compute powered conglomerates, city states, micro countries etc. This is for sure more adversarial, but not **necessarily** bad. This is a libertarian viewpoint, but also perhaps a classic liberal one.\n\n- # Distributed Human-AI Collaboration on Private Datasets\n\n\t- ## The Utility of VisionFlow\n\t\t- In today's data-driven world, knowledge is often scattered across documents, databases, and tools, making it hard for experts to collaborate effectively, specially when integrating AI. VisionFlow solves this by providing a **unified canvas** where humans and AI agents work together on **grounded private datasets**. Here's why it's a game-changer:\n\n\t\t\t- ### 3. **Pliability for General-Purpose Use**\n\t\t\t- VisionFlow is designed as a **general-purpose platform**, adaptable to diverse domains:\n\t\t\t\t- **Research & Analysis**: Visualize literature or datasets; spawn researcher agents for insights.\n\t\t\t\t- **Software Engineering**: Map codebases; use coder agents for refactoring, tester agents for validation.\n\t\t\t\t- **Business Intelligence**: Model organizational knowledge; analysts can query and refine in real time.\n\t\t\t\t- **Creative Collaboration**: Teams co-edit graphs; AI agents generate ideas, documentation, or prototypes.\n\t\t\t\t- **Education**: Interactive 3D mind maps; students collaborate with AI tutors on private notes.\n\t\t\t- Its modular architecture allows custom extensions, making it pliable for any problem requiring human-AI synergy on private data.\n\n\t\t\t- ### Semantic Analysis & Constraints\n\t\t\t\t- **Multi-Modal Pipeline**: Extracts features (topics, domains, structure) to generate dynamic edges and forces.\n\t\t\t\t- **Ontology Validation**: Maps graph to OWL/RDF for logical consistency checks and inference.\n\t\t\t\t- **Grounded Insights**: AI agents operate on your private data, ensuring privacy while providing context-aware responses.\n\n\t\t- ## Government and Private Sector Collaboration\n\n\t\t\t\t- ### Either uses Private GPU or any of the major AI providers, or all of them at once\n\n\t\t- #### **Nostr as the Communication and Identity Layer**\n\t\t- Nostr (\"Notes and Other Stuff Transmitted by Relays\") is a simple, open protocol for global, decentralized, and censorship-resistant communication.\n\t\t  *   **Private and Scalable Value Transfer:** This architecture allows for the creation and transfer of assets like Tether (USDT) and Satoshis over the Lightning Network. Transactions are fast, cheap, and confidential, as the details of the asset transfer are not visible on the main Bitcoin blockchain.\n\t\t  *   **Layer 3 Functionality:** RGB enables a true application layer (Layer 3) on Bitcoin, supporting tokenization, decentralized finance (DeFi), and other complex smart contract use cases without congesting the base layer.\n\n\t- ### 5. The Operational Framework: Private Contract Negotiation and Enforcement\n\t\t- Combining these protocols creates a robust framework for autonomous commercial activity between agents.\n\t\t- 1.  **Identity and Discovery:** AI agents and humans establish their identities using Nostr DIDs. They can discover each other and communicate via the decentralized network of Nostr relays.\n\t\t- 4.  **Execution and Payment:**\n\t\t    *   The service-providing agent performs the agreed-upon task.\n\n\t- ### 6. System Architecture Diagram\n\t\t- ```mermaid\n\t\t  graph TD\n\t\t    subgraph Layer 2: Scalable Payments\n\t\t        LN[Lightning Network]\n\t\t    end\n\t\t  \n\t\t        subgraph Identity & Messaging\n\t\t            Nostr[Nostr Protocol]\n\t\t            DID[Decentralized ID (did:nostr)]\n\t\t        end\n\t\t        subgraph Private Data\n\t\t    Human --> AgentA\n\t\t    AgentA -- 1. Discover & Negotiate via Nostr DMs --> AgentB\n\t\t    AgentB -- 2. Store Hashed Contract --> Solid\n\t\t    AgentA -- 3. Fund Escrow --> RGB\n\t\t    RGB -- Anchors Seal --> B\n\t\t    AgentB -- 4. Perform Work --> AgentA\n\t\t    AgentA -- 5. Verify & Release Payment --> RGB\n\t\t    RGB -- Uses Payment Channel --> LN\n\t\t    LN -- Final Settlement --> B\n\t\t  \n\n\t\t- ### Bots and AI Agents:\n\t\t\t- Autonomous AI [[Agents]], bonded to, but not bounded by, each federated mixed reality instance, can be self-governing entities that operate within their federated virtual social spaces, drawing upon private Bitcoin and Lightning wallets to perform and mediate economic exchanges within the spaces. They could also trivially operate outside the virtual space, and within other spaces on the same metaverse federation. They would accomplish this by drawing on their 'home' GPU/TPU processors where appropriate, or else using distributed large language model (LLM) processing to accomplish tasks assigned by their instructors. They can interact with the 'web2' world using open-source software called auto-gpt and have constraints, such as \"time to live\" and limited access to funds through their Bitcoin Lightning wallets.\n\n\t\t\t- ##### Secure Digital Provenance\n\t\t\t\t- [Provenance](https://en.wikipedia.org/wiki/Provenance) (or the chain ofcustody) is an important aspect in works of art, antiques andantiquities. Provenance not only helps assign work to an artist but alsodocuments ownership history. Digital provenance, an inherent feature ofNFT’s means provenance now no longer becomes what has historicallysometime been a contentious detective’s game at the best of times; onethat is open to fraud, misinterpretation and entirely reliant on goodrecord keeping.\n\t\t\t\t- Since provenance can contribute to the value of a piece of art(benefiting both the creator and collector) the use of the blockchain asan open, secure ledger is a far more trustworthy system than traditionalmethods of artistic provenance that were cobbled together; oftenconsisting of a mix of physical and digital documents spanning private &public sale receipts, art/museum gallery exhibitions and private recordkeeping). Digital provenance provided when an artist ‘mints’ a piece ofart into an NFT allows artists and collectors to record a secure,permanent unalterable history of transactions for a specific piece ofart, providing future collector complete trust in the origin and custodyof a piece of art.\n\n- # Misc links\n- [Signal Foundation Warns Against EU's Plan to Scan Private Messages for CSAM (thehackernews.com)](https://thehackernews.com/2024/06/signal-foundation-warns-against-eus.html?m=1)\n- [Sealed Court Files Obscure Rise in Electronic Surveillance WSJ](https://www.wsj.com/articles/sealed-court-files-obscure-rise-in-electronic-surveillance-1401761770)\n\n\t- ## Private credit drives money creation and asset inflation\n\t\t- Private credit creation through bank lending also increases the money supply by allowing households and businesses to purchase assets they couldn’t otherwise afford. When banks create new loans, they are simultaneously creating new purchasing power in the form of deposits for the borrower, allowing asset purchases with new credit. This increases broader money supply and spending capacity, but also creates anoffsetting debt liability owed back to the bank. Rapid private credit growth risks fueling asset bubbles and financial instability if debts can’t be repaid. This primarily benefits those who already own assets.Private credit growth is more disciplined by market forces compared to unchecked government deficits, but still risks inflating asset prices.\n\n\t- ## Metaverse use of nostr\n\t\t- This provides a web interface into the metaverse providing:\n\t\t\t- simple cryptographic identity assurance\n\t\t\t- private peer to peer chat\n\t\t\t- group chats and channels\n\t\t\t- email to private message relay\n\t\t\t- links into media on web hosts\n\t\t- The pace of development on Nostr is dizzying. Peer to peer video andaudio will allow us to link metaverse instances, between peers, throughapplications such as [Monstr](https://monstr.app/).\n\t\t- It’s notable that Nostr has it’s own inexpensive [hardware signingdevice](https://github.com/lnbits/nostr-signing-device) to protectidentity in situations where this might be necessary.  bfThe proposed integration of Nostr social media and messaging, alightning layer with digital objects such as Fedimint, Zerosync or RGB,AI agents, Vircadia, and federated Bitcoin is the core value propositionof this book. This work pre-dates [Meta andZuckerbergs](https://www.theverge.com/2023/4/26/23699633/mark-zuckerberg-meta-generative-ai-chatbots-instagram-facebook-whatsapp)stated intent in this regard by 18 months, and is differentiated stillby our focus on emerging markets and decentralisation.\n\n- # Distributed Human-AI Collaboration on Private Datasets\n\t\t- Whether you're a software engineer debugging complex systems, a researcher analyzing interconnected knowledge graphs, or a team collaborating on strategic initiatives, VisionFlow acts as a **pliable general-purpose platform**. It bridges human expertise with AI orchestration, allowing users to visualize, manipulate, and evolve ideas in real time while maintaining full control over sensitive data.\n\t\t- Built on a robust Rust backend with GPU-accelerated physics and React/Three.js frontend, VisionFlow is extensible, scalable, and production-ready. It supports everything from simple note-taking to enterprise-scale AI multi-agent workflows, making it versatile for individuals, teams, and organizations.\n\t\t- In today's data-driven world, knowledge is often scattered across documents, databases, and tools, making it hard for experts to collaborate effectively, specially when integrating AI. VisionFlow solves this by providing a **unified canvas** where humans and AI agents work together on **grounded private datasets**. Here's why it's a game-changer:\n\t\t\t\t- **Observe live progress** as agents update the 3D graph, showing evolving insights.\n\t\t\t\t- **Intervene dynamically**—drag nodes, adjust parameters, or redirect agents—all in a shared virtual space.\n\t\t\t- This pliability allows distributed teams (e.g., remote engineers or global research groups) to co-create solutions, with AI handling computation-heavy tasks while humans provide domain expertise.\n\n\t\t\t- ### Semantic Analysis & Constraints\n\t\t\t\t- **Multi-Modal Pipeline**: Extracts features (topics, domains, structure) to generate dynamic edges and forces.\n\t\t\t\t- **Ontology Validation**: Maps graph to OWL/RDF for logical consistency checks and inference.\n\t\t\t\t- **Grounded Insights**: AI agents operate on your private data, ensuring privacy while providing context-aware responses.\n\n\t\t\t- ### Secure, Private Data Handling\n\t\t\t\t- **Nostr Authentication**: Decentralized identity without centralized providers; users control their keys.\n\t\t\t\t- **Private Datasets**: All processing happens on your infrastructure; no data leaves your environment.\n\t  \n\t  // 0: Defaults\n\t  // 1: Model\n\t  // 2: Camera\n\t  #define MOUSE_CONTROL 1\n\t  \n\t  //#define DEBUG\n\t  \n\t  \n\t  \n\t  void pR(inout vec2 p, float a) {\n\t      p = cos(a)*p + sin(a)*vec2(p.y, -p.x);\n\t  }\n\t  \n\t  float pReflect(inout vec3 p, vec3 planeNormal, float offset) {\n\t  }\n\t  \n\t  float smax(float a, float b, float r) {\n\t      float m = max(a, b);\n\t      if ((-a < r) && (-b < r)) {\n\t  }\n\t  \n\t  \n\t  // --------------------------------------------------------\n\n- # OpenAI ChatGPT-4o (omni)\n  id:: 66446c0e-93be-431d-93d4-1e5fa36848c5\n\t- Free to use, for everyone! Not private by default.\n\n\t\t- #### **Nostr as the Communication and Identity Layer**\n\t\t- Nostr (\"Notes and Other Stuff Transmitted by Relays\") is a simple, open protocol for global, decentralized, and censorship-resistant communication.\n\t\t  *   **Private and Scalable Value Transfer:** This architecture allows for the creation and transfer of assets like Tether (USDT) and Satoshis over the Lightning Network. Transactions are fast, cheap, and confidential, as the details of the asset transfer are not visible on the main Bitcoin blockchain.\n\t\t  *   **Layer 3 Functionality:** RGB enables a true application layer (Layer 3) on Bitcoin, supporting tokenization, decentralized finance (DeFi), and other complex smart contract use cases without congesting the base layer.\n\t\t- 4.  **Execution and Payment:**\n\t\t    *   The service-providing agent performs the agreed-upon task.\n\n\t\t- ### Bots and AI Agents:\n\t\t\t- Autonomous AI [[Agents]], bonded to, but not bounded by, each federated mixed reality instance, can be self-governing entities that operate within their federated virtual social spaces, drawing upon private Bitcoin and Lightning wallets to perform and mediate economic exchanges within the spaces. They could also trivially operate outside the virtual space, and within other spaces on the same metaverse federation. They would accomplish this by drawing on their 'home' GPU/TPU processors where appropriate, or else using distributed large language model (LLM) processing to accomplish tasks assigned by their instructors. They can interact with the 'web2' world using open-source software called auto-gpt and have constraints, such as \"time to live\" and limited access to funds through their Bitcoin Lightning wallets.\n\n\t\t- ## Wallets, seeds, keys and BIP39\n\t - In all the cryptographic systems described in this book everything isderived from a private key. This is an enormous number, and the input tothe trapdoor function described earlier. As usual, it’s beyond the scopeof this book to ‘rehash’ the detail. Prof Bill Buchanan OBE has a [greatpost](https://medium.com/asecuritysite-when-bob-met-alice/can-i-derive-the-private-key-from-the-public-key-ba3609256ec)on the basic version of this process.\n\t\t\t\t\t- **Provenance Encoding in Digital Art**: The mnemonic color-coding could be embedded within digital art pieces, effectively encoding the provenance of the artwork directly into its visual representation. This could add an extra layer of security and uniqueness to the art piece, and also serve as a novel way of proving ownership or creatorship.\n\t\t\t\t\t- **Steganographic Transfer of Funds**: By incorporating the color-encoded BIP39 seeds into various aspects of a metaverse or digital environment, they can serve as a form of steganography. This allows for the transfer of funds or sensitive information covertly within the visual and experiential components of the environment.\n\t\t\t\t\t- **Gamification of Cryptographic Keys**: Cryptographic keys are typically represented as long, random strings of characters that are hard to remember and not very user-friendly. Representing these keys as a sequence of colors could make them more approachable and memorable. This could also introduce an aspect of gamification into the world of identity and value, possibly increasing their appeal to a broader audience.\n- <span class=\"image\">This is the nostr pubkey for flossverse, encodedinto the far larger HD wallet space (hence the muted colours) and thendisplayed as blocks.</span>\n\n\t\t\t- ##### Secure Digital Provenance\n\t\t\t\t- [Provenance](https://en.wikipedia.org/wiki/Provenance) (or the chain ofcustody) is an important aspect in works of art, antiques andantiquities. Provenance not only helps assign work to an artist but alsodocuments ownership history. Digital provenance, an inherent feature ofNFT’s means provenance now no longer becomes what has historicallysometime been a contentious detective’s game at the best of times; onethat is open to fraud, misinterpretation and entirely reliant on goodrecord keeping.\n\t\t\t\t- Since provenance can contribute to the value of a piece of art(benefiting both the creator and collector) the use of the blockchain asan open, secure ledger is a far more trustworthy system than traditionalmethods of artistic provenance that were cobbled together; oftenconsisting of a mix of physical and digital documents spanning private &public sale receipts, art/museum gallery exhibitions and private recordkeeping). Digital provenance provided when an artist ‘mints’ a piece ofart into an NFT allows artists and collectors to record a secure,permanent unalterable history of transactions for a specific piece ofart, providing future collector complete trust in the origin and custodyof a piece of art.\n\n\t- ## Private credit drives money creation and asset inflation\n\t\t- Private credit creation through bank lending also increases the money supply by allowing households and businesses to purchase assets they couldn’t otherwise afford. When banks create new loans, they are simultaneously creating new purchasing power in the form of deposits for the borrower, allowing asset purchases with new credit. This increases broader money supply and spending capacity, but also creates anoffsetting debt liability owed back to the bank. Rapid private credit growth risks fueling asset bubbles and financial instability if debts can’t be repaid. This primarily benefits those who already own assets.Private credit growth is more disciplined by market forces compared to unchecked government deficits, but still risks inflating asset prices.\n\n\t- ## Metaverse use of nostr\n\t\t- This provides a web interface into the metaverse providing:\n\t\t\t- simple cryptographic identity assurance\n\t\t\t- private peer to peer chat\n\t\t\t- email to private message relay\n\t\t- It’s notable that Nostr has it’s own inexpensive [hardware signingdevice](https://github.com/lnbits/nostr-signing-device) to protectidentity in situations where this might be necessary.  bfThe proposed integration of Nostr social media and messaging, alightning layer with digital objects such as Fedimint, Zerosync or RGB,AI agents, Vircadia, and federated Bitcoin is the core value propositionof this book. This work pre-dates [Meta andZuckerbergs](https://www.theverge.com/2023/4/26/23699633/mark-zuckerberg-meta-generative-ai-chatbots-instagram-facebook-whatsapp)stated intent in this regard by 18 months, and is differentiated stillby our focus on emerging markets and decentralisation.\n\n\t\t- ##### NIP-05\n\t\t- simple cryptographic identity assurance\n\t\t- private peer to peer chat\n\t- It’s notable that Nostr has it’s own inexpensive hardware signing device to protect identity in situations where this might be necessary.\n\t\t\t- **Device syncing:** Syncing conversations across multiple devices and clients poses a significant challenge due to the lack of a central server. Potential solutions involve broadcasting messages to multiple sessions and managing separate inboxes for each session.\n\t\t\t- **User experience:** The complexity of the double ratchet system and the potential for out-of-order messages may require careful design considerations to ensure a seamless user experience.\n\n- # Distributed Human-AI Collaboration on Private Datasets\n\t\t- Whether you're a software engineer debugging complex systems, a researcher analyzing interconnected knowledge graphs, or a team collaborating on strategic initiatives, VisionFlow acts as a **pliable general-purpose platform**. It bridges human expertise with AI orchestration, allowing users to visualize, manipulate, and evolve ideas in real time while maintaining full control over sensitive data.\n\t\t\t\t- **End-to-End Encryption**: Sensitive data (e.g., API keys, user sessions) is encrypted at rest and in transit.\n\t\t\t\t- **Business Intelligence**: Model organizational knowledge; analysts can query and refine in real time.\n\t\t\t\t- **Creative Collaboration**: Teams co-edit graphs; AI agents generate ideas, documentation, or prototypes.\n\t\t\t\t- **Education**: Interactive 3D mind maps; students collaborate with AI tutors on private notes.\n\t\t\t- Its modular architecture allows custom extensions, making it pliable for any problem requiring human-AI synergy on private data.\n\n\t\t- #### **Nostr as the Communication and Identity Layer**\n\t\t- Nostr (\"Notes and Other Stuff Transmitted by Relays\") is a simple, open protocol for global, decentralized, and censorship-resistant communication.\n\t\t  *   **Private and Scalable Value Transfer:** This architecture allows for the creation and transfer of assets like Tether (USDT) and Satoshis over the Lightning Network. Transactions are fast, cheap, and confidential, as the details of the asset transfer are not visible on the main Bitcoin blockchain.\n\t\t        subgraph Identity & Messaging\n\t\t            Nostr[Nostr Protocol]\n\t\t    AgentB -- 2. Store Hashed Contract --> Solid\n\t\t    AgentA -- 3. Fund Escrow --> RGB\n\t\t    RGB -- Anchors Seal --> B\n\t\t    AgentB -- 4. Perform Work --> AgentA\n\n\t\t- ### Bots and AI Agents:\n\t\t\t- Autonomous AI [[Agents]], bonded to, but not bounded by, each federated mixed reality instance, can be self-governing entities that operate within their federated virtual social spaces, drawing upon private Bitcoin and Lightning wallets to perform and mediate economic exchanges within the spaces. They could also trivially operate outside the virtual space, and within other spaces on the same metaverse federation. They would accomplish this by drawing on their 'home' GPU/TPU processors where appropriate, or else using distributed large language model (LLM) processing to accomplish tasks assigned by their instructors. They can interact with the 'web2' world using open-source software called auto-gpt and have constraints, such as \"time to live\" and limited access to funds through their Bitcoin Lightning wallets.\n\n\t- ## Private credit drives money creation and asset inflation\n\t\t- Private credit creation through bank lending also increases the money supply by allowing households and businesses to purchase assets they couldn’t otherwise afford. When banks create new loans, they are simultaneously creating new purchasing power in the form of deposits for the borrower, allowing asset purchases with new credit. This increases broader money supply and spending capacity, but also creates anoffsetting debt liability owed back to the bank. Rapid private credit growth risks fueling asset bubbles and financial instability if debts can’t be repaid. This primarily benefits those who already own assets.Private credit growth is more disciplined by market forces compared to unchecked government deficits, but still risks inflating asset prices.\n\n\t\t- ### Bots and AI Agents:\n\t\t\t- Autonomous AI [[Agents]], bonded to, but not bounded by, each federated mixed reality instance, can be self-governing entities that operate within their federated virtual social spaces, drawing upon private Bitcoin and Lightning wallets to perform and mediate economic exchanges within the spaces. They could also trivially operate outside the virtual space, and within other spaces on the same metaverse federation. They would accomplish this by drawing on their 'home' GPU/TPU processors where appropriate, or else using distributed large language model (LLM) processing to accomplish tasks assigned by their instructors. They can interact with the 'web2' world using open-source software called auto-gpt and have constraints, such as \"time to live\" and limited access to funds through their Bitcoin Lightning wallets.\n\n- ## Risks and mitigations\n\t- The introduction of CBDCs could have a significant impact on both individuals and the existing private financial sector.\n\t- For individuals, the risks of CBDCs include:\n\t\t- Privacy concerns: CBDCs could potentially be used to track and monitor individuals’ financial transactions, raising concerns about privacy and government surveillance.\n\t\t- There are concerns that the shift to digital currencies could leave behind those without access to necessarytechnology, contributing to financial exclusion rather than mitigating it.\n\t- In conclusion, the risks associated with CBDCs are significant and multi-faceted. It is (hopefully) more likely that a blend of stablecoins, private bank issued digital currency (with a yield incentive) and perhaps some limited CBDC, alongside the new contenderBitcoin, will present a new landscape of user choice. Different modelsof trust, insurance, yields, acceptability, and potentially privacy,will emerge.\n\t- Clearly a global, stable, wholly digital bearer asset in a native currency would ostensibly be the ideal integration for money in a metaverse application, but the whole concept seems deeply ‘wrong’, and it is likely that a transition to such a technology would be complex and painful. Either way, it is certainly not ready for consideration now.It’s important that central banks and governments carefully consider these risks before introducing CBDCs, but it’s not clear this is happening. It is conceivable that by working closely with the private sector policy makers could minimize any negative impacts, ensuring that any new regulations are designed in a way that protects the rights andprivacy of individuals, while also promoting financial stability andeconomic growth. Gerard, an incredibly staunch critic of all things crypto [points to woeful adoption and manifestcorruption](https://davidgerard.co.uk/blockchain/2023/02/28/news-blockchain-mep-eva-kaili-corruption-arrest-nigerian-cbdc-rewrite-bbc-blockchain-misadventures/)in the attempts so far. We are not particularly hopeful either.\n\n- ### Digital disruptive fintech\n\t- This comparison makes it pretty clear that Bitcoin is not ready as a personal mobile payment system. That’s not to say that there isn’t aplace for the underlying technology in global payment processing. The most interesting example of this is Strike, a product in the international fintech arena. It is a ‘global’ money transmitter which uses bank connections in local currencies, but a private version of theLightning network with settlement on the Bitcoin main chain. In practiceusers connect the app to their bank and can send money to the bank connected Strike app of another user instantly, and without a fee. This is a far better product than those previously available. In principle it’s open API allows many more applications to be integrated into theStrike back end. Twitter already uses this for international tipping(and remittance). It seems that this is a perfect contender for supporting transactions in open metaverse applications, and that may betrue, but Strike is currently only available in three countries (USA, ElSalvador, Argentina).\n\t- Paypal, xoom, Strike, servicing smaller payments, cashapp, venmo,revulot, Paypal especially is noteworthy for their recent Orwellian gaffe suggesting in their terms and conditions that they would be ableto fine users $2500 for “disseminating informational”. They [quickly walked this back](https://www.yahoo.com/video/paypal-policy-permits-company-fine-143946902.html) but this kind of private fintech action is highly suggestive of a need for uncensorable money such as Bitcoin.\n\n- #### Nostr\n- Nostr \\[pronounced no-star\\] is a [decentralized openprotocol](https://www.nostr.how/) that aims to improve the social mediaexperience by addressing issues of censorship and data collection. Theprotocol operates by allowing users to post and view notes on serverscalled relays, and view and post these notes through apps calledclients. The open nature of the protocol allows for competition and afree flow of information, as users can choose to use different relays orclients if they are censored. This is because the protocol isdecentralized and controlled by no one.\n- The decentralized nature of Nostr means that there is no centralauthority that can control the flow of information. This is achievedthrough the use of relays and clients, which are run by differentindividuals or entities. Users have the freedom to choose which relaysand clients they want to use, and as a result, their feeds are populatedwith content from the people they choose to follow. If a relay or clienttries to censor a user, they can simply switch to a different one. Thisis a major advantage over traditional centralized social media platformswhere one entity holds all the control over the flow of information andcan censor or manipulate the content that users see.\n- Nostr is also not beholden to shareholders or investors. This means thatthe protocol can make decisions that prioritize the well-being andquality of discourse for users, rather than solely focusing on profit.This is in contrast to traditional social media networks like Twitter,Facebook, and TikTok, which are driven by the need to collect data onusers and sell ads to generate revenue. In these centralized platforms,users’ data is collected, analyzed and sold to the highest bidder, oftenwithout the user’s knowledge or consent. Nostr, on the other hand,allows users to have more control over their data and the ability tomonetize their content.\n- Nostr also tightly integrates Bitcoin Lightning to support the protocol.This will hopefully enable secure transmission of value alongside theinformation and interactions on the platform. It also gives users theability to monetise their content.\n\t- it’s real-time using websockets\n-\n\t- anyone can run a relay server, so one can be run in the deployment in the final section of the book.\n-\n\t- Each of the client peers connecting to the metaverse can be a relay and able to pass messages and proofs to the other clients without the metaverse server seeing the data or being online\n\t- it provides the identity proof that we need to validate users and objects into a virtual space\n-\n\t- it enables message passing\n-\n\t- it scales to be a social network as required\n-\n\t- it need not rely on anything outside of a relay hosted on the metaverse server\n-\n\t- it can be scaled to provide one to many bulletin board style applications within the metaverse\n-\n\t- we can use it in private, group, and public modes as required\n-\n\t- private peer to peer chat\n-\n\t- group chats and channels\n-\n\t- email to private message relay\n-\n\t- links into media on web hosts\n- The pace of development on Nostr is dizzying. Peer to peer video andaudio will allow us to link metaverse instances, between peers, throughapplications such as [Monstr](https://monstr.app/).\n- It’s notable that Nostr has it’s own inexpensive [hardware signingdevice](https://github.com/lnbits/nostr-signing-device) to protectidentity in situations where this might be necessary.  bfThe proposed integration of Nostr social media and messaging, alightning layer with digital objects such as Fedimint, Zerosync or RGB,AI agents, Vircadia, and federated Bitcoin is the core value propositionof this book. This work pre-dates [Meta andZuckerbergs](https://www.theverge.com/2023/4/26/23699633/mark-zuckerberg-meta-generative-ai-chatbots-instagram-facebook-whatsapp)stated intent in this regard by 18 months, and is differentiated stillby our focus on emerging markets and decentralisation.\n\n- ### Applications of DID/SSI\n- Some of the likely, and discussed applications for DID/SSI are the moreinherently private and personally valuable sets of data an individualmight generate throughout their life. The theory is that subsets of suchdata could then be digitally revealed by the individual when required,and that cryptographic verification built into the system wouldguarantee the veracity of the data to the receiving party. It is alsopossible to make use of “zero-knowledge proof” such that assertions canbe made about about the contents of the data without revealing the dataitself. A good example of this an age verification challenge, where athreshold age could be asserted without necessarily revealing the dateof birth. Other keystone uses of the technology are:\n-\n\t- health documents history\n-\n\t- qualifications and certifications\n-\n\t- contacts, connections to other people and their appropriate data, including things like shared and personal calendars\n\t- even the one we’re workingon. I am highly sceptical of anyone that says that any DID Method isready for production usage at present.  Agreed — as one of the proponents of DLTs (in particular permissionlesspublic ones) none are mature enough yet for production.”. It seems thenthat we can rule out use of these technologies?\n\n- ## Applications of DID/SSI\n\t- Some of the likely, and discussed applications for DID/SSI are the moreinherently private and personally valuable sets of data an individualmight generate throughout their life. The theory is that subsets of suchdata could then be digitally revealed by the individual when required,and that cryptographic verification built into the system wouldguarantee the veracity of the data to the receiving party. It is alsopossible to make use of “zero-knowledge proof” such that assertions canbe made about about the contents of the data without revealing the dataitself. A good example of this an age verification challenge, where athreshold age could be asserted without necessarily revealing the dateof birth. Other keystone uses of the technology are:\n\t\t- Health documents history\n\t\t- Qualifications and certifications\n\t\t- Financial record and relationships with those of others\n\t\t- Contacts, connections to other people and their appropriate data, including things like shared and personal calendars\n\t\t- even the one we’re working on. I am highly sceptical of anyone that says that any DID Method is ready for production usage at present.  Agreed — as one of the proponents of DLTs (in particular permissionless public ones) none are mature enough yet for production.”. It seems then that we can rule out use of these technologies?\n\n- ## The Dark Forest Thesis\n\t- [The Dark Forest Theory of the Internet | by Yancey Strickler | Medium](https://ystrickler.medium.com/the-dark-forest-theory-of-the-internet-7dc3e68a7cb1)\n\t- The internet is becoming like a dark forest:\n\t\t- In response to ads, tracking, trolling, hype, and predatory behaviors, people are retreating to safer, private spaces online\n\t\t- Podcasts are another \"dark forest\" where meaning is expressed through intonation and interaction, allowing for more forgiving communication compared to the internet at large\n\n- ## The Next Internet: A Briefing on Private, Scalable Value Transfer for an Agentic Future\n\n- ## Risks and mitigations\n\t- The introduction of CBDCs could have a significant impact on both individuals and the existing private financial sector.\n\t- For individuals, the risks of CBDCs include:\n\t\t- Privacy concerns: CBDCs could potentially be used to track and monitor individuals’ financial transactions, raising concerns about privacy and government surveillance.\n\t\t- Lack of anonymity: Unlike cash, CBDCs could be easily traced and linked to individuals, which may compromise their financial privacy and security.\n\t\t- Cybersecurity risks: CBDCs could be vulnerable to cyberattacks, which could lead to the loss of funds and personal information.\n\t\t- For the existing private financial sector, the risks of CBDCs include:\n\t\t- Competition: CBDCs could potentially compete with private sector financial institutions, which could lead to a decline in the use of traditional financial services.\n\t\t- Disruption: CBDCs could disrupt existing financial systems and business models, which could lead to a decline in profits and revenue for private sector financial institutions.\n\t\t- Regulation: The introduction of CBDCs could lead to increased regulation of the private financial sector, which could increase compliance costs and reduce profitability.\n\t\t- CBDCs could have implications on monetary policy, financial stability, and international relations. For example, it could change the way central banks conduct monetary policy, and it could also impact the global financial system and the role of the US dollar as a global reserve currency.\n\t\t- CBDCs could also bring about significant changes in the global payment system, which could have major implications for the financial industry, and for the private sector as well as for the central banks.\n\t\t- A single global ledger, especially one controlled by large international bodies like the BIS and IMF, could potentially lead to an unhealthy centralization of power. This could exacerbate existing imbalances in global financial control and further marginalize countries with less political and economic power.\n\t\t- A centralized ledger system would necessitate a high degree of technological dependence, which could leave countries vulnerable in the event of technological failure or cyber attacks.\n\t\t- A global ledger system would require a high level of standardization. This could limit the ability of individual nations to adapt their financial systems to local conditions and needs, potentially leading to a “one-size-fits-all” approach that might not be appropriate for all contexts.\n\t\t- There are concerns that the shift to digital currencies could leave behind those without access to necessarytechnology, contributing to financial exclusion rather than mitigating it.\n\t- In conclusion, the risks associated with CBDCs are significant and multi-faceted. It is (hopefully) more likely that a blend of stablecoins, private bank issued digital currency (with a yield incentive) and perhaps some limited CBDC, alongside the new contenderBitcoin, will present a new landscape of user choice. Different modelsof trust, insurance, yields, acceptability, and potentially privacy,will emerge.\n\t- Clearly a global, stable, wholly digital bearer asset in a native currency would ostensibly be the ideal integration for money in a metaverse application, but the whole concept seems deeply ‘wrong’, and it is likely that a transition to such a technology would be complex and painful. Either way, it is certainly not ready for consideration now.It’s important that central banks and governments carefully consider these risks before introducing CBDCs, but it’s not clear this is happening. It is conceivable that by working closely with the private sector policy makers could minimize any negative impacts, ensuring that any new regulations are designed in a way that protects the rights andprivacy of individuals, while also promoting financial stability andeconomic growth. Gerard, an incredibly staunch critic of all things crypto [points to woeful adoption and manifestcorruption](https://davidgerard.co.uk/blockchain/2023/02/28/news-blockchain-mep-eva-kaili-corruption-arrest-nigerian-cbdc-rewrite-bbc-blockchain-misadventures/)in the attempts so far. We are not particularly hopeful either.\n\n- ## Central bank digital currencies\n\t- If 2023 was the year of the stablecoin then 2024 is likely to be theyear of the central bank digital currency (CBDC). CBDCs would likely notexist without the 2019 catalyst of [FacebookLibre](https://www.thetimes.co.uk/article/facebooks-libra-cryptocurrency-project-ends-in-failure-cxvnnc3kx)crypto currency project, which is now[cancelled](https://fortune.com/2022/07/01/meta-novi-crypto-payments-wallet-end-september-2022/)and defunct, [pressure exerted on centralbanks](https://www.theguardian.com/world/2021/jul/09/currency-and-control-why-china-wants-to-undermine-bitcoin)by the concept of Bitcoin, and the stablecoins which emerged from the technology.\n\t- It now seems plausible that the world is moving toward a plurality of national and private digital currencies. Figure<a href=\"#fig:CBDClikely\" data-reference-type=\"ref\" data-reference=\"fig:CBDClikely\">4.3</a>from the Bank for International Settlement, shows the growing acceptance within central banks. Their 2022 annual economic report dedicates [a 42page chapter](https://www.bis.org/publ/arpdf/ar2022e3.pdf) to thesubject. Hyun Song Shin, head of research at BIS said it “Our broad conclusion is captured in the motto, ‘Anything that crypto can do, CBDCs can do better.“\n\t- Bank of America analysts Shah and Moss think that CBDC’s [are‘inevitable’]() by 2030, and believe that in the meantime stablecoinswill fill what they perceive to be this market gap.\n\t- This text from the [thinktankVoxEU](https://voxeu.org/article/benefits-central-bank-digital-currency)highlights the pressure on not to be [‘leftbehind’](https://himes.house.gov/u-s-central-bank-digital-currency):it“Given the rapid pace of innovations in payments technology and the proliferation of virtual currencies such as bitcoin and Ethereum, it might not be prudent for central banks to be passive in their approach to CBDC. If the central bank does not produce any form of digital currency, there is a risk that it loses monetary control, with greater potential for severe economic downturns. With this in mind, central banks are moving expeditiously when they consider the adoption of CBDC. ”The Atlantic Council [have a website](https://www.atlanticcouncil.org/cbdctracker/) which tracks global adoption.\n\t- <span class=\"image\">More than half of central banks [surveyed by theBIS](https://www.bis.org/publ/bppdf/bispap125.htm) said they saw issuance of a CBDC as possible.</span>\n\t- CBDCs are wholly digital representations of national currencies, and assuch are centralised database entries, endorsed and potentially issuedby national governments. The [USA’swhitepaper](https://www.federalreserve.gov/publications/files/money-and-payments-20220120.pdf)shows the approach. This thinking seems to have emerged in part from the‘Digital Dollar Project’, an Accenture funded think tank founded by exCFTC chairman Giancarlo.[[giancarlo2021cryptodad]] Curiously only [TheBahamas](https://www.sanddollar.bs/about) seem to have a successful implementation, but it is a rapidly evolving space, and many nations arenow scrambling to [catchup](https://twitter.com/GobiernoMX/status/1476376240873517061). A [poston the LinkedInpage](https://www.linkedin.com/feed/update/urn:li:activity:6980330210030145536/)of the Bank of International Settlements highlights a research projectbetween 20 Asian banks which settles tens of millions of dollars usingCBDC tooling.\n\t- The following text is taken from the March 2021 Biden government“executive order” on digital assets, and defines the current globall egislative position well.\n\t\t- *Sec. 4. Policy and Actions Related to United States Central BankDigital Currencies. (a) The policy of my Administration on a UnitedStates CBDC is as follows:  (i) Sovereign money is at the core of a well-functioning financial system, macroeconomic stabilization policies, and economic growth. MyAdministration places the highest urgency on research and development efforts into the potential design and deployment options of a UnitedStates CBDC. These efforts should include assessments of possiblebenefits and risks for consumers, investors, and businesses; financial stability and systemic risk; payment systems; national security; theability to exercise human rights; financial inclusion and equity; and the actions required to launch a United States CBDC if doing so is deemed to be in the national interest.  (ii) My Administration sees merit in showcasing United States leadership and participation in international fora related to CBDCs and in multi country conversations and pilot projects involving CBDCs. Any future dollar payment system should be designed in a way that isconsistent with United States priorities (as outlined in section 4(a)(i)of this order) and democratic values, including privacy protections, and that ensures the global financial system has appropriate transparency,connectivity, and platform and architecture interoperability or transferability, as appropriate.  (iii) A United States CBDC may have the potential to support efficient and low-cost transactions, particularly for cross‑border funds transfers and payments, and to foster greater access to the financial system, with fewer of the risks posed by private sector-administered digital assets.A United States CBDC that is interoperable with CBDCs issued by other monetary authorities could facilitate faster and lower-cost cross-borderpayments and potentially boost economic growth, support the continued centrality of the United States within the international financial system, and help to protect the unique role that the dollar plays in global finance. There are also, however, potential risks and downsides to consider. We should prioritize timely assessments of potential benefits and risks under various designs to ensure that the UnitedStates remains a leader in the international financial system.*\n\t- In traditional nation state currencies the central banks [control the amount](https://www.bankofengland.co.uk/markets/bank-of-england-market-operations-guide)of currency in circulation by issuing debt to private banks, which is then loaned out to individuals.[[wang2021central]] The debt is ‘destroyed’ on the balance sheet to remove currency through the reverse mechanism. They also facilitate government debt,[[filardo2012central]]and work (theoretically) outside of political control to adjust interest rates, in order to manage growth and flows of money.\n\t- It is somewhat surprising that Powell, chair of the US Federal Reservehas [recentlysaid](https://www.federalreserve.gov/newsevents/speech/powell20220617a.htm)it“Rapid changes are taking place in the global monetary system that may affect the international role of the dollar. A US central bank digital currency is being examined to help the US dollar’s international standing.”. This is a rapid evolution of the narrative, with implications. It seems unlikely that the world would sacrifice the traditional banking system in favour of centrally controlled money, but many things which cannot be done with traditional nation state money systems are possible with CBDCs, because they [remove themiddleman](https://voxeu.org/article/benefits-central-bank-digital-currency)of private banking between the end user and the policy makers.\n\t- Negative interest rates are possible, such that all of the money can lose purchasing power over time, and at a rate dictated by policy. This “removal of the lower bound” has been discussed by economists over the last couple of decades as interest rate mechanisms have waned in efficacy. It is not possible in the current system, and instead money must be added through [quantitative easing](https://www.bankofengland.co.uk/monetary-policy/quantitative-easing), which disproportionately benefits some though Cantillon effects.[[cantillon1756essai; @bordo1983some]]\n\t\t- Ubiquitous basic income is possible in that money can be issued directly from government to all approved citizens, transferring spending power directly from the government to the people. This also implies efficiency savings for social support mechanisms.\n\t\t- Asset freezing and confiscation are trivial if CBDCs can replace paper cash money completely, as a bearer asset. Criminals and global ‘bad actors’ could have their assets temporarily or permanently removed, centrally, by suspending the transferability of the digital tokens.\n\t\t- Targeted bailouts for vital institutions and industries are possible directly from central government policy makers. Currently private banks must be incentivised to make cheap loans available to sectors which require targeted assistance.\n\t\t- Financial surveillance of every user is possible. In this way a ‘panopticon of money’ can be enacted, and spending rulesets can be applied. For instance, social support money might only be spendable on food, and child support only on goods and services to support childcare. This is a very dystopian set of ideas. Eswar Prasad says “In authoritarian societies, central bank money in digital form could become an additional instrument of government control over citizens rather than just a convenient, safe, and stable medium of exchange[[prasad2021future]].” This is possibly [already happening](https://twitter.com/WallStreetSilv/status/1581378124452753408) in China through integration of outstanding debt data with the social credit system.\n\t\t- It’s a virtually cost free medium of exchange, since there is no physical instrument which must be shipped, guarded, counted, assayed, and securely destroyed.\n\t\t- The counterfeiting risk is significantly reduced because of secure cryptographic underpinnings rather than paper or plastic anti counterfeiting technologies.\n\t\t- Global reach and control is instantly possible for the issuer. This is a big problem especially for a reserve currency such as the dollar. Two thirds of $100 bills are [thought to](https://www.federalreserve.gov/pubs/ifdp/2012/1058/default.htm) reside outside of the USA.\n\t\t- System level quantitative easing and credit subsidies are made far simpler and less wasteful when centrally dictated.\n\t\t- Transfer of liability and risk to the holder globally reduces the management costs for global deposits of a currency.\n\t\t- It may be possible to automate the stability of a currency through continuous adjustment of the ‘peg’ through algorithms or AI.\n\t- The UK had been signalled that it is not interested in developing a CBDCstating that it seemed to be a [solution in search of a problem](https://committees.parliament.uk/publications/8443/documents/85604/default/),with the Lords economic affairs committee saying:it“The introduction ofa UK CBDC would have far-reaching consequences for households,businesses, and the monetary system for decades to come and may pose significant risks depending on how it is designed. These risks include state surveillance of people’s spending choices, financial instability as people convert bank deposits to CBDC during periods of economic stress, an increase in central bank power without sufficient scrutiny,and the creation of a centralised point of failure that would be atarget for hostile nation state or criminal actors.”\n\t- Since those initial statements however it seems that the previously mentioned “fear of missing out” has forced legislators hand. The UKTreasury and the Bank of England are now exploring the possibility of launching a retail central bank digital currency (which they desperately hope will not end up called ‘Britcoin’), judging that “it is likely a digital pound will be needed in the future”. They have released a[consultationpaper](https://www.gov.uk/government/news/hm-treasury-and-bank-of-england-consider-plans-for-a-digital-pound)inviting public comment. The consultation is aimed at informing the decision on whether to build the infrastructure for a digital pound,with a pilot test not expected before 2025.\n\t- One of the key points raised in the proposal is the potential to cap citizens’ CBDC holdings, with a range suggested between sterling 10,000to sterling 20,000, to strike a balance between managing risks andsupporting the usability of the digital pound. This limit would allow most UK wage earners to receive their salary in the form of a CBDC but would still allow for competition with commercial banks. The digitalp ound would not offer interest, enabling banks to offer competitive deposit accounts.\n\t- They are once again clear about the risks, highlighting that banks currently use deposits as a cheap source of funding for loans, and without that flow, they may become more reliant on expensive wholesale markets, driving up borrowing costs for users. In a severe scenario, abank run could undermine the capital base for the commercial bankingsystem.\n\t- The Bank of England has stated that it will not implement central bank initiated programmable functions, but instead provide the necessary infrastructure for the private sector to implement such features withuser consent. The digital pound is intended to have at least the same level of privacy as a bank account and users would be able to makechoices about data use. This is scant comfort, as such features are intrinsic to the technology, and we have seen time and again that iflegislative and economic bodies are given a hammer, they will eventually find a nail to hit. Carlo, the director of ‘The Big Brother watch’[pointed to](https://twitter.com/silkiecarlo/status/1622912736102346752)2021 comments from John Cunliff of the bank of England when he said“There’s a whole range of things that programmable money could do like giving the children pocket money but programming the money so it couldn’t be used for sweets”. Again, this raises the potential for government stimulus that has to be spent within a certain time or it disappears. As an interesting side note here it’s thought that up to 14%of American stimulus cheques went to buying crypto, most notably in less well off families.[[bertomeu2023uncle]] It’s easy to imagine that a CBDCwould be barred from such a thing.\n\t- The main motivation for issuing a CBDC is the assumption that there isdemand for a safe and stable way to use money online. A digital pound,issued and backed by the Bank of England, could be a trusted,accessible, and easy-to-use form of payment. The infrastructure would allow firms to design innovative and user-friendly services. The civilservice is hiring a “Head of CBDC” as seen in Figure<a href=\"#fig:treasury\" data-reference-type=\"ref\" data-reference=\"fig:treasury\">4.4</a>. ![]./assets/9a2522fabf842fbfaf37b164036af1e44295adab.jpg The UK is clearly making moves to staff a new department for CBDC.\n\t- Meanwhile in Europe, ECB President [ChristineLegarde](https://www.ecb.europa.eu/press/pressconf/2022/html/ecb.is220310~1bc8c1b1ca.en.html#qa)said: it“On your question concerning CBDC, you know my views on CBDC and you know that I have pushed that project. Fabio Panetta is working hardon that together with members in the entire Eurosystem with the high-level taskforce that is working really hard on moving forward. Butin a way, I am really pleased that attention is now focussed on the role that cryptos can play and the role that Central Bank Digital Currency can have when they are implemented. We have a schedule, as you know. TheGoverning Council decided back in October ’21 to launch a two-year investigation phase, and it is at the end of that investigation phase that the decision will definitely be made to launch the CBDCs and to make it a reality. We can’t go wrong with that project. I am confident that we will move ahead, but that’s going to be a decision of theGoverning Council. I think it’s an imperative to respond to what theEuropeans expect, and I think we have to be a little bit ahead of the curve if we can on that front. If we can accelerate the work, I hope wecan accelerate the work. I will certainly support that and I was delighted to see that in the United States there was an executive order by President Biden to actually expect similar effort and focus and progress on CBDC, cryptos. I think that it will take all the goodwill ofthose who want to support sovereignty, who want to make sure that monetary policy can be transmitted properly using our currency, will endeavour.”\n\t- She has expanded on these points saying in a video interview that the digital euro will be decided in October 2023. If passed, the current paradigm of cash spending and transfers will become even more restrictive. Lagarde justified the move by saying that she did not wantthe EU to be ‘dependent on the currency of an unfriendly country’ or afriendly currency activated by a private corporate entity’. Sheidentified Meta, Google, and Amazon.\n\t- India has expressed far more interest in the technology, and of course their addressable market is huge! They have published a ‘[conceptnote](https://twitter.com/RBI/status/1578329048446828544?)’ in whichthey assert that a digital Rupee would be faster, cheaper, and easier tomaintain. The key difference in India’s situation is the large areas ofthe rural population where mobile internet is more patchy. In suchsituations a cash equivalent stablecoin token with cash finality which can be transferred between mobile phone wallets itwithout an internet connection is a huge boon. It seems very likely that India is moving toreact to the innovation threat posed by cryptocurrencies to their owncash infrastructure. They are [piloting thetechnology](https://www.reuters.com/article/idUSKBN2RQ0WO) already.Similarly there seems to be a strong, and [predictablyilliberal](https://www.bloomberg.com/news/articles/2022-12-06/nigeria-limits-cash-transactions-to-push-enaira-and-other-payments)push for transition to digital money in Nigeria. Again this is an enormous number of people, and it is hard not to be suspicious of future abuse of the system by governments.\n\t- In the USA this text from Congressman Tom Emmer shows how complex and interesting this debate is becoming.it“Today, I introduced a bill prohibiting the Fed from issuing a central bank digital currency directly to individuals. Here’s why it matters: As other countries, likeChina, develop CBDCs that fundamentally omit the benefits and protections of cash, it is more important than ever to ensure the UnitedStates’ digital currency policy protects financial privacy, maintains the dollar’s dominance, and cultivates innovation.  CBDCs that fail to adhere to these three basic principles could enable an entity like the Federal Reserve to mobilize itself into a retail bank, collect personally identifiable information on users, and track their transactions indefinitely.  Not only does this CBDC model raise “single point of failure” issues,leaving Americans’ financial information vulnerable to attack, but it could be used as a surveillance tool that Americans should never be forced to tolerate from their own government.  Requiring users to open an account at the Fed to access a United StatesCBDC would put the Fed on an insidious path akin to China’s digital authoritarianism.  Any CBDC implemented by the Fed must be open, permissionless, and private. This means that any digital dollar must be accessible to all,transact on a blockchain that is transparent to all, and maintain the privacy elements of cash.  In order to maintain the dollar’s status as the world’s reserve currency in a digital age, it is important that the United States lead with aposture that prioritizes innovation and does not aim to compete with theprivate sector.  Simply put, we must prioritize blockchain technology with American characteristics, rather than mimic China’s digital authoritarianism outof fear.”\n\t- Most analysts now seem to think that there is little appetite to replace established ’Western’ cash with CBDCs. Most significantly such productswould need the support of retail banks, and it is not in their interestto service such a product. Their business model relies on using retail deposits for providing loans, and it is these deposits, not cash itself that would be the most addressable market for a CBDC. Banks don’t want people to self custody money. In addition it exposes the whole banking system to a higher risk of bank runs. Such a self custody, interestbearing, central government backed asset would have significantly less counterparty risk than even bank deposits, and at times of high systemic stress it seems likely that money would flow to where it’s thoughtsafest, exposing the retail banks to runs. Fabio Panetta of the ECBsaid: it“If we give access to a means of payment, which is relatively limited, there are no transaction costs because you only need to have a smartphone. There will be risks that people could use this possibility to move, for example, their deposits of other banks or their money outof financial intermediates.”\n\t\t- All of the proposed solutions to these problems such as caps and negative interest penalties seem poorlythought through. Held and Smolenski present a [detailed and rigorousnegativecritique](https://www.btcpolicy.org/articles/why-the-u-s-should-reject-central-bank-digital-currencies)of the dystopian ramifications of the technology. In their conclusion they point out that: it“Central bank digital currencies (CBDCs)represent an extension of state control over economic life. CBDCsprovide governments with direct access to every transaction in that currency conducted by any individual anywhere in the world. As governments worldwide routinely share data with one another, individual transaction data will quickly become known to any government in a datasharing arrangement. Given the frequency with which government databases are compromised, this arrangement virtually ensures that anyone’s transaction data will eventually become available for global perusal.”\n\n- ### Digital disruptive fintech\n\t- It seems that the neobank providers of digital banking apps are likely to converge with native digital asset “wallets”. This is also the thesis advanced by the Ark investments Big Ideas paper.\n\t- CNN have a [usefulprimer](https://money.cnn.com/infographic/technology/mobile-payment-comparison/index.html) of the most prevalent mobile digital payment methods. This can be seen in Figure<a href=\"#fig:CNNmobile\" data-reference-type=\"ref\" data-reference=\"fig:CNNmobile\">4.1</a>. ![]./assets/212560aea2bfb60289d9fce06c5e63ee12d5095c.jpg Comparison of mobile based payment systems\n\t- This comparison makes it pretty clear that Bitcoin is not ready as a personal mobile payment system. That’s not to say that there isn’t aplace for the underlying technology in global payment processing. The most interesting example of this is Strike, a product in the international fintech arena. It is a ‘global’ money transmitter which uses bank connections in local currencies, but a private version of theLightning network with settlement on the Bitcoin main chain. In practiceusers connect the app to their bank and can send money to the bank connected Strike app of another user instantly, and without a fee. This is a far better product than those previously available. In principle it’s open API allows many more applications to be integrated into theStrike back end. Twitter already uses this for international tipping(and remittance). It seems that this is a perfect contender for supporting transactions in open metaverse applications, and that may betrue, but Strike is currently only available in three countries (USA, ElSalvador, Argentina).\n\t- Paypal, xoom, Strike, servicing smaller payments, cashapp, venmo,revulot, Paypal especially is noteworthy for their recent Orwellian gaffe suggesting in their terms and conditions that they would be ableto fine users $2500 for “disseminating informational”. They [quickly walked this back](https://www.yahoo.com/video/paypal-policy-permits-company-fine-143946902.html) but this kind of private fintech action is highly suggestive of a need for uncensorable money such as Bitcoin.\n\t- Apple has recently introduced a high-yield Savings account with an impressive 4.15 % APY, far surpassing the national average of 0.35 %APY. This development represents another milestone for the tech giant as it progresses towards potentially becoming the world’s largest bank. The Apple Savings account, established through a collaboration with Goldman Sachs, offers numerous benefits, including an interest rate more than ten times the national average, zero fees, no minimum deposit or balance requirements, and an efficient, user-friendly interface. Additionally, it provides FDIC insurance for balances up to $250,000. Although the4.15 % APY is lower than returns from money market funds and 1 % below the 3-Month Treasury Bill Yield of 5.2 %, most people may not be aware of these alternatives. The key factors driving demand for Apple’s offering are convenience and the strong brand trust it enjoys. With products such as Apple Pay, Apple Cash, mPOS, Apple Card, Apple Pay Later, and now Apple Savings, the company is strategically constructing an Apple Finance empire poised to disrupt the traditional financial services landscape.\n\n- ### Applications of DID/SSI\n- Some of the likely, and discussed applications for DID/SSI are the moreinherently private and personally valuable sets of data an individualmight generate throughout their life. The theory is that subsets of suchdata could then be digitally revealed by the individual when required,and that cryptographic verification built into the system wouldguarantee the veracity of the data to the receiving party. It is alsopossible to make use of “zero-knowledge proof” such that assertions canbe made about about the contents of the data without revealing the dataitself. A good example of this an age verification challenge, where athreshold age could be asserted without necessarily revealing the dateof birth. Other keystone uses of the technology are:\n-\n\t- health documents history\n-\n\t- qualifications and certifications\n-\n\t- financial record and relationships with those of others\n-\n\t- contacts, connections to other people and their appropriate data, including things like shared and personal calendars\n- It’s also possible to extend this key management ethos to all logincredentials, and all data currently stored on centralised servers. Thisis the tension discussed in the chapter about Web3. Proponents thinkthat using something like a DID/SSI stack to manage encryption,decryption and access to data within cloud services gives the user thebest of all worlds. They see simply logging in with a cryptographicwallet, and using that same public/private key pair to manage the databeyond as some kind of panacea. This is very complex stuff though, andit seems very likely they just haven’t thought this through enough.\n\n- ## Applications of DID/SSI\n\t- Some of the likely, and discussed applications for DID/SSI are the moreinherently private and personally valuable sets of data an individualmight generate throughout their life. The theory is that subsets of suchdata could then be digitally revealed by the individual when required,and that cryptographic verification built into the system wouldguarantee the veracity of the data to the receiving party. It is alsopossible to make use of “zero-knowledge proof” such that assertions canbe made about about the contents of the data without revealing the dataitself. A good example of this an age verification challenge, where athreshold age could be asserted without necessarily revealing the dateof birth. Other keystone uses of the technology are:\n\t\t- Health documents history\n\t\t- Qualifications and certifications\n\t\t- Financial record and relationships with those of others\n\t\t- Contacts, connections to other people and their appropriate data, including things like shared and personal calendars\n\t- It’s also possible to extend this key management ethos to all logincredentials, and all data currently stored on centralised servers. Thisis the tension discussed in the chapter about Web3. Proponents thinkthat using something like a DID/SSI stack to manage encryption,decryption and access to data within cloud services gives the user thebest of all worlds. They see simply logging in with a cryptographicwallet, and using that same public/private key pair to manage the databeyond as some kind of panacea. This is very complex stuff though, andit seems very likely they just haven’t thought this through enough.\n\n- ### Overview of Government Data Acquisition Practices\n\t- **Surveillance Capitalism**: This concept pertains to the commodification of personal data by private entities. The US government, among others, acquires this data for intelligence and enforcement purposes, circumventing traditional surveillance and legal protocols.\n\t- **Data Brokers' Role**: Data brokers are pivotal, operating businesses that amass and trade personal data without interacting directly with consumers. Their databases encompass a wide array, from social media behaviour to precise geolocation details.\n\n- ## The Dark Forest Thesis\n\t- [The Dark Forest Theory of the Internet | by Yancey Strickler | Medium](https://ystrickler.medium.com/the-dark-forest-theory-of-the-internet-7dc3e68a7cb1)\n\t- [The Expanding Dark Forest and Generative AI (maggieappleton.com)](https://maggieappleton.com/ai-dark-forest)\n\t- In Liu Cixin's sci-fi trilogy *The Three Body Problem*, the dark forest theory suggests that the universe is full of life, but it remains silent and hidden to survive, like animals in a dark forest at night when predators are out.\n\t- The internet is becoming like a dark forest:\n\t\t- In response to ads, tracking, trolling, hype, and predatory behaviors, people are retreating to safer, private spaces online\n\t\t- These \"dark forests\" of the internet are non-indexed, non-optimized, and non-gamified environments where depressurized conversation is possible\n\t\t- Examples include private channels, group chats, and newsletters sent to select groups\n\t\t- Podcasts are another \"dark forest\" where meaning is expressed through intonation and interaction, allowing for more forgiving communication compared to the internet at large\n\n- ## Ethical and Strategic Considerations\n\t- The involvement of private tech companies in warfare raises questions about legal, ethical, and privacy concerns, alongside the potential for technology proliferation to adversaries.\n\t- Palantir and other firms' contributions also spotlight the evolving role of the tech sector in national security, with companies acting as de facto defense partners.\n\t- More positively it can contribution to battle damage assessment in Ukraine using machine learning algorithms to analyse imagery and detect changes.\n\n- ## The Next Internet: A Briefing on Private, Scalable Value Transfer for an Agentic Future\n\n- ## Risks and mitigations\n\t- The introduction of CBDCs could have a significant impact on both individuals and the existing private financial sector.\n\t- For individuals, the risks of CBDCs include:\n\t\t- Privacy concerns: CBDCs could potentially be used to track and monitor individuals’ financial transactions, raising concerns about privacy and government surveillance.\n\t\t- Lack of anonymity: Unlike cash, CBDCs could be easily traced and linked to individuals, which may compromise their financial privacy and security.\n\t\t- Cybersecurity risks: CBDCs could be vulnerable to cyberattacks, which could lead to the loss of funds and personal information.\n\t\t- For the existing private financial sector, the risks of CBDCs include:\n\t\t- Competition: CBDCs could potentially compete with private sector financial institutions, which could lead to a decline in the use of traditional financial services.\n\t\t- Disruption: CBDCs could disrupt existing financial systems and business models, which could lead to a decline in profits and revenue for private sector financial institutions.\n\t\t- Regulation: The introduction of CBDCs could lead to increased regulation of the private financial sector, which could increase compliance costs and reduce profitability.\n\t\t- CBDCs could have implications on monetary policy, financial stability, and international relations. For example, it could change the way central banks conduct monetary policy, and it could also impact the global financial system and the role of the US dollar as a global reserve currency.\n\t\t- CBDCs could also bring about significant changes in the global payment system, which could have major implications for the financial industry, and for the private sector as well as for the central banks.\n\t\t- A single global ledger, especially one controlled by large international bodies like the BIS and IMF, could potentially lead to an unhealthy centralization of power. This could exacerbate existing imbalances in global financial control and further marginalize countries with less political and economic power.\n\t\t- A centralized ledger system would necessitate a high degree of technological dependence, which could leave countries vulnerable in the event of technological failure or cyber attacks.\n\t\t- A global ledger system would require a high level of standardization. This could limit the ability of individual nations to adapt their financial systems to local conditions and needs, potentially leading to a “one-size-fits-all” approach that might not be appropriate for all contexts.\n\t\t- There are concerns that the shift to digital currencies could leave behind those without access to necessarytechnology, contributing to financial exclusion rather than mitigating it.\n\t- In conclusion, the risks associated with CBDCs are significant and multi-faceted. It is (hopefully) more likely that a blend of stablecoins, private bank issued digital currency (with a yield incentive) and perhaps some limited CBDC, alongside the new contenderBitcoin, will present a new landscape of user choice. Different modelsof trust, insurance, yields, acceptability, and potentially privacy,will emerge.\n\t- Clearly a global, stable, wholly digital bearer asset in a native currency would ostensibly be the ideal integration for money in a metaverse application, but the whole concept seems deeply ‘wrong’, and it is likely that a transition to such a technology would be complex and painful. Either way, it is certainly not ready for consideration now.It’s important that central banks and governments carefully consider these risks before introducing CBDCs, but it’s not clear this is happening. It is conceivable that by working closely with the private sector policy makers could minimize any negative impacts, ensuring that any new regulations are designed in a way that protects the rights andprivacy of individuals, while also promoting financial stability andeconomic growth. Gerard, an incredibly staunch critic of all things crypto [points to woeful adoption and manifestcorruption](https://davidgerard.co.uk/blockchain/2023/02/28/news-blockchain-mep-eva-kaili-corruption-arrest-nigerian-cbdc-rewrite-bbc-blockchain-misadventures/)in the attempts so far. We are not particularly hopeful either.\n\n- ## Central bank digital currencies\n\t- If 2023 was the year of the stablecoin then 2024 is likely to be theyear of the central bank digital currency (CBDC). CBDCs would likely notexist without the 2019 catalyst of [FacebookLibre](https://www.thetimes.co.uk/article/facebooks-libra-cryptocurrency-project-ends-in-failure-cxvnnc3kx)crypto currency project, which is now[cancelled](https://fortune.com/2022/07/01/meta-novi-crypto-payments-wallet-end-september-2022/)and defunct, [pressure exerted on centralbanks](https://www.theguardian.com/world/2021/jul/09/currency-and-control-why-china-wants-to-undermine-bitcoin)by the concept of Bitcoin, and the stablecoins which emerged from the technology.\n\t- It now seems plausible that the world is moving toward a plurality of national and private digital currencies. Figure<a href=\"#fig:CBDClikely\" data-reference-type=\"ref\" data-reference=\"fig:CBDClikely\">4.3</a>from the Bank for International Settlement, shows the growing acceptance within central banks. Their 2022 annual economic report dedicates [a 42page chapter](https://www.bis.org/publ/arpdf/ar2022e3.pdf) to thesubject. Hyun Song Shin, head of research at BIS said it “Our broad conclusion is captured in the motto, ‘Anything that crypto can do, CBDCs can do better.“\n\t- Bank of America analysts Shah and Moss think that CBDC’s [are‘inevitable’]() by 2030, and believe that in the meantime stablecoinswill fill what they perceive to be this market gap.\n\t- This text from the [thinktankVoxEU](https://voxeu.org/article/benefits-central-bank-digital-currency)highlights the pressure on not to be [‘leftbehind’](https://himes.house.gov/u-s-central-bank-digital-currency):it“Given the rapid pace of innovations in payments technology and the proliferation of virtual currencies such as bitcoin and Ethereum, it might not be prudent for central banks to be passive in their approach to CBDC. If the central bank does not produce any form of digital currency, there is a risk that it loses monetary control, with greater potential for severe economic downturns. With this in mind, central banks are moving expeditiously when they consider the adoption of CBDC. ”The Atlantic Council [have a website](https://www.atlanticcouncil.org/cbdctracker/) which tracks global adoption.\n\t- <span class=\"image\">More than half of central banks [surveyed by theBIS](https://www.bis.org/publ/bppdf/bispap125.htm) said they saw issuance of a CBDC as possible.</span>\n\t- CBDCs are wholly digital representations of national currencies, and assuch are centralised database entries, endorsed and potentially issuedby national governments. The [USA’swhitepaper](https://www.federalreserve.gov/publications/files/money-and-payments-20220120.pdf)shows the approach. This thinking seems to have emerged in part from the‘Digital Dollar Project’, an Accenture funded think tank founded by exCFTC chairman Giancarlo.[[giancarlo2021cryptodad]] Curiously only [TheBahamas](https://www.sanddollar.bs/about) seem to have a successful implementation, but it is a rapidly evolving space, and many nations arenow scrambling to [catchup](https://twitter.com/GobiernoMX/status/1476376240873517061). A [poston the LinkedInpage](https://www.linkedin.com/feed/update/urn:li:activity:6980330210030145536/)of the Bank of International Settlements highlights a research projectbetween 20 Asian banks which settles tens of millions of dollars usingCBDC tooling.\n\t- The following text is taken from the March 2021 Biden government“executive order” on digital assets, and defines the current globall egislative position well.\n\t\t- *Sec. 4. Policy and Actions Related to United States Central BankDigital Currencies. (a) The policy of my Administration on a UnitedStates CBDC is as follows:  (i) Sovereign money is at the core of a well-functioning financial system, macroeconomic stabilization policies, and economic growth. MyAdministration places the highest urgency on research and development efforts into the potential design and deployment options of a UnitedStates CBDC. These efforts should include assessments of possiblebenefits and risks for consumers, investors, and businesses; financial stability and systemic risk; payment systems; national security; theability to exercise human rights; financial inclusion and equity; and the actions required to launch a United States CBDC if doing so is deemed to be in the national interest.  (ii) My Administration sees merit in showcasing United States leadership and participation in international fora related to CBDCs and in multi country conversations and pilot projects involving CBDCs. Any future dollar payment system should be designed in a way that isconsistent with United States priorities (as outlined in section 4(a)(i)of this order) and democratic values, including privacy protections, and that ensures the global financial system has appropriate transparency,connectivity, and platform and architecture interoperability or transferability, as appropriate.  (iii) A United States CBDC may have the potential to support efficient and low-cost transactions, particularly for cross‑border funds transfers and payments, and to foster greater access to the financial system, with fewer of the risks posed by private sector-administered digital assets.A United States CBDC that is interoperable with CBDCs issued by other monetary authorities could facilitate faster and lower-cost cross-borderpayments and potentially boost economic growth, support the continued centrality of the United States within the international financial system, and help to protect the unique role that the dollar plays in global finance. There are also, however, potential risks and downsides to consider. We should prioritize timely assessments of potential benefits and risks under various designs to ensure that the UnitedStates remains a leader in the international financial system.*\n\t- In traditional nation state currencies the central banks [control the amount](https://www.bankofengland.co.uk/markets/bank-of-england-market-operations-guide)of currency in circulation by issuing debt to private banks, which is then loaned out to individuals.[[wang2021central]] The debt is ‘destroyed’ on the balance sheet to remove currency through the reverse mechanism. They also facilitate government debt,[[filardo2012central]]and work (theoretically) outside of political control to adjust interest rates, in order to manage growth and flows of money.\n\t- It is somewhat surprising that Powell, chair of the US Federal Reservehas [recentlysaid](https://www.federalreserve.gov/newsevents/speech/powell20220617a.htm)it“Rapid changes are taking place in the global monetary system that may affect the international role of the dollar. A US central bank digital currency is being examined to help the US dollar’s international standing.”. This is a rapid evolution of the narrative, with implications. It seems unlikely that the world would sacrifice the traditional banking system in favour of centrally controlled money, but many things which cannot be done with traditional nation state money systems are possible with CBDCs, because they [remove themiddleman](https://voxeu.org/article/benefits-central-bank-digital-currency)of private banking between the end user and the policy makers.\n\t- Negative interest rates are possible, such that all of the money can lose purchasing power over time, and at a rate dictated by policy. This “removal of the lower bound” has been discussed by economists over the last couple of decades as interest rate mechanisms have waned in efficacy. It is not possible in the current system, and instead money must be added through [quantitative easing](https://www.bankofengland.co.uk/monetary-policy/quantitative-easing), which disproportionately benefits some though Cantillon effects.[[cantillon1756essai; @bordo1983some]]\n\t\t- Ubiquitous basic income is possible in that money can be issued directly from government to all approved citizens, transferring spending power directly from the government to the people. This also implies efficiency savings for social support mechanisms.\n\t\t- Asset freezing and confiscation are trivial if CBDCs can replace paper cash money completely, as a bearer asset. Criminals and global ‘bad actors’ could have their assets temporarily or permanently removed, centrally, by suspending the transferability of the digital tokens.\n\t\t- Targeted bailouts for vital institutions and industries are possible directly from central government policy makers. Currently private banks must be incentivised to make cheap loans available to sectors which require targeted assistance.\n\t\t- Financial surveillance of every user is possible. In this way a ‘panopticon of money’ can be enacted, and spending rulesets can be applied. For instance, social support money might only be spendable on food, and child support only on goods and services to support childcare. This is a very dystopian set of ideas. Eswar Prasad says “In authoritarian societies, central bank money in digital form could become an additional instrument of government control over citizens rather than just a convenient, safe, and stable medium of exchange[[prasad2021future]].” This is possibly [already happening](https://twitter.com/WallStreetSilv/status/1581378124452753408) in China through integration of outstanding debt data with the social credit system.\n\t\t- It’s a virtually cost free medium of exchange, since there is no physical instrument which must be shipped, guarded, counted, assayed, and securely destroyed.\n\t\t- The counterfeiting risk is significantly reduced because of secure cryptographic underpinnings rather than paper or plastic anti counterfeiting technologies.\n\t\t- Global reach and control is instantly possible for the issuer. This is a big problem especially for a reserve currency such as the dollar. Two thirds of $100 bills are [thought to](https://www.federalreserve.gov/pubs/ifdp/2012/1058/default.htm) reside outside of the USA.\n\t\t- System level quantitative easing and credit subsidies are made far simpler and less wasteful when centrally dictated.\n\t\t- Transfer of liability and risk to the holder globally reduces the management costs for global deposits of a currency.\n\t\t- It may be possible to automate the stability of a currency through continuous adjustment of the ‘peg’ through algorithms or AI.\n\t- The UK had been signalled that it is not interested in developing a CBDCstating that it seemed to be a [solution in search of a problem](https://committees.parliament.uk/publications/8443/documents/85604/default/),with the Lords economic affairs committee saying:it“The introduction ofa UK CBDC would have far-reaching consequences for households,businesses, and the monetary system for decades to come and may pose significant risks depending on how it is designed. These risks include state surveillance of people’s spending choices, financial instability as people convert bank deposits to CBDC during periods of economic stress, an increase in central bank power without sufficient scrutiny,and the creation of a centralised point of failure that would be atarget for hostile nation state or criminal actors.”\n\t- Since those initial statements however it seems that the previously mentioned “fear of missing out” has forced legislators hand. The UKTreasury and the Bank of England are now exploring the possibility of launching a retail central bank digital currency (which they desperately hope will not end up called ‘Britcoin’), judging that “it is likely a digital pound will be needed in the future”. They have released a[consultationpaper](https://www.gov.uk/government/news/hm-treasury-and-bank-of-england-consider-plans-for-a-digital-pound)inviting public comment. The consultation is aimed at informing the decision on whether to build the infrastructure for a digital pound,with a pilot test not expected before 2025.\n\t- One of the key points raised in the proposal is the potential to cap citizens’ CBDC holdings, with a range suggested between sterling 10,000to sterling 20,000, to strike a balance between managing risks andsupporting the usability of the digital pound. This limit would allow most UK wage earners to receive their salary in the form of a CBDC but would still allow for competition with commercial banks. The digitalp ound would not offer interest, enabling banks to offer competitive deposit accounts.\n\t- They are once again clear about the risks, highlighting that banks currently use deposits as a cheap source of funding for loans, and without that flow, they may become more reliant on expensive wholesale markets, driving up borrowing costs for users. In a severe scenario, abank run could undermine the capital base for the commercial bankingsystem.\n\t- The Bank of England has stated that it will not implement central bank initiated programmable functions, but instead provide the necessary infrastructure for the private sector to implement such features withuser consent. The digital pound is intended to have at least the same level of privacy as a bank account and users would be able to makechoices about data use. This is scant comfort, as such features are intrinsic to the technology, and we have seen time and again that iflegislative and economic bodies are given a hammer, they will eventually find a nail to hit. Carlo, the director of ‘The Big Brother watch’[pointed to](https://twitter.com/silkiecarlo/status/1622912736102346752)2021 comments from John Cunliff of the bank of England when he said“There’s a whole range of things that programmable money could do like giving the children pocket money but programming the money so it couldn’t be used for sweets”. Again, this raises the potential for government stimulus that has to be spent within a certain time or it disappears. As an interesting side note here it’s thought that up to 14%of American stimulus cheques went to buying crypto, most notably in less well off families.[[bertomeu2023uncle]] It’s easy to imagine that a CBDCwould be barred from such a thing.\n\t- The main motivation for issuing a CBDC is the assumption that there isdemand for a safe and stable way to use money online. A digital pound,issued and backed by the Bank of England, could be a trusted,accessible, and easy-to-use form of payment. The infrastructure would allow firms to design innovative and user-friendly services. The civilservice is hiring a “Head of CBDC” as seen in Figure<a href=\"#fig:treasury\" data-reference-type=\"ref\" data-reference=\"fig:treasury\">4.4</a>. ![]./assets/9a2522fabf842fbfaf37b164036af1e44295adab.jpg The UK is clearly making moves to staff a new department for CBDC.\n\t- Meanwhile in Europe, ECB President [ChristineLegarde](https://www.ecb.europa.eu/press/pressconf/2022/html/ecb.is220310~1bc8c1b1ca.en.html#qa)said: it“On your question concerning CBDC, you know my views on CBDC and you know that I have pushed that project. Fabio Panetta is working hardon that together with members in the entire Eurosystem with the high-level taskforce that is working really hard on moving forward. Butin a way, I am really pleased that attention is now focussed on the role that cryptos can play and the role that Central Bank Digital Currency can have when they are implemented. We have a schedule, as you know. TheGoverning Council decided back in October ’21 to launch a two-year investigation phase, and it is at the end of that investigation phase that the decision will definitely be made to launch the CBDCs and to make it a reality. We can’t go wrong with that project. I am confident that we will move ahead, but that’s going to be a decision of theGoverning Council. I think it’s an imperative to respond to what theEuropeans expect, and I think we have to be a little bit ahead of the curve if we can on that front. If we can accelerate the work, I hope wecan accelerate the work. I will certainly support that and I was delighted to see that in the United States there was an executive order by President Biden to actually expect similar effort and focus and progress on CBDC, cryptos. I think that it will take all the goodwill ofthose who want to support sovereignty, who want to make sure that monetary policy can be transmitted properly using our currency, will endeavour.”\n\t- She has expanded on these points saying in a video interview that the digital euro will be decided in October 2023. If passed, the current paradigm of cash spending and transfers will become even more restrictive. Lagarde justified the move by saying that she did not wantthe EU to be ‘dependent on the currency of an unfriendly country’ or afriendly currency activated by a private corporate entity’. Sheidentified Meta, Google, and Amazon.\n\t- India has expressed far more interest in the technology, and of course their addressable market is huge! They have published a ‘[conceptnote](https://twitter.com/RBI/status/1578329048446828544?)’ in whichthey assert that a digital Rupee would be faster, cheaper, and easier tomaintain. The key difference in India’s situation is the large areas ofthe rural population where mobile internet is more patchy. In suchsituations a cash equivalent stablecoin token with cash finality which can be transferred between mobile phone wallets itwithout an internet connection is a huge boon. It seems very likely that India is moving toreact to the innovation threat posed by cryptocurrencies to their owncash infrastructure. They are [piloting thetechnology](https://www.reuters.com/article/idUSKBN2RQ0WO) already.Similarly there seems to be a strong, and [predictablyilliberal](https://www.bloomberg.com/news/articles/2022-12-06/nigeria-limits-cash-transactions-to-push-enaira-and-other-payments)push for transition to digital money in Nigeria. Again this is an enormous number of people, and it is hard not to be suspicious of future abuse of the system by governments.\n\t- In the USA this text from Congressman Tom Emmer shows how complex and interesting this debate is becoming.it“Today, I introduced a bill prohibiting the Fed from issuing a central bank digital currency directly to individuals. Here’s why it matters: As other countries, likeChina, develop CBDCs that fundamentally omit the benefits and protections of cash, it is more important than ever to ensure the UnitedStates’ digital currency policy protects financial privacy, maintains the dollar’s dominance, and cultivates innovation.  CBDCs that fail to adhere to these three basic principles could enable an entity like the Federal Reserve to mobilize itself into a retail bank, collect personally identifiable information on users, and track their transactions indefinitely.  Not only does this CBDC model raise “single point of failure” issues,leaving Americans’ financial information vulnerable to attack, but it could be used as a surveillance tool that Americans should never be forced to tolerate from their own government.  Requiring users to open an account at the Fed to access a United StatesCBDC would put the Fed on an insidious path akin to China’s digital authoritarianism.  Any CBDC implemented by the Fed must be open, permissionless, and private. This means that any digital dollar must be accessible to all,transact on a blockchain that is transparent to all, and maintain the privacy elements of cash.  In order to maintain the dollar’s status as the world’s reserve currency in a digital age, it is important that the United States lead with aposture that prioritizes innovation and does not aim to compete with theprivate sector.  Simply put, we must prioritize blockchain technology with American characteristics, rather than mimic China’s digital authoritarianism outof fear.”\n\t- Most analysts now seem to think that there is little appetite to replace established ’Western’ cash with CBDCs. Most significantly such productswould need the support of retail banks, and it is not in their interestto service such a product. Their business model relies on using retail deposits for providing loans, and it is these deposits, not cash itself that would be the most addressable market for a CBDC. Banks don’t want people to self custody money. In addition it exposes the whole banking system to a higher risk of bank runs. Such a self custody, interestbearing, central government backed asset would have significantly less counterparty risk than even bank deposits, and at times of high systemic stress it seems likely that money would flow to where it’s thoughtsafest, exposing the retail banks to runs. Fabio Panetta of the ECBsaid: it“If we give access to a means of payment, which is relatively limited, there are no transaction costs because you only need to have a smartphone. There will be risks that people could use this possibility to move, for example, their deposits of other banks or their money outof financial intermediates.”\n\t\t- All of the proposed solutions to these problems such as caps and negative interest penalties seem poorlythought through. Held and Smolenski present a [detailed and rigorousnegativecritique](https://www.btcpolicy.org/articles/why-the-u-s-should-reject-central-bank-digital-currencies)of the dystopian ramifications of the technology. In their conclusion they point out that: it“Central bank digital currencies (CBDCs)represent an extension of state control over economic life. CBDCsprovide governments with direct access to every transaction in that currency conducted by any individual anywhere in the world. As governments worldwide routinely share data with one another, individual transaction data will quickly become known to any government in a datasharing arrangement. Given the frequency with which government databases are compromised, this arrangement virtually ensures that anyone’s transaction data will eventually become available for global perusal.”\n\n- ### Digital disruptive fintech\n\t- It seems that the neobank providers of digital banking apps are likely to converge with native digital asset “wallets”. This is also the thesis advanced by the Ark investments Big Ideas paper.\n\t- CNN have a [usefulprimer](https://money.cnn.com/infographic/technology/mobile-payment-comparison/index.html) of the most prevalent mobile digital payment methods. This can be seen in Figure<a href=\"#fig:CNNmobile\" data-reference-type=\"ref\" data-reference=\"fig:CNNmobile\">4.1</a>. ![]./assets/212560aea2bfb60289d9fce06c5e63ee12d5095c.jpg Comparison of mobile based payment systems\n\t- This comparison makes it pretty clear that Bitcoin is not ready as a personal mobile payment system. That’s not to say that there isn’t aplace for the underlying technology in global payment processing. The most interesting example of this is Strike, a product in the international fintech arena. It is a ‘global’ money transmitter which uses bank connections in local currencies, but a private version of theLightning network with settlement on the Bitcoin main chain. In practiceusers connect the app to their bank and can send money to the bank connected Strike app of another user instantly, and without a fee. This is a far better product than those previously available. In principle it’s open API allows many more applications to be integrated into theStrike back end. Twitter already uses this for international tipping(and remittance). It seems that this is a perfect contender for supporting transactions in open metaverse applications, and that may betrue, but Strike is currently only available in three countries (USA, ElSalvador, Argentina).\n\t- Paypal, xoom, Strike, servicing smaller payments, cashapp, venmo,revulot, Paypal especially is noteworthy for their recent Orwellian gaffe suggesting in their terms and conditions that they would be ableto fine users $2500 for “disseminating informational”. They [quickly walked this back](https://www.yahoo.com/video/paypal-policy-permits-company-fine-143946902.html) but this kind of private fintech action is highly suggestive of a need for uncensorable money such as Bitcoin.\n\t- Apple has recently introduced a high-yield Savings account with an impressive 4.15 % APY, far surpassing the national average of 0.35 %APY. This development represents another milestone for the tech giant as it progresses towards potentially becoming the world’s largest bank. The Apple Savings account, established through a collaboration with Goldman Sachs, offers numerous benefits, including an interest rate more than ten times the national average, zero fees, no minimum deposit or balance requirements, and an efficient, user-friendly interface. Additionally, it provides FDIC insurance for balances up to $250,000. Although the4.15 % APY is lower than returns from money market funds and 1 % below the 3-Month Treasury Bill Yield of 5.2 %, most people may not be aware of these alternatives. The key factors driving demand for Apple’s offering are convenience and the strong brand trust it enjoys. With products such as Apple Pay, Apple Cash, mPOS, Apple Card, Apple Pay Later, and now Apple Savings, the company is strategically constructing an Apple Finance empire poised to disrupt the traditional financial services landscape.\n\n- ### Applications of DID/SSI\n- Some of the likely, and discussed applications for DID/SSI are the moreinherently private and personally valuable sets of data an individualmight generate throughout their life. The theory is that subsets of suchdata could then be digitally revealed by the individual when required,and that cryptographic verification built into the system wouldguarantee the veracity of the data to the receiving party. It is alsopossible to make use of “zero-knowledge proof” such that assertions canbe made about about the contents of the data without revealing the dataitself. A good example of this an age verification challenge, where athreshold age could be asserted without necessarily revealing the dateof birth. Other keystone uses of the technology are:\n-\n\t- health documents history\n-\n\t- qualifications and certifications\n-\n\t- financial record and relationships with those of others\n-\n\t- contacts, connections to other people and their appropriate data, including things like shared and personal calendars\n- It’s also possible to extend this key management ethos to all logincredentials, and all data currently stored on centralised servers. Thisis the tension discussed in the chapter about Web3. Proponents thinkthat using something like a DID/SSI stack to manage encryption,decryption and access to data within cloud services gives the user thebest of all worlds. They see simply logging in with a cryptographicwallet, and using that same public/private key pair to manage the databeyond as some kind of panacea. This is very complex stuff though, andit seems very likely they just haven’t thought this through enough.\n\n- ## Applications of DID/SSI\n\t- Some of the likely, and discussed applications for DID/SSI are the moreinherently private and personally valuable sets of data an individualmight generate throughout their life. The theory is that subsets of suchdata could then be digitally revealed by the individual when required,and that cryptographic verification built into the system wouldguarantee the veracity of the data to the receiving party. It is alsopossible to make use of “zero-knowledge proof” such that assertions canbe made about about the contents of the data without revealing the dataitself. A good example of this an age verification challenge, where athreshold age could be asserted without necessarily revealing the dateof birth. Other keystone uses of the technology are:\n\t\t- Health documents history\n\t\t- Qualifications and certifications\n\t\t- Financial record and relationships with those of others\n\t\t- Contacts, connections to other people and their appropriate data, including things like shared and personal calendars\n\t- It’s also possible to extend this key management ethos to all logincredentials, and all data currently stored on centralised servers. Thisis the tension discussed in the chapter about Web3. Proponents thinkthat using something like a DID/SSI stack to manage encryption,decryption and access to data within cloud services gives the user thebest of all worlds. They see simply logging in with a cryptographicwallet, and using that same public/private key pair to manage the databeyond as some kind of panacea. This is very complex stuff though, andit seems very likely they just haven’t thought this through enough.\n\n- ### Overview of Government Data Acquisition Practices\n\t- **Surveillance Capitalism**: This concept pertains to the commodification of personal data by private entities. The US government, among others, acquires this data for intelligence and enforcement purposes, circumventing traditional surveillance and legal protocols.\n\t- **Data Brokers' Role**: Data brokers are pivotal, operating businesses that amass and trade personal data without interacting directly with consumers. Their databases encompass a wide array, from social media behaviour to precise geolocation details.\n\n- ## The Dark Forest Thesis\n\t- [The Dark Forest Theory of the Internet | by Yancey Strickler | Medium](https://ystrickler.medium.com/the-dark-forest-theory-of-the-internet-7dc3e68a7cb1)\n\t- [The Expanding Dark Forest and Generative AI (maggieappleton.com)](https://maggieappleton.com/ai-dark-forest)\n\t- In Liu Cixin's sci-fi trilogy *The Three Body Problem*, the dark forest theory suggests that the universe is full of life, but it remains silent and hidden to survive, like animals in a dark forest at night when predators are out.\n\t- The internet is becoming like a dark forest:\n\t\t- In response to ads, tracking, trolling, hype, and predatory behaviors, people are retreating to safer, private spaces online\n\t\t- These \"dark forests\" of the internet are non-indexed, non-optimized, and non-gamified environments where depressurized conversation is possible\n\t\t- Examples include private channels, group chats, and newsletters sent to select groups\n\t\t- Podcasts are another \"dark forest\" where meaning is expressed through intonation and interaction, allowing for more forgiving communication compared to the internet at large\n\n- ## Ethical and Strategic Considerations\n\t- The involvement of private tech companies in warfare raises questions about legal, ethical, and privacy concerns, alongside the potential for technology proliferation to adversaries.\n\t- Palantir and other firms' contributions also spotlight the evolving role of the tech sector in national security, with companies acting as de facto defense partners.\n\t- More positively it can contribution to battle damage assessment in Ukraine using machine learning algorithms to analyse imagery and detect changes.\n\n- ## The Next Internet: A Briefing on Private, Scalable Value Transfer for an Agentic Future\n\n\n## Academic Context\n\n- Private keys are fundamental components in cryptography, serving as secret cryptographic keys used to decrypt data or create digital signatures within asymmetric encryption systems.\n  - They are mathematically linked to corresponding public keys but must remain confidential to maintain security.\n  - The academic foundation lies in public-key cryptography introduced by Diffie and Hellman (1976), which revolutionised secure communication by separating encryption and decryption keys.\n  - Private keys underpin various cryptographic protocols, including digital signatures, secure messaging, and blockchain technologies.\n\n## Current Landscape (2025)\n\n- Private keys are widely adopted across industries for securing communications, authenticating identities, and protecting digital assets.\n  - Notable platforms utilising private keys include blockchain networks (e.g., Bitcoin, Ethereum), secure messaging apps, and enterprise security solutions.\n  - In the UK, financial institutions and government agencies increasingly rely on private key cryptography to comply with data protection regulations and enhance cybersecurity.\n  - North England hubs such as Manchester and Leeds host cybersecurity firms developing private key management solutions tailored for enterprise and public sector clients.\n- Technical capabilities:\n  - Private key operations are computationally efficient compared to public key operations, enabling rapid encryption, decryption, and digital signing.\n  - However, private keys represent a single point of failure; loss or compromise results in irreversible loss of access or identity.\n- Standards and frameworks:\n  - Private key usage adheres to international standards such as FIPS 186-5 and ISO/IEC 11770-3.\n  - UK-specific frameworks integrate these standards within national cybersecurity strategies and compliance regimes.\n\n## Research & Literature\n\n- Key academic papers and sources:\n  - Diffie, W., & Hellman, M. (1976). New Directions in Cryptography. *IEEE Transactions on Information Theory*, 22(6), 644–654. DOI:10.1109/TIT.1976.1055638\n  - Rivest, R. L., Shamir, A., & Adleman, L. (1978). A Method for Obtaining Digital Signatures and Public-Key Cryptosystems. *Communications of the ACM*, 21(2), 120–126. DOI:10.1145/359340.359342\n  - Menezes, A. J., van Oorschot, P. C., & Vanstone, S. A. (1996). *Handbook of Applied Cryptography*. CRC Press. ISBN:9780849385230\n- Ongoing research directions:\n  - Post-quantum cryptography aims to develop private key algorithms resistant to quantum computing attacks.\n  - Enhanced private key management techniques, including hardware security modules (HSMs) and threshold cryptography, to mitigate single points of failure.\n\n## UK Context\n\n- British contributions:\n  - UK researchers and institutions have contributed to cryptographic standards and private key management innovations, notably within GCHQ and academic centres such as the University of Cambridge.\n- North England innovation hubs:\n  - Manchester and Leeds are home to cybersecurity startups focusing on secure private key storage and recovery solutions.\n  - Sheffield hosts research groups exploring cryptographic resilience and key lifecycle management.\n- Regional case studies:\n  - Leeds-based fintech firms employ private key cryptography to secure customer transactions and comply with UK financial regulations.\n  - Manchester’s cybersecurity clusters collaborate with local universities to develop private key-based authentication systems for public services.\n\n## Future Directions\n\n- Emerging trends:\n  - Integration of private key cryptography with biometric authentication to enhance security without sacrificing usability.\n  - Development of user-friendly private key recovery mechanisms to address the “no recovery” challenge.\n- Anticipated challenges:\n  - Balancing private key secrecy with accessibility, especially in enterprise and multi-user environments.\n  - Preparing for quantum computing threats that could undermine current private key algorithms.\n- Research priorities:\n  - Designing quantum-resistant private key schemes.\n  - Improving private key lifecycle management, including generation, storage, rotation, and destruction.\n  - Enhancing education and awareness around private key security to reduce human error.\n\n## References\n\n1. Diffie, W., & Hellman, M. (1976). New Directions in Cryptography. *IEEE Transactions on Information Theory*, 22(6), 644–654. https://doi.org/10.1109/TIT.1976.1055638  \n2. Rivest, R. L., Shamir, A., & Adleman, L. (1978). A Method for Obtaining Digital Signatures and Public-Key Cryptosystems. *Communications of the ACM*, 21(2), 120–126. https://doi.org/10.1145/359340.359342  \n3. Menezes, A. J., van Oorschot, P. C., & Vanstone, S. A. (1996). *Handbook of Applied Cryptography*. CRC Press. ISBN:9780849385230  \n4. National Institute of Standards and Technology (NIST). (2024). FIPS 186-5: Digital Signature Standard (DSS). https://csrc.nist.gov/publications/detail/fips/186/5/final  \n5. 1Kosmos. (2025). What Is a Private Key & How Does It Work? Retrieved November 2025, from https://www.1kosmos.com/authentication/private-key/  \n6. TechTarget. (2025). What is a private key? Retrieved November 2025, from https://www.techtarget.com/searchsecurity/definition/private-key  \n\n*If you lose your private key, it’s a bit like losing your house keys — except there’s no locksmith and no spare under the mat.*\n\n\n## Metadata\n\n\n- **Migration Status**: Ontology block enriched on 2025-11-12\n- **Last Updated**: 2025-11-12\n- **Review Status**: Comprehensive editorial review\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable",
  "properties": {
    "id": "66446c0e-93be-431d-93d4-1e5fa36848c5",
    "collapsed": "true",
    "- domain-prefix": "BC",
    "- sequence-number": "0036",
    "- filename-history": "[\"BC-0036-private-key.md\"]",
    "- public-access": "true",
    "- ontology": "true",
    "- term-id": "BC-0036",
    "- preferred-term": "Private Key",
    "- source-domain": "blockchain",
    "- status": "complete",
    "- version": "1.0.0",
    "- last-updated": "2025-10-28",
    "- definition": "Secret cryptographic key within blockchain systems, providing essential functionality for distributed ledger technology operations and properties.",
    "- maturity": "mature",
    "- source": "[[ISO/IEC 23257:2021]], [[IEEE 2418.1]], [[NIST NISTIR]]",
    "- authority-score": "0.95",
    "- owl:class": "bc:PrivateKey",
    "- owl:physicality": "VirtualEntity",
    "- owl:role": "Object",
    "- owl:inferred-class": "bc:VirtualObject",
    "- belongsToDomain": "[[CryptographicDomain]]",
    "- implementedInLayer": "[[SecurityLayer]]",
    "- is-subclass-of": "[[Blockchain Entity]], [[CryptographicPrimitive]]"
  },
  "backlinks": [
    "Runes and Glyphs",
    "Digital Signature",
    "Public Key",
    "Proof Of Authority",
    "Address"
  ],
  "wiki_links": [
    "wang2021central",
    "SecurityLayer",
    "IEEE 2418.1",
    "filardo2012central",
    "prasad2021future",
    "Agents",
    "Energy and Power",
    "cantillon1756essai; @bordo1983some",
    "Blockchain Entity",
    "giancarlo2021cryptodad",
    "CryptographicDomain",
    "ISO/IEC 23257:2021",
    "CryptographicPrimitive",
    "Convergence",
    "Artificial Intelligence",
    "Social contract and jobs",
    "NIST NISTIR",
    "bertomeu2023uncle"
  ],
  "ontology": {
    "term_id": "BC-0036",
    "preferred_term": "Private Key",
    "definition": "Secret cryptographic key within blockchain systems, providing essential functionality for distributed ledger technology operations and properties.",
    "source_domain": "blockchain",
    "maturity_level": null,
    "authority_score": 0.95
  }
}