{
  "title": "Quadratic Voting",
  "content": "- ### OntologyBlock\n  id:: bc-0466-quadratic-voting-ontology\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: BC-0466\n\t- preferred-term:: Quadratic Voting\n\t- source-domain:: blockchain\n\t- status:: stub-needs-content\n    - public-access:: true\n\t- content-status:: minimal-placeholder-requires-authoring\n    - public-access:: true\n\t- definition:: A component of the blockchain ecosystem.\n\t- maturity:: draft\n\t- owl:class:: bc:QuadraticVoting\n\t- owl:physicality:: ConceptualEntity\n\t- owl:role:: Concept\n\t- belongsToDomain:: [[BlockchainDomain]]\n\t- blockchainRelevance:: High\n\t- lastValidated:: 2025-11-14\n\n\n# Quadratic Voting Ontology Entry – Updated Content\n\n## Academic Context\n\n- Quadratic voting (QV) represents a voting mechanism designed to reflect the intensity of participants' preferences in collective decision-making[1][4]\n  - Fundamentally distinct from one-person-one-vote systems by allowing voters to express preference strength through resource allocation\n  - Operates on the principle that voting power acquisition follows a convex cost function, where the nth vote costs n tokens (or equivalent units)[2][4]\n  - Emerged from theoretical work in mechanism design and democratic innovation, gaining particular traction in blockchain governance contexts\n  - Addresses the tyranny of the majority by enabling nuanced preference aggregation rather than binary or plurality outcomes[4]\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Blockchain and decentralised autonomous organisations (DAOs) represent primary implementation domains[2]\n  - Axelar Network has integrated quadratic voting into delegated proof-of-stake systems to mitigate stake concentration risks[2]\n  - Ethereum governance experiments have explored QV applications, though widespread adoption remains limited despite theoretical advantages[2]\n  - RadicalxChange community maintains active polling infrastructure using QV methodologies[1]\n  - UK and North England context: Limited documented implementations in regional blockchain initiatives; however, academic interest exists within UK computer science departments, particularly those researching distributed systems and governance mechanisms\n- Technical capabilities and limitations\n  - Enables voters to allocate voting power across multiple options whilst maintaining preference intensity signals[3]\n  - Three primary implementation variants identified: Type 1 (square root applied to total stake before distribution), Type 2 (distribution before square root application), and Type 3 (unsplit stake allocation)[3]\n  - Formal proofs confirm that Types 2 and 3 QV, along with generalised models, maintain mathematical properties conducive to decentralisation[3]\n  - Limitations include computational complexity, potential collusion vulnerabilities, and the requirement for robust token or stake systems[1]\n  - Voter education challenges persist; the mechanism's sophistication can create barriers to participation among less technically literate participants\n- Standards and frameworks\n  - No universally adopted technical standard currently exists; implementations vary by platform\n  - RadicalxChange provides community guidance and case study documentation[1]\n  - Academic literature increasingly formalises QV variants and their theoretical properties[3]\n\n## Research & Literature\n\n- Key academic papers and sources\n  - Kovalchuk, L., Rodinko, M., Oliynykov, R., Nastenko, A., Kaidalov, D., & Nelson, K. (2025). \"Enhancing Decentralization in Blockchain Decision-Making Through Quadratic Voting and Its Generalization.\" *arXiv preprint* 2504.12859. Available at: https://arxiv.org/pdf/2504.12859[3]\n  - Posner, E. A., & Weyl, E. G. (2018). *Radical Markets: Uprooting Capitalism and Democracy for a Just Society*. Princeton University Press. Foundational text establishing QV theoretical framework[1]\n  - Cavaillé, C., et al. \"A Decision Theoretic Approach to Understanding Survey Response: Likert vs. Quadratic Voting for Attitudinal Research.\" Comparative methodological analysis of QV effectiveness in survey contexts[1]\n  - Eguia, J. X., Immorlica, N., Ligett, K., Weyl, E. G., & Xefteris, D. \"A New Consensus Protocol: Quadratic Voting with Multiple Alternatives.\" Extends QV framework to multi-option decision scenarios[1]\n  - Quarfoot, D., et al. \"Quadratic Voting in the Wild.\" Empirical study of QV implementation in real-world governance contexts[1]\n  - Casella, A., & Sanchez, L. \"Storable Votes and Quadratic Voting, an Experiment on Four California Propositions.\" Experimental evidence on QV effectiveness in direct democracy settings[1]\n- Ongoing research directions\n  - Generalisation of QV models to accommodate diverse governance structures[3]\n  - Collusion resistance mechanisms and cryptographic safeguards[1]\n  - Integration with zero-knowledge proofs for privacy-preserving voting[2]\n  - Comparative effectiveness studies across different stakeholder populations\n\n## UK Context\n\n- British contributions and implementations\n  - Academic research concentrated within computer science and economics departments, particularly those engaged with distributed systems research\n  - Limited direct implementation within UK governance structures; most experimentation remains confined to blockchain and cryptocurrency projects\n  - Chantal Mouffe's *Agonistics: Thinking The World Politically* (referenced in QV literature) represents significant British-European theoretical contribution to democratic innovation discourse[1]\n- North England innovation hubs\n  - No documented quadratic voting implementations currently active in Manchester, Leeds, Newcastle, or Sheffield governance systems\n  - Potential opportunity for pilot programmes within regional blockchain research initiatives or university-led governance experiments\n  - Manchester's growing fintech sector and Leeds' digital innovation clusters represent plausible venues for future QV exploration\n- Regional case studies\n  - Currently absent; opportunity exists for UK-based case studies comparing QV with traditional consultation mechanisms in local authority decision-making\n\n## Future Directions\n\n- Emerging trends and developments\n  - Integration with decentralised finance (DeFi) governance protocols increasingly likely as mechanisms mature[2]\n  - Hybrid approaches combining QV with other voting mechanisms (plural voting, storable votes) gaining theoretical attention[1]\n  - Potential application to non-blockchain contexts, including corporate governance and institutional decision-making\n  - Regulatory frameworks may emerge as jurisdictions address decentralised governance legitimacy\n- Anticipated challenges\n  - Voter participation barriers due to mechanism complexity; educational initiatives essential for broader adoption\n  - Sybil attack vulnerabilities in systems lacking robust identity verification\n  - Scalability constraints in high-volume voting scenarios\n  - Regulatory uncertainty regarding QV's compatibility with existing democratic governance frameworks\n- Research priorities\n  - Empirical studies comparing QV outcomes with traditional voting across diverse decision contexts\n  - Development of user-friendly interfaces reducing cognitive load for voters\n  - Formal security analysis of QV implementations in production systems\n  - Investigation of QV effectiveness in addressing specific governance challenges (stake concentration, voter apathy, preference intensity aggregation)\n\n## References\n\n[1] RadicalxChange. \"Quadratic Voting.\" Available at: https://www.radicalxchange.org/wiki/quadratic-voting/\n\n[2] Axelar Network. \"What Is Quadratic Voting and Why Don't More Projects Use It?\" Available at: https://www.axelar.network/blog/quadratic-voting-daos-dpos-and-decentralization\n\n[3] Kovalchuk, L., Rodinko, M., Oliynykov, R., Nastenko, A., Kaidalov, D., & Nelson, K. (2025). \"Enhancing Decentralization in Blockchain Decision-Making Through Quadratic Voting and Its Generalization.\" *arXiv preprint* 2504.12859. https://doi.org/10.48550/arXiv.2504.12859\n\n[4] UEEx. \"Quadratic Voting.\" Available at: https://blog.ueex.com/crypto-terms/quadratic-voting/\n\n[5] INFORMS. \"Balancing Power in Decentralized Governance: Quadratic Voting.\" *Management Science*, 2024. Available at: https://pubsonline.informs.org/doi/10.1287/mnsc.2024.08469\n\n---\n\n**Editorial Notes:** The original definition (\"a component of the blockchain ecosystem\") has been substantially expanded to reflect QV's broader theoretical significance and emerging applications beyond blockchain contexts. Time-sensitive content regarding specific 2020 Colorado experiments and Ethereum governance trials has been contextualised historically rather than removed, as they represent important precedents. UK context remains limited due to genuine scarcity of regional implementations—this represents an honest gap rather than an oversight. The mechanism's sophistication occasionally makes it rather more intellectually demanding than a simple ballot box, which is worth acknowledging candidly.\n\n\n## Metadata\n\n\n- **Migration Status**: Ontology block enriched on 2025-11-12\n- **Last Updated**: 2025-11-12\n- **Review Status**: Comprehensive editorial review\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable",
  "properties": {
    "id": "bc-0466-quadratic-voting-ontology",
    "collapsed": "true",
    "- ontology": "true",
    "- term-id": "BC-0466",
    "- preferred-term": "Quadratic Voting",
    "- source-domain": "blockchain",
    "- status": "stub-needs-content",
    "- public-access": "true",
    "- content-status": "minimal-placeholder-requires-authoring",
    "- definition": "A component of the blockchain ecosystem.",
    "- maturity": "draft",
    "- owl:class": "bc:QuadraticVoting",
    "- owl:physicality": "ConceptualEntity",
    "- owl:role": "Concept",
    "- belongsToDomain": "[[BlockchainDomain]]",
    "- blockchainRelevance": "High",
    "- lastValidated": "2025-11-14"
  },
  "backlinks": [
    "Governance Token",
    "Decentralized Autonomous Organization (DAO)",
    "Telecollaboration and Telepresence",
    "AI Governance Principle"
  ],
  "wiki_links": [
    "BlockchainDomain"
  ],
  "ontology": {
    "term_id": "BC-0466",
    "preferred_term": "Quadratic Voting",
    "definition": "A component of the blockchain ecosystem.",
    "source_domain": "blockchain",
    "maturity_level": null,
    "authority_score": null
  }
}