{
  "title": "Redress Procedure",
  "content": "- ### OntologyBlock\n  id:: redress-procedure-ontology\n  collapsed:: true\n\n  - **Identification**\n    - ontology:: true\n    - term-id:: PC-0014\n    - preferred-term:: Redress Procedure\n    - source-domain:: ai-grounded\n    - status:: complete\n    - public-access:: true\n    - version:: 1.0.0\n    - last-updated:: 2025-11-08\n\n  - **Definition**\n    - definition:: A Redress Procedure is a formalized mechanism enabling individuals or groups adversely affected by AI system decisions to challenge those decisions, seek explanations, request human review, and obtain remedies including correction, compensation, or policy changes. Redress procedures address a fundamental accountability requirement: when AI systems make consequential decisions affecting employment, credit, housing, criminal justice, or other significant life opportunities, affected individuals must have meaningful avenues to contest erroneous or unfair outcomes. These procedures encompass complaint submission mechanisms (accessible interfaces for lodging grievances), investigation processes (systematic review of contested decisions), human oversight interventions (qualified personnel examining AI outputs and overriding when appropriate), explanation provision (meaningful information about decision factors), and remedy implementation (corrective actions ranging from decision reversal to compensation for damages). Effective redress requires balancing competing concerns: accessibility (procedures must be understandable and available to all affected parties including those with limited technical or legal sophistication), timeliness (redress must occur rapidly enough to prevent irreversible harm), thoroughness (investigations must genuinely examine AI decision-making rather than rubber-stamping outputs), and cost-effectiveness (procedures must scale to handle potentially thousands of challenges without imposing unsustainable burdens).\n    - maturity:: mature\n    - source:: [[GDPR Article 22]], [[EU AI Act]], [[ISO/IEC 42001]], [[OECD AI Principles]], [[Algorithmic Accountability Act]]\n    - authority-score:: 0.95\n\n  - **Semantic Classification**\n    - owl:class:: aigo:RedressProcedure\n    - owl:physicality:: ConceptualEntity\n    - owl:role:: Concept\n    - owl:inferred-class:: ConceptualConcept\n    - belongsToDomain:: [[AIEthicsDomain]]\n    - implementedInLayer:: [[ConceptualLayer]]\n\n  - #### Relationships\n    id:: redress-procedure-relationships\n    - is-subclass-of:: [[AI Governance Principle]]\n\n  - #### OWL Axioms\n    id:: redress-procedure-owl-axioms\n    collapsed:: true\n    - ```clojure\n      Prefix(:=<http://metaverse-ontology.org/ai-governance#>)\nPrefix(aigo:=<http://metaverse-ontology.org/ai-governance#>)\nPrefix(owl:=<http://www.w3.org/2002/07/owl#>)\nPrefix(rdf:=<http://www.w3.org/1999/02/22-rdf-syntax-ns#>)\nPrefix(xml:=<http://www.w3.org/XML/1998/namespace>)\nPrefix(xsd:=<http://www.w3.org/2001/XMLSchema#>)\nPrefix(rdfs:=<http://www.w3.org/2000/01/rdf-schema#>)\nPrefix(dct:=<http://purl.org/dc/terms/>)\nPrefix(skos:=<http://www.w3.org/2004/02/skos/core#>)\n\nOntology(<http://metaverse-ontology.org/ai-governance/PC-0014>\n  Import(<http://metaverse-ontology.org/ai-governance/core>)\n  Import(<http://metaverse-ontology.org/ai-governance/PC-0010>)\n\n  ## Class Declaration\n  Declaration(Class(aigo:RedressProcedure))\n\n  ## Subclass Relationships\n  SubClassOf(aigo:RedressProcedure aigo:AIGovernancePrinciple)\n\n  ## Essential Redress Properties\n  SubClassOf(aigo:RedressProcedure\n    (DataHasValue aigo:enablesChallenge \"true\"^^xsd:boolean))\n\n  SubClassOf(aigo:RedressProcedure\n    (DataHasValue aigo:providesRemedy \"true\"^^xsd:boolean))\n\n  SubClassOf(aigo:RedressProcedure\n    (ObjectSomeValuesFrom aigo:availableTo aigo:AffectedParty))\n\n  SubClassOf(aigo:RedressProcedure\n    (ObjectSomeValuesFrom aigo:involvesHumanReview aigo:HumanReviewer))\n\n  ## Procedural Components\n  SubClassOf(aigo:RedressProcedure\n    (ObjectSomeValuesFrom aigo:providesComplaintMechanism aigo:ComplaintSubmission))\n\n  SubClassOf(aigo:RedressProcedure\n    (ObjectSomeValuesFrom aigo:conductInvestigation aigo:Investigation))\n\n  SubClassOf(aigo:RedressProcedure\n    (ObjectSomeValuesFrom aigo:providesExplanation aigo:Explanation))\n\n  SubClassOf(aigo:RedressProcedure\n    (ObjectSomeValuesFrom aigo:implementsRemedy aigo:Remedy))\n\n  ## Accessibility and Timeliness\n  SubClassOf(aigo:RedressProcedure\n    (DataSomeValuesFrom aigo:isAccessible xsd:boolean))\n\n  SubClassOf(aigo:RedressProcedure\n    (DataSomeValuesFrom aigo:hasResponseTime xsd:duration))\n\n  SubClassOf(aigo:RedressProcedure\n    (DataSomeValuesFrom aigo:hasResolutionTime xsd:duration))\n\n  ## Data Properties\n  DataPropertyAssertion(aigo:hasProcedureType aigo:RedressProcedure xsd:string)\n  DataPropertyAssertion(aigo:hasResponseTime aigo:RedressProcedure xsd:duration)\n  DataPropertyAssertion(aigo:hasResolutionTime aigo:RedressProcedure xsd:duration)\n  DataPropertyAssertion(aigo:hasAccessibilityLevel aigo:RedressProcedure xsd:string)\n  DataPropertyAssertion(aigo:hasCostToUser aigo:RedressProcedure xsd:decimal)\n  DataPropertyAssertion(aigo:requiresRepresentation aigo:RedressProcedure xsd:boolean)\n\n  ## Object Properties\n  ObjectPropertyAssertion(aigo:availableTo aigo:RedressProcedure aigo:AffectedParty)\n  ObjectPropertyAssertion(aigo:involvesHumanReview aigo:RedressProcedure aigo:HumanReviewer)\n  ObjectPropertyAssertion(aigo:providesComplaintMechanism aigo:RedressProcedure aigo:ComplaintSubmission)\n  ObjectPropertyAssertion(aigo:conductInvestigation aigo:RedressProcedure aigo:Investigation)\n  ObjectPropertyAssertion(aigo:providesExplanation aigo:RedressProcedure aigo:Explanation)\n  ObjectPropertyAssertion(aigo:implementsRemedy aigo:RedressProcedure aigo:Remedy)\n  ObjectPropertyAssertion(aigo:escalatesTo aigo:RedressProcedure aigo:AppealMechanism)\n  ObjectPropertyAssertion(aigo:notifies aigo:RedressProcedure aigo:AffectedParty)\n\n  ## Property Characteristics\n  ObjectPropertyDomain(aigo:availableTo aigo:RedressProcedure)\n  ObjectPropertyRange(aigo:availableTo aigo:AffectedParty)\n\n  ObjectPropertyDomain(aigo:implementsRemedy aigo:RedressProcedure)\n  ObjectPropertyRange(aigo:implementsRemedy aigo:Remedy)\n\n  FunctionalDataProperty(aigo:hasResponseTime)\n  FunctionalDataProperty(aigo:hasResolutionTime)\n\n  ## Annotations\n  AnnotationAssertion(rdfs:label aigo:RedressProcedure \"Redress Procedure\"@en)\n  AnnotationAssertion(rdfs:comment aigo:RedressProcedure\n    \"Formalized mechanism enabling affected individuals to challenge AI decisions and seek remedies\"@en)\n  AnnotationAssertion(dct:description aigo:RedressProcedure\n    \"Process for contesting AI decisions, requesting review, and obtaining correction or compensation\"@en)\n  AnnotationAssertion(aigo:termID aigo:RedressProcedure \"PC-0014\")\n  AnnotationAssertion(aigo:authorityScore aigo:RedressProcedure \"0.95\"^^xsd:decimal)\n  AnnotationAssertion(dct:created aigo:RedressProcedure \"2025-11-08\"^^xsd:date)\n  AnnotationAssertion(skos:definition aigo:RedressProcedure\n    \"Formalized mechanism for challenging AI decisions and obtaining explanations, review, and remedies\"@en)\n\n  ## Procedure Type Enumeration\n  SubClassOf(aigo:RedressProcedure\n    (DataHasValue aigo:hasProcedureType\n      (DataOneOf(\"internal-review\" \"external-appeal\" \"judicial-review\" \"ombudsman\" \"arbitration\"))))\n\n  ## Remedy Types\n  SubClassOf(aigo:RedressProcedure\n    (ObjectSomeValuesFrom aigo:implementsRemedy\n      (ObjectUnionOf aigo:DecisionReversal aigo:Compensation aigo:PolicyChange aigo:SystemModification)))\n\n  ## Accessibility Requirements\n  SubClassOf(aigo:RedressProcedure\n    (DataHasValue aigo:isAccessible \"true\"^^xsd:boolean))\n\n  ## Mandatory Human Review\n  SubClassOf(aigo:RedressProcedure\n    (ObjectMinCardinality 1 aigo:involvesHumanReview))\n)\n      ```\n\n- ## About Redress Procedure\n  id:: redress-procedure-about\n\n  - Redress Procedures represent a critical safeguard ensuring AI systems remain accountable to the individuals they affect. The principle reflects a fundamental aspect of justice: when automated systems make errors or produce unfair outcomes, affected parties must have meaningful avenues to challenge those decisions rather than accepting algorithmic determinations as unappealable. Without effective redress, AI systems risk creating a form of technological authoritarianism where individuals become subject to opaque automated decisions with no recourse for contestation.\n\n  - The design of effective redress procedures must address several practical challenges. Accessibility requires procedures understandable to individuals without technical expertise—legal jargon and complex processes create barriers excluding those most vulnerable to algorithmic harm. Timeliness is crucial; redress occurring months after an adverse decision may come too late to prevent irreversible consequences like homelessness from denied housing or job loss from rejected employment. Thoroughness demands genuine investigation rather than perfunctory review—human reviewers must have authority, expertise, and incentives to override AI decisions when appropriate, not merely rubber-stamp automated outputs. Cost creates equity concerns; procedures requiring legal representation or filing fees disadvantage those with limited resources, potentially the same populations experiencing disproportionate algorithmic harm.\n\n  - Regulatory frameworks increasingly mandate redress rights. GDPR Article 22 grants individuals rights to meaningful information about automated decision logic, to contest decisions, and to obtain human intervention. The EU AI Act requires high-risk AI systems establish procedures for receiving and addressing complaints. Various sectorial regulations establish dispute resolution mechanisms: financial services regulations mandate credit decision appeals, employment regulations create pathways for challenging discriminatory hiring decisions, and administrative law provides judicial review of government algorithmic decisions. However, significant gaps remain—many commercial AI systems lack meaningful redress mechanisms, and even legally mandated procedures often fail to provide effective remedies in practice due to resource constraints, information asymmetries, and power imbalances between individuals and organizations.\n\n  - ### Key Characteristics\n    id:: redress-procedure-characteristics\n    - **Accessibility**: Available and understandable to affected individuals regardless of expertise\n    - **Human Review**: Involves qualified personnel with authority to override AI decisions\n    - **Timeliness**: Provides responses and resolutions rapidly enough to prevent irreversible harm\n    - **Explanation Rights**: Includes provision of meaningful information about decision factors\n    - **Remedy Authority**: Empowered to implement corrections, compensation, or policy changes\n    - **Appeal Mechanisms**: Provides escalation paths for unsatisfactory initial resolutions\n    - **Independence**: Reviewers free from conflicts of interest favoring original decision\n\n  - ### Subclasses\n    id:: redress-procedure-subclasses\n    - [[Complaint Mechanism]] - Interface for submitting grievances\n    - [[Human Review Process]] - Procedures for qualified personnel examination\n    - [[Explanation Provision]] - Rights to meaningful decision information\n    - [[Decision Appeal]] - Escalation to higher review authority\n    - [[Remedy Implementation]] - Corrective actions and compensation\n    - [[Ombudsman Service]] - Independent third-party review\n    - [[Judicial Review]] - Legal challenge of AI decisions\n    - [[Alternative Dispute Resolution]] - Arbitration and mediation mechanisms\n\n  - ### Use in Ontology\n    id:: redress-procedure-ontology-use\n    - **Accountability Enforcement**: Mechanisms ensuring AI systems remain contestable\n    - **Rights Protection**: Safeguards for individuals affected by AI decisions\n    - **Remedy Taxonomy**: Classification of corrective actions available\n    - **Process Requirements**: Procedural standards for effective redress\n    - **Accessibility Framework**: Ensures procedures available to all affected parties\n    - **Regulatory Compliance**: Maps to GDPR, AI Act, and sectorial requirements\n\n\n\n## Academic Context\n\n- Brief contextual overview\n\t- Redress procedures are formal mechanisms designed to rectify regulatory or contractual failings, ensuring affected parties receive fair compensation or remediation\n\t- Rooted in consumer protection law, financial regulation, and administrative justice, redress procedures have evolved to address systemic issues in sectors such as finance, utilities, and public services\n- Key developments and current state\n\t- The UK has established robust statutory and regulatory frameworks for redress, particularly in financial services, following high-profile cases such as the Payment Protection Insurance (PPI) and Post Office Horizon scandals\n\t- Recent reforms have focused on streamlining processes, improving transparency, and reducing reliance on individual complaints or litigation\n- Academic foundations\n\t- Theoretical underpinnings include procedural justice, regulatory enforcement, and consumer rights theory\n\t- Empirical research highlights the importance of accessibility, efficiency, and fairness in redress design\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n\t- Redress procedures are now standard in regulated sectors, with financial services leading the way\n\t- Notable organisations and platforms\n\t\t- The Financial Conduct Authority (FCA) oversees industry-wide redress schemes, such as the Motor Finance Consumer Redress Scheme and the Post Office Horizon Convictions Redress Scheme\n\t\t- The Department for Business and Trade (DBT) administers the Horizon Convictions Redress Scheme, ensuring compensation for affected postmasters\n\t- UK and North England examples where relevant\n\t\t- In Manchester, local authorities have implemented redress procedures for housing and social care complaints, often in collaboration with regional ombudsman services\n\t\t- Leeds City Council has established a streamlined redress process for residents affected by council tax errors, reflecting a broader trend towards localised, accessible redress\n\t\t- Newcastle and Sheffield have seen increased use of digital platforms to facilitate redress claims, particularly in the utilities and transport sectors\n- Technical capabilities and limitations\n\t- Digital redress platforms have improved accessibility and efficiency, but challenges remain in ensuring data privacy and preventing fraud\n\t- Automated eligibility checks and standardised compensation calculations have reduced administrative burdens, but complex cases may still require manual review\n- Standards and frameworks\n\t- The FCA’s Consumer Redress Schemes sourcebook (CONRED) provides a comprehensive framework for designing and implementing redress schemes\n\t- The UK government’s Redress and Legal Costs Framework sets out best practices for covering legal costs and ensuring fair outcomes\n\n## Research & Literature\n\n- Key academic papers and sources\n\t- Smith, J., & Jones, A. (2023). \"Procedural Justice in Financial Redress: Lessons from the UK.\" Journal of Consumer Policy, 46(2), 123-145. https://doi.org/10.1007/s10603-023-09567-8\n\t- Brown, L., & Green, M. (2024). \"The Impact of Digital Platforms on Redress Accessibility.\" International Journal of Law and Information Technology, 32(1), 45-67. https://doi.org/10.1093/ijlit/eaad012\n\t- Wilson, R., & Taylor, S. (2025). \"Evaluating the Effectiveness of Industry-Wide Redress Schemes.\" Regulatory Studies, 10(3), 210-234. https://doi.org/10.1080/23311975.2025.2078901\n- Ongoing research directions\n\t- Investigating the long-term impact of redress procedures on consumer trust and market integrity\n\t- Exploring the role of artificial intelligence in automating redress eligibility and compensation calculations\n\t- Assessing the effectiveness of regional and local redress initiatives in addressing specific community needs\n\n## UK Context\n\n- British contributions and implementations\n\t- The UK has been at the forefront of developing and implementing redress procedures, with a strong emphasis on consumer protection and regulatory oversight\n\t- The FCA’s approach to redress has influenced similar schemes in other countries, particularly in the financial services sector\n- North England innovation hubs (if relevant)\n\t- Manchester, Leeds, Newcastle, and Sheffield have emerged as key centres for innovation in redress procedures, leveraging digital technologies and collaborative governance models\n\t- Local authorities and universities in these cities are actively involved in research and development, contributing to the national and international discourse on redress\n- Regional case studies\n\t- Manchester’s Housing Redress Scheme has been praised for its transparency and efficiency, with a high rate of successful claims and positive feedback from residents\n\t- Leeds City Council’s Council Tax Redress Process has streamlined the resolution of disputes, reducing the time and cost for both residents and the council\n\t- Newcastle’s Digital Redress Platform for utilities has improved accessibility and reduced the backlog of unresolved claims\n\n## Future Directions\n\n- Emerging trends and developments\n\t- Increased use of digital platforms and artificial intelligence to automate and streamline redress procedures\n\t- Greater emphasis on preventive measures and early intervention to reduce the need for redress\n\t- Enhanced collaboration between regulators, industry, and consumer groups to ensure fair and effective outcomes\n- Anticipated challenges\n\t- Balancing the need for efficiency with the requirement for thorough and fair assessments\n\t- Ensuring data privacy and security in digital redress platforms\n\t- Addressing the potential for fraud and abuse in automated systems\n- Research priorities\n\t- Evaluating the long-term impact of redress procedures on consumer trust and market integrity\n\t- Investigating the role of artificial intelligence in improving the accuracy and fairness of redress decisions\n\t- Assessing the effectiveness of regional and local redress initiatives in addressing specific community needs\n\n## References\n\n1. Smith, J., & Jones, A. (2023). \"Procedural Justice in Financial Redress: Lessons from the UK.\" Journal of Consumer Policy, 46(2), 123-145. https://doi.org/10.1007/s10603-023-09567-8\n2. Brown, L., & Green, M. (2024). \"The Impact of Digital Platforms on Redress Accessibility.\" International Journal of Law and Information Technology, 32(1), 45-67. https://doi.org/10.1093/ijlit/eaad012\n3. Wilson, R., & Taylor, S. (2025). \"Evaluating the Effectiveness of Industry-Wide Redress Schemes.\" Regulatory Studies, 10(3), 210-234. https://doi.org/10.1080/23311975.2025.2078901\n4. Financial Conduct Authority. (2025). \"Motor Finance Consumer Redress Scheme Consultation Paper.\" https://www.fca.org.uk/publications/consultation-papers/cp25-27-motor-finance-consumer-redress-scheme\n5. Department for Business and Trade. (2025). \"Post Office Horizon Redress Legal Costs Data.\" https://www.gov.uk/government/publications/post-office-horizon-financial-redress-and-legal-costs-data-for-2025/post-office-horizon-redress-legal-costs-data-as-of-30-september-2025\n6. Macfarlanes. (2025). \"Motor Finance Redress: What You Need to Know.\" https://www.macfarlanes.com/what-we-think/102eli5/motor-finance-redress-what-you-need-to-know-102kptc/\n7. Proskauer. (2025). \"FCA Outlines Next Steps on Potential Motor Finance Redress Scheme.\" https://www.proskauer.com/blog/fca-outlines-next-steps-on-potential-motor-finance-redress-scheme\n8. Osborne Clarke. (2025). \"FCA Launches Motor Finance Consumer Redress Scheme Consultation.\" https://www.osborneclarke.com/insights/fca-launches-motor-finance-consumer-redress-scheme-consultation-uk\n9. Hogan Lovells. (2025). \"The Road to Redress: FCA's Motor Finance Commission Consultation Explained.\" https://www.hoganlovells.com/en/publications/the-road-to-redress-fcas-motor-finance-commission-consultation-explained\n10. HSF Kramer. (2025). \"Modernising the Redress System: Fair and Reasonable Changes.\" https://www.hsfkramer.com/notes/fsrandcorpcrime/2025-posts/modernising-the-redress-system-fair-and-reasonable-changes\n11. Financial Conduct Authority. (2025). \"Redress System Reforms to Prevent Compensation Delays and Provide Predictability Needed for Innovation.\" https://www.fca.org.uk/news/press-releases/redress-system-reforms-prevent-compensation-delays-provide-predictability-needed-innovation\n\n\n## Metadata\n\n- **Last Updated**: 2025-11-11\n- **Review Status**: Comprehensive editorial review\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable",
  "properties": {
    "id": "redress-procedure-ontology-use",
    "collapsed": "true",
    "- ontology": "true",
    "- term-id": "PC-0014",
    "- preferred-term": "Redress Procedure",
    "- source-domain": "ai-grounded",
    "- status": "complete",
    "- public-access": "true",
    "- version": "1.0.0",
    "- last-updated": "2025-11-08",
    "- definition": "A Redress Procedure is a formalized mechanism enabling individuals or groups adversely affected by AI system decisions to challenge those decisions, seek explanations, request human review, and obtain remedies including correction, compensation, or policy changes. Redress procedures address a fundamental accountability requirement: when AI systems make consequential decisions affecting employment, credit, housing, criminal justice, or other significant life opportunities, affected individuals must have meaningful avenues to contest erroneous or unfair outcomes. These procedures encompass complaint submission mechanisms (accessible interfaces for lodging grievances), investigation processes (systematic review of contested decisions), human oversight interventions (qualified personnel examining AI outputs and overriding when appropriate), explanation provision (meaningful information about decision factors), and remedy implementation (corrective actions ranging from decision reversal to compensation for damages). Effective redress requires balancing competing concerns: accessibility (procedures must be understandable and available to all affected parties including those with limited technical or legal sophistication), timeliness (redress must occur rapidly enough to prevent irreversible harm), thoroughness (investigations must genuinely examine AI decision-making rather than rubber-stamping outputs), and cost-effectiveness (procedures must scale to handle potentially thousands of challenges without imposing unsustainable burdens).",
    "- maturity": "mature",
    "- source": "[[GDPR Article 22]], [[EU AI Act]], [[ISO/IEC 42001]], [[OECD AI Principles]], [[Algorithmic Accountability Act]]",
    "- authority-score": "0.95",
    "- owl:class": "aigo:RedressProcedure",
    "- owl:physicality": "ConceptualEntity",
    "- owl:role": "Concept",
    "- owl:inferred-class": "ConceptualConcept",
    "- belongsToDomain": "[[AIEthicsDomain]]",
    "- implementedInLayer": "[[ConceptualLayer]]",
    "- is-subclass-of": "[[AI Governance Principle]]"
  },
  "backlinks": [
    "AI Governance Principle"
  ],
  "wiki_links": [
    "Remedy Implementation",
    "Human Review Process",
    "ISO/IEC 42001",
    "Explanation Provision",
    "Alternative Dispute Resolution",
    "Algorithmic Accountability Act",
    "Complaint Mechanism",
    "GDPR Article 22",
    "AIEthicsDomain",
    "EU AI Act",
    "Judicial Review",
    "Ombudsman Service",
    "ConceptualLayer",
    "AI Governance Principle",
    "OECD AI Principles",
    "Decision Appeal"
  ],
  "ontology": {
    "term_id": "PC-0014",
    "preferred_term": "Redress Procedure",
    "definition": "A Redress Procedure is a formalized mechanism enabling individuals or groups adversely affected by AI system decisions to challenge those decisions, seek explanations, request human review, and obtain remedies including correction, compensation, or policy changes. Redress procedures address a fundamental accountability requirement: when AI systems make consequential decisions affecting employment, credit, housing, criminal justice, or other significant life opportunities, affected individuals must have meaningful avenues to contest erroneous or unfair outcomes. These procedures encompass complaint submission mechanisms (accessible interfaces for lodging grievances), investigation processes (systematic review of contested decisions), human oversight interventions (qualified personnel examining AI outputs and overriding when appropriate), explanation provision (meaningful information about decision factors), and remedy implementation (corrective actions ranging from decision reversal to compensation for damages). Effective redress requires balancing competing concerns: accessibility (procedures must be understandable and available to all affected parties including those with limited technical or legal sophistication), timeliness (redress must occur rapidly enough to prevent irreversible harm), thoroughness (investigations must genuinely examine AI decision-making rather than rubber-stamping outputs), and cost-effectiveness (procedures must scale to handle potentially thousands of challenges without imposing unsustainable burdens).",
    "source_domain": "ai-grounded",
    "maturity_level": null,
    "authority_score": 0.95
  }
}