{
  "title": "Stablecoin",
  "content": "- ### OntologyBlock\n  id:: stablecoin-ontology\n  collapsed:: true\n\t- ontology:: true\n    - is-subclass-of:: [[BlockchainTechnology]]\n\t- term-id:: 20190\n\t- source-domain:: blockchain\n\t- status:: draft\n    - public-access:: true\n\t- preferred-term:: Stablecoin\n\t- definition:: A cryptocurrency whose value is algorithmically or institutionally pegged to a reserve asset to maintain price stability, enabling reliable medium of exchange and store of value in virtual economies.\n\t- maturity:: mature\n\t- source:: [[ISO 24165]], [[IMF CBDC Notes]]\n\t- owl:class:: bc:Stablecoin\n\t- owl:physicality:: VirtualEntity\n\t- owl:role:: Object\n\t- owl:inferred-class:: mv:VirtualObject\n\t- owl:functional-syntax:: true\n\t- belongsToDomain:: [[BlockchainDomain]], [[TrustAndGovernanceDomain]]\n\t- implementedInLayer:: [[MiddlewareLayer]]\n\t- #### Relationships\n\t  id:: stablecoin-relationships\n\t\t- is-part-of:: [[Crypto Token]], [[Virtual Currency]], [[Digital Asset]]\n\t\t- requires:: [[Blockchain]], [[Smart Contract]], [[Collateral Reserves]], [[Price Oracle]]\n\t\t- depends-on:: [[Peg Mechanism]], [[Reserve Asset]], [[Stabilization Algorithm]]\n\t\t- enables:: [[Price Stability]], [[Cross-Border Transactions]], [[Virtual Commerce]], [[Value Transfer]]\n\t- #### OWL Axioms\n\t  id:: stablecoin-owl-axioms\n\t  collapsed:: true\n\t\t- ```clojure\n\t\t  Declaration(Class(bc:Stablecoin))\n\n\t\t  # Classification along two primary dimensions\n\t\t  SubClassOf(bc:Stablecoin mv:VirtualEntity)\n\t\t  SubClassOf(bc:Stablecoin mv:Object)\n\n\t\t  # Stablecoin is specialized cryptocurrency with stability mechanism\n\t\t  SubClassOf(bc:Stablecoin mv:CryptoToken)\n\t\t  SubClassOf(bc:Stablecoin mv:VirtualCurrency)\n\t\t  SubClassOf(bc:Stablecoin mv:DigitalAsset)\n\n\t\t  # Domain classification\n\t\t  SubClassOf(bc:Stablecoin\n\t\t    ObjectSomeValuesFrom(mv:belongsToDomain mv:VirtualEconomyDomain)\n\t\t  )\n\t\t  SubClassOf(bc:Stablecoin\n\t\t    ObjectSomeValuesFrom(mv:belongsToDomain mv:TrustAndGovernanceDomain)\n\t\t  )\n\n\t\t  # Layer classification\n\t\t  SubClassOf(bc:Stablecoin\n\t\t    ObjectSomeValuesFrom(mv:implementedInLayer mv:MiddlewareLayer)\n\t\t  )\n\n\t\t  # Stablecoins must have a peg mechanism\n\t\t  SubClassOf(bc:Stablecoin\n\t\t    ObjectExactCardinality(1 mv:hasPegMechanism mv:PegMechanism)\n\t\t  )\n\n\t\t  # Stablecoins target specific reference asset\n\t\t  SubClassOf(bc:Stablecoin\n\t\t    ObjectSomeValuesFrom(mv:isPeggedTo mv:ReserveAsset)\n\t\t  )\n\n\t\t  # Stablecoins enable price stability\n\t\t  SubClassOf(bc:Stablecoin\n\t\t    ObjectSomeValuesFrom(mv:enables mv:PriceStability)\n\t\t  )\n\n\t\t  # Stablecoins require oracles for price reference\n\t\t  SubClassOf(bc:Stablecoin\n\t\t    ObjectSomeValuesFrom(mv:requires mv:PriceOracle)\n\t\t  )\n\n\t\t  # Stablecoins are fungible\n\t\t  SubClassOf(bc:Stablecoin\n\t\t    DataHasValue(mv:isFungible \"true\"^^xsd:boolean)\n\t\t  )\n\n\t\t  # Collateralized stablecoins require reserves\n\t\t  SubClassOf(\n\t\t    ObjectIntersectionOf(bc:Stablecoin mv:CollateralizedStablecoin)\n\t\t    ObjectSomeValuesFrom(mv:requires mv:CollateralReserves)\n\t\t  )\n\n  # Property characteristics\n  TransitiveObjectProperty(dt:ispartof)\n\n  # Property characteristics\n  AsymmetricObjectProperty(dt:requires)\n\n  # Property characteristics\n  AsymmetricObjectProperty(dt:dependson)\n\n  # Property characteristics\n  AsymmetricObjectProperty(dt:enables)\n```\n\n- ## About Stablecoin\n  id:: stablecoin-about\n\t- Stablecoins are a category of cryptocurrencies engineered to maintain a stable value relative to a reference asset, typically a fiat currency like the US dollar, but also commodities like gold or baskets of assets. Unlike highly volatile cryptocurrencies such as [[Bitcoin]] or [[Ethereum]], stablecoins aim to provide the benefits of blockchain technology—fast transactions, transparency, programmability—while minimizing price fluctuations that make traditional cryptocurrencies impractical for everyday commerce and value storage. This stability is achieved through various mechanisms including [[Fiat-Backed]] reserves, cryptocurrency over-collateralization, [[Algorithmic Stablecoin]] supply adjustments, or hybrid approaches.\n\t- The importance of stablecoins in metaverse and virtual economy contexts cannot be overstated. They serve as the foundational medium of exchange that enables reliable pricing, [[Cross-Border Payments]], and economic calculation without the cognitive overhead of constantly adjusting for volatility. When a virtual world prices a digital asset or service in a stablecoin, users can confidently assess value without worrying that their purchasing power will dramatically change between viewing and purchasing. Stablecoins also facilitate seamless integration between virtual economies and traditional financial systems, acting as bridges that allow value to flow efficiently across physical and digital realms through [[DeFi]] protocols.\n\t- There are several distinct types of stablecoins, each with different trust assumptions and mechanisms. [[Fiat-Backed]] stablecoins (like [[USDT]], [[USDC]], [[BUSD]], and [[FRAX]]) are backed by traditional currency reserves held by centralized entities like [[Tether]], [[Circle]], [[Paxos]], and [[Binance]], offering simplicity but requiring trust in the issuer's financial transparency and reserve management. [[Crypto-Backed]] stablecoins like [[DAI]] use [[Collateralization]] with cryptocurrency assets managed by [[Smart Contract]]s, providing decentralization at the cost of capital efficiency. [[Algorithmic Stablecoin]]s like [[USDD]] attempt to maintain pegs through programmatic supply adjustments and incentive mechanisms without relying on collateral, though they face challenges in maintaining stability during market stress as demonstrated by [[Terra Luna]] and [[UST]]. [[Central Bank Digital Currency]] (CBDCs), while distinct, share characteristics with stablecoins and represent government-issued digital currencies on blockchain or similar technologies.\n\t- ### Key Characteristics\n\t  id:: stablecoin-characteristics\n\t\t- **Price Stability**: Maintains relatively stable value compared to volatile cryptocurrencies\n\t\t- **[[Peg Mechanism]]**: Uses reserves, algorithms, or hybrid approaches to maintain target value\n\t\t- **[[Collateralization]]**: May be backed by fiat, crypto, commodities, or algorithms\n\t\t- **Transparency**: Often provides verifiable reserves or on-chain mechanisms\n\t\t- **Liquidity**: High trading volumes and market depth enable easy conversion\n\t\t- **Fungibility**: Each unit is interchangeable with any other unit of the same stablecoin\n\t\t- **Blockchain-Based**: Leverages distributed ledger for fast, global transactions\n\t\t- **Programmability**: [[Smart Contract]] integration enables [[DeFi]] applications and automated transactions\n\t- ### Technical Components\n\t  id:: stablecoin-components\n\t\t- [[Blockchain]] - Distributed ledger infrastructure hosting stablecoin smart contracts and transaction records\n\t\t- [[Smart Contract]] - Programmable logic managing issuance, redemption, and stabilization mechanisms\n\t\t- [[Collateral Reserves]] - Fiat currency, cryptocurrencies, or other assets backing stablecoin value\n\t\t- [[Price Oracle]] - Data feeds providing real-time price information for maintaining [[Peg Mechanism]]\n\t\t- [[Peg Mechanism]] - Technical system (reserves, algorithms, arbitrage) maintaining stable value\n\t\t- [[Token Standard]] - [[ERC-20]] or similar standard ensuring interoperability across platforms like [[Ethereum]], [[Tron]], [[Polygon]], [[Avalanche]]\n\t\t- [[Reserve Asset]] - Reference currency or commodity to which stablecoin is pegged\n\t\t- [[Stabilization Algorithm]] - Automated mechanisms adjusting supply or incentives to maintain peg\n\t\t- **Redemption Mechanism** - Process allowing users to exchange stablecoins for underlying reserves\n\t\t- **Attestation Service** - Third-party audits verifying reserve backing for [[Fiat-Backed]] stablecoins\n\t\t- **Liquidity Pools** - [[DeFi]] mechanisms providing deep markets for stablecoin trading on platforms like [[Curve Finance]]\n\t\t- **Multi-signature Wallets** - Security infrastructure for managing collateral reserves\n\t- ### Functional Capabilities\n\t  id:: stablecoin-capabilities\n\t\t- **Price Stability**: Maintains predictable value enabling reliable pricing and economic calculation\n\t\t- **Medium of Exchange**: Serves as practical currency for buying, selling, and trading in virtual economies\n\t\t- **Store of Value**: Provides short to medium-term value preservation without significant volatility\n\t\t- **Unit of Account**: Enables consistent pricing of goods and services across time periods\n\t\t- **[[Cross-Border Transactions]]**: Facilitates fast, low-cost international value transfer without intermediaries\n\t\t- **[[DeFi]] Integration**: Powers decentralized finance applications including lending, borrowing, and yield generation on platforms like [[Aave]], [[Compound]], and [[MakerDAO]]\n\t\t- **Programmable Payments**: Enables automated, conditional transfers through [[Smart Contract]] logic\n\t\t- **Liquidity Provision**: Serves as stable trading pairs for volatile cryptocurrencies on exchanges\n\t\t- **Fiat Bridge**: Connects traditional financial systems with blockchain-based virtual economies\n\t\t- **[[Remittances]]**: Provides efficient mechanism for sending value across borders with lower fees than traditional systems\n\t- ### Use Cases\n\t  id:: stablecoin-use-cases\n\t\t- **Virtual Commerce**: Metaverse platforms use stablecoins for pricing virtual goods, services, and real estate, providing consistent value that doesn't fluctuate dramatically during transactions\n\t\t- **[[Cross-Border Payments]]**: Businesses and individuals send international payments via stablecoins like [[USDT]], [[USDC]], and [[DAI]], bypassing traditional banking systems and reducing fees and settlement times\n\t\t- **Salary and Payroll**: Remote workers and international contractors receive payments in stablecoins, enabling fast, low-cost transfers without currency conversion fees\n\t\t- **[[DeFi]] Lending**: Users deposit stablecoins in decentralized lending protocols like [[Aave]] and [[Compound]] to earn yield or borrow against cryptocurrency collateral without liquidation risk from volatility\n\t\t- **Trading Pairs**: Cryptocurrency exchanges use stablecoins as base trading pairs, allowing traders to exit volatile positions into stable value\n\t\t- **Gaming Economies**: Play-to-earn games use stablecoins to reward players with reliable value that maintains purchasing power between earning and spending\n\t\t- **Merchant Acceptance**: Online retailers accept stablecoin payments via [[PayPal]] and other processors, benefiting from fast settlement and lower fees while avoiding cryptocurrency volatility risk\n\t\t- **Savings and Wealth Preservation**: Users in countries with high inflation or restricted banking access use stablecoins to preserve wealth in dollar-denominated assets\n\t\t- **[[Remittances]] Corridors**: Migrant workers send money to families using stablecoins, reducing remittance costs from 6-8% to under 1%\n\t\t- **Corporate Treasury**: Businesses hold stablecoins as part of treasury management for instant liquidity and blockchain-based transactions\n\t\t- **Charitable Donations**: Non-profits receive international donations in stablecoins, enabling transparent tracking and immediate access to funds\n\t\t- **Micropayments**: Content creators receive tips and microtransactions in stablecoins on [[Lightning Network]] and other payment networks, viable due to low transaction fees\n\t- ### Standards & References\n\t  id:: stablecoin-standards\n\t\t- [[ISO 24165]] - International standard for digital token identifiers including stablecoin classification\n\t\t- [[IMF CBDC Notes]] - International Monetary Fund research and guidance on central bank digital currencies and stablecoins\n\t\t- [[FATF]] Virtual Asset Guidance - Financial Action Task Force guidelines for virtual asset service providers including stablecoin issuers\n\t\t- [[ERC-20]] Token Standard - Common [[Ethereum]] standard for implementing fungible stablecoins\n\t\t- [[Centre Consortium]] - Organization behind [[USDC]] defining standards for [[Fiat-Backed]] stablecoins\n\t\t- **Basel Committee on Banking Supervision** - International standards for prudential treatment of cryptoassets including stablecoins\n\t\t- **FSB Recommendations on Stablecoins** - Financial Stability Board regulatory recommendations for global stablecoin arrangements\n\t\t- **[[MiCA]] Regulation (EU)** - Markets in Crypto-Assets regulation establishing EU framework for stablecoin oversight\n\t\t- **OCC Interpretive Letters** - US Office of the Comptroller of the Currency guidance on banks issuing stablecoins\n\t\t- **Bank for International Settlements Reports** - Research on stablecoins and their implications for monetary and financial stability\n\t- ### Related Concepts\n\t  id:: stablecoin-related\n\t\t- [[Crypto Token]] - Parent category encompassing stablecoins and other blockchain-based tokens\n\t\t- [[Virtual Currency]] - Broader category of digital currencies used in virtual economies\n\t\t- [[Digital Asset]] - General classification for blockchain-based value representations\n\t\t- [[Central Bank Digital Currency]] - Government-issued digital currencies sharing stability characteristics with stablecoins\n\t\t- [[Fiat Currency]] - Traditional government-issued money to which most stablecoins are pegged\n\t\t- [[Price Oracle]] - Infrastructure providing price feeds necessary for stablecoin peg mechanisms\n\t\t- [[Payment System]] - Financial infrastructure for value transfer that stablecoins enhance\n\t\t- [[Smart Contract]] - Programmable logic enabling algorithmic stablecoin mechanisms\n\t\t- [[Collateral Reserves]] - Assets backing fiat-collateralized and crypto-collateralized stablecoins\n\t\t- [[Liquidity Pool]] - DeFi mechanism providing trading depth for stablecoin exchange\n\t\t- [[Cross-Border Transactions]] - International value transfers facilitated by stablecoins\n\t\t- [[mv:VirtualObject]] - Ontology classification for stablecoins as digital economic objects\n\n\n\n# Stablecoin Ontology Entry – Revised\n\n## Academic Context\n\n- Definition and foundational concepts\n  - Digital assets designed to maintain stable value relative to specified reference assets (fiat currencies, commodities, or cryptocurrency baskets)[1][2]\n  - Emerged in 2014 as a solution to cryptocurrency volatility, enabling practical use as payment instruments and stores of value[2]\n  - Distinguish themselves from volatile cryptocurrencies like [[Bitcoin]] and [[Ethereum]] by employing stabilisation mechanisms rather than relying on speculative market dynamics\n- Core stabilisation mechanisms\n  - [[Fiat-Backed]] stablecoins: maintain one-to-one [[Peg Mechanism]] through reserves of government-issued securities, bank deposits, repurchase agreements, and commercial paper[1]\n  - [[Crypto-Backed]] stablecoins: collateralised using cryptocurrencies like [[Ethereum]] with similar operational structures to [[Fiat-Backed]] variants[1]\n  - [[Algorithmic Stablecoin]]s: non-collateralised, maintaining value through mathematical equations that adjust supply based on market demand[1]\n  - Bank-issued stablecoins (tokenised deposits): deposit-like obligations established via [[Blockchain]] distributed ledger technology[1]\n\n## Current Landscape (2025)\n\n- Market scale and adoption\n  - Global stablecoin market capitalised at approximately £200 billion as of June 2025, with near 99% pegged to US dollars[2]\n  - Market capitalisation more than doubled in the past 18 months, from £95 billion to £200 billion[3]\n  - Industry forecasts project growth to £1.6 trillion by 2028[3]\n  - Primarily utilised for buying or selling crypto-assets and [[Cross-Border Payments]][2]\n- Institutional engagement\n  - Major financial institutions entering the space: JPMorgan Chase experimenting with tokenised deposits; [[PayPal]] launching proprietary stablecoin[3]\n  - Traditional finance participants attracted by price stability relative to other crypto-assets[1]\n  - [[Blockchain]] settlement enables instantaneous transaction completion, preserving distributed ledger technology advantages[1]\n- Technical capabilities and operational constraints\n  - Stored and exchanged on decentralised networks ([[Blockchain]]s like [[Ethereum]], [[Tron]], [[BSC]]) functioning as transaction ledgers[4]\n  - Largest reserve-backed stablecoins issued by entities retaining sole prerogative to mint and destroy tokens[4]\n  - Redemption mechanisms vary: [[Tether]] (largest by market capitalisation, issuing [[USDT]]) charges up to 1% fee with £79,000 minimum redemption threshold[4]\n  - [[DAI]] represents notable exception, issued by [[MakerDAO]] decentralised autonomous organisation governed by token-holder votes[4]\n- Regulatory framework (United States)\n  - [[GENIUS Act]] of 2025 establishes comprehensive regulatory framework for payment stablecoins[5][8]\n  - Restricts permissible stablecoin issuer activities to issuance, redemption, reserve management, and custodial services[5]\n  - Mandates asset segregation and prohibits commingling of reserves with limited exceptions[5]\n  - Prohibits rehypothecation of collateral except for creating liquidity to meet redemption expectations; permits Treasury bill pledging for short-term repurchase agreements[5]\n  - Custodial and safekeeping services restricted to entities subject to federal or state banking regulatory oversight[5]\n\n## Research & Literature\n\n- Key sources and current scholarship\n  - Arnold & Porter (2025). \"An Introduction to Stablecoins.\" Advisory publication providing comprehensive taxonomy of stablecoin structures and risk frameworks[1]\n  - McKinsey & Company (2025). \"What is a Stablecoin?\" Featured insights examining market evolution, institutional adoption, and financial services implications[3]\n  - Brookings Institution. \"What are Stablecoins, and How are They Regulated?\" Analysis of operational mechanics and regulatory approaches[4]\n  - [[SEC]] (2025). \"Statement on Stablecoins.\" Regulatory perspective on classification and investor protection considerations[6]\n  - International Monetary Fund (2025). \"Stablecoins and the Future of Finance.\" Working Paper 25/141 addressing international stablecoin flows and macroeconomic implications[7]\n- Ongoing research directions\n  - Reserve transparency and audit mechanisms (particularly relevant following [[Tether]]'s historical compliance failures)[2]\n  - [[Cross-Border Payments]] efficiency and regulatory harmonisation\n  - [[Algorithmic Stablecoin]] stability mechanisms under extreme market conditions following [[Terra Luna]] and [[UST]] collapse\n  - Integration with [[Central Bank Digital Currency]]\n\n## UK Context\n\n- Regulatory environment\n  - [[FCA]] (Financial Conduct Authority) oversight of stablecoin issuance and trading platforms\n  - [[Bank of England]] monitoring systemic financial stability implications\n  - HM Treasury engagement with international regulatory harmonisation efforts including [[MiCA]]\n- Financial services innovation\n  - UK-based fintech firms developing stablecoin infrastructure and custody solutions for [[USDC]], [[USDT]], and [[DAI]]\n  - London's established position as global financial centre positioning it for stablecoin settlement services\n  - Limited specific North England innovation hubs identified in current literature, though regional financial technology clusters in Manchester and Leeds merit monitoring for emerging developments\n\n## Future Directions\n\n- Emerging trends\n  - [[Central Bank Digital Currency]] integration with private stablecoins like [[USDC]] and [[DAI]]\n  - Enhanced reserve transparency through real-time audit mechanisms and [[Blockchain]]-based verification\n  - Expansion of use cases beyond trading and [[Cross-Border Payments]] into everyday commerce via [[PayPal]] and other platforms\n  - Regulatory convergence across jurisdictions following [[GENIUS Act]] precedent and [[MiCA]] implementation\n  - [[Bitcoin]] stablecoin developments on [[Lightning Network]] and [[RGB Protocol]]\n- Anticipated challenges\n  - Maintaining stability during extreme market volatility ([[Algorithmic Stablecoin]]s particularly vulnerable after [[Terra Luna]] failure)\n  - Balancing innovation incentives with consumer protection requirements under [[SEC]] and [[FCA]] oversight\n  - Preventing regulatory arbitrage across jurisdictions\n  - Addressing environmental concerns regarding [[Blockchain]] infrastructure on [[Ethereum]] and other networks\n- Research priorities\n  - Empirical analysis of stablecoin reserve adequacy and redemption mechanics for [[Tether]], [[Circle]], and [[Paxos]]\n  - Macroeconomic modelling of large-scale stablecoin adoption on monetary policy transmission\n  - Comparative regulatory effectiveness across jurisdictions ([[GENIUS Act]], [[MiCA]], [[FATF]])\n  - Technical resilience of stabilisation mechanisms under systemic stress in [[DeFi]] protocols like [[Aave]], [[Compound]], and [[MakerDAO]]\n\n## References\n\n[1] Arnold & Porter (2025). \"An Introduction to Stablecoins.\" Advisory publication. Available at: https://www.arnoldporter.com/en/perspectives/advisories/2025/05/an-introduction-to-stablecoins\n\n[2] Wikipedia (2025). \"Stablecoin.\" Encyclopaedia entry with historical background and regulatory developments.\n\n[3] McKinsey & Company (2025). \"What is a Stablecoin?\" Featured insights on market evolution and institutional adoption.\n\n[4] Brookings Institution. \"What are Stablecoins, and How are They Regulated?\" Policy analysis of operational mechanics and regulatory frameworks.\n\n[5] Linklaters (2025). \"The GENIUS Act of 2025 Stablecoin Legislation Adopted in the US.\" Legal analysis, 24 July 2025.\n\n[6] U.S. Securities and Exchange Commission (2025). \"Statement on Stablecoins.\" Regulatory guidance on classification and investor protection.\n\n[7] International Monetary Fund (2025). \"Stablecoins and the Future of Finance.\" Working Paper 25/141, Washington, D.C.\n\n[8] U.S. Congress (2025). \"Stablecoin Legislation: An Overview of S. 1582, GENIUS Act of 2025.\" Congressional Research Service product IN12553.\n\n---\n\n**Note:** The original definition remains substantially accurate but benefits from contextualisation within the 2025 regulatory landscape. The GENIUS Act represents the most significant development since 2024, establishing binding constraints on issuer activities and reserve management. Market capitalisation figures have been updated to reflect June 2025 data. North England-specific examples remain limited in available literature; this reflects genuine absence of documented regional innovation hubs rather than research oversight.\n\n\n## Metadata\n\n- **Last Updated**: 2025-11-11\n- **Review Status**: Comprehensive editorial review\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable",
  "properties": {
    "id": "stablecoin-related",
    "collapsed": "true",
    "- ontology": "true",
    "- is-subclass-of": "[[BlockchainTechnology]]",
    "- term-id": "20190",
    "- source-domain": "blockchain",
    "- status": "draft",
    "- public-access": "true",
    "- preferred-term": "Stablecoin",
    "- definition": "A cryptocurrency whose value is algorithmically or institutionally pegged to a reserve asset to maintain price stability, enabling reliable medium of exchange and store of value in virtual economies.",
    "- maturity": "mature",
    "- source": "[[ISO 24165]], [[IMF CBDC Notes]]",
    "- owl:class": "bc:Stablecoin",
    "- owl:physicality": "VirtualEntity",
    "- owl:role": "Object",
    "- owl:inferred-class": "mv:VirtualObject",
    "- owl:functional-syntax": "true",
    "- belongsToDomain": "[[BlockchainDomain]], [[TrustAndGovernanceDomain]]",
    "- implementedInLayer": "[[MiddlewareLayer]]",
    "- is-part-of": "[[Crypto Token]], [[Virtual Currency]], [[Digital Asset]]",
    "- requires": "[[Blockchain]], [[Smart Contract]], [[Collateral Reserves]], [[Price Oracle]]",
    "- depends-on": "[[Peg Mechanism]], [[Reserve Asset]], [[Stabilization Algorithm]]",
    "- enables": "[[Price Stability]], [[Cross-Border Transactions]], [[Virtual Commerce]], [[Value Transfer]]"
  },
  "backlinks": [
    "AI Model Card",
    "RGB and Client Side Validation",
    "Digital Twin of the Customer",
    "Central Bank Digital Currency (CBDC)",
    "Runes and Glyphs",
    "BC 0112 inflationary token",
    "Bitcoin",
    "AI Governance Principle"
  ],
  "wiki_links": [
    "Polygon",
    "Liquidity Pool",
    "Cross-Border Payments",
    "SEC",
    "Terra Luna",
    "Stabilization Algorithm",
    "Blockchain",
    "Value Transfer",
    "Virtual Commerce",
    "RGB Protocol",
    "Circle",
    "Cross-Border Transactions",
    "Ethereum",
    "Bitcoin",
    "Collateralization",
    "Centre Consortium",
    "Paxos",
    "DeFi",
    "TrustAndGovernanceDomain",
    "mv:VirtualObject",
    "MiCA",
    "Binance",
    "Lightning Network",
    "Bank of England",
    "Price Oracle",
    "Virtual Currency",
    "Crypto-Backed",
    "USDD",
    "FCA",
    "Smart Contract",
    "Avalanche",
    "MakerDAO",
    "Algorithmic Stablecoin",
    "Fiat Currency",
    "GENIUS Act",
    "MiddlewareLayer",
    "Price Stability",
    "Token Standard",
    "Digital Asset",
    "USDT",
    "Tron",
    "Crypto Token",
    "Curve Finance",
    "ISO 24165",
    "DAI",
    "Compound",
    "Peg Mechanism",
    "FRAX",
    "Aave",
    "BlockchainTechnology",
    "Reserve Asset",
    "USDC",
    "BUSD",
    "Tether",
    "Central Bank Digital Currency",
    "UST",
    "Payment System",
    "BlockchainDomain",
    "PayPal",
    "FATF",
    "ERC-20",
    "Remittances",
    "Collateral Reserves",
    "Fiat-Backed",
    "IMF CBDC Notes",
    "BSC"
  ],
  "ontology": {
    "term_id": "20190",
    "preferred_term": "Stablecoin",
    "definition": "A cryptocurrency whose value is algorithmically or institutionally pegged to a reserve asset to maintain price stability, enabling reliable medium of exchange and store of value in virtual economies.",
    "source_domain": "blockchain",
    "maturity_level": null,
    "authority_score": null
  }
}