{
  "title": "Taproot assets",
  "content": "- ### OntologyBlock\n  id:: taproot-assets-ontology\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: mv-276865951985\n\t- preferred-term:: Taproot assets\n\t- source-domain:: metaverse\n\t- status:: active\n\t- public-access:: true\n\t- definition:: A component of the metaverse ecosystem focusing on taproot assets.\n\t- maturity:: mature\n\t- authority-score:: 0.85\n\t- owl:class:: mv:TaprootAssets\n\t- owl:physicality:: ConceptualEntity\n\t- owl:role:: Concept\n\t- belongsToDomain:: [[MetaverseDomain]]\n\t- #### Relationships\n\t  id:: taproot-assets-relationships\n\t\t- enables:: [[ImmersiveExperience]], [[Presence]], [[SpatialComputing]]\n\t\t- requires:: [[DisplayTechnology]], [[TrackingSystem]], [[RenderingEngine]]\n\t\t- bridges-to:: [[HumanComputerInteraction]], [[ComputerVision]], [[Robotics]]\n\n\t- #### OWL Axioms\n\t  id:: taproot-assets-owl-axioms\n\t  collapsed:: true\n\t\t- ```clojure\n\t\t  Declaration(Class(mv:TaprootAssets))\n\n\t\t  # Classification\n\t\t  SubClassOf(mv:TaprootAssets mv:ConceptualEntity)\n\t\t  SubClassOf(mv:TaprootAssets mv:Concept)\n\n\t\t  # Domain classification\n\t\t  SubClassOf(mv:TaprootAssets\n\t\t    ObjectSomeValuesFrom(mv:belongsToDomain mv:MetaverseDomain)\n\t\t  )\n\n\t\t  # Annotations\n\t\t  AnnotationAssertion(rdfs:label mv:TaprootAssets \"Taproot assets\"@en)\n\t\t  AnnotationAssertion(rdfs:comment mv:TaprootAssets \"A component of the metaverse ecosystem focusing on taproot assets.\"@en)\n\t\t  AnnotationAssertion(dcterms:identifier mv:TaprootAssets \"mv-276865951985\"^^xsd:string)\n\t\t  ```\n\n- termID:: BTC-AI-0010\n\n- bitcoinSpecific:: true\n\n- qualityScore:: 0.96\n\n- category:: [[Bitcoin Protocol]], [[Layer 2]], [[Asset Issuance]], [[Lightning Network]]\n\n- relatedConcepts:: [[RGB Protocol]], [[L402 Protocol]], [[X402 Protocol]], [[AI Agent Economies]], [[Taproot Upgrade]]\n\n- lastUpdated:: 2025-11-14\n\n\n- ## Overview and Protocol Architecture\n\n\t- [[Taproot Assets Protocol]] (formerly known as Taro) is a revolutionary protocol developed by [[Lightning Labs]] that enables **asset issuance and transfer directly on the [[Bitcoin blockchain]]**, with seamless integration into the [[Lightning Network]] for instant, low-fee, and globally scalable transactions. The protocol fundamentally transforms Bitcoin from a single-asset network into a multi-asset platform while preserving Bitcoin's security model and decentralization principles.\n\n\t- The protocol leverages Bitcoin's [[Taproot upgrade]], which activated in November 2021, to embed asset metadata within Bitcoin UTXOs using advanced cryptographic techniques including [[Schnorr signatures]] and [[MAST]] (Merkelized Alternative Script Trees). This design allows multiple assets to coexist within single Bitcoin transactions while maintaining privacy and efficiency characteristics superior to previous Bitcoin asset protocols.\n\n\n- ## Technical Architecture and Data Structures\n\n\t- ### Asset Issuance Mechanism\n\n\t\t- Assets are issued on-chain using [[Taproot transactions]], with metadata embedded within Bitcoin [[UTXO]]s through a sophisticated commitment scheme. Each asset is uniquely identified by a 32-byte **asset ID** derived using the formula: `asset_id = sha256(genesis_outpoint || asset_tag || asset_meta)`, ensuring cryptographic uniqueness and preventing asset ID collisions across the entire Bitcoin blockchain.\n\n\t\t- The asset script utilizes a **[[sparse Merkle sum tree]]** to represent accounts and balances efficiently. Each leaf in this tree contains a [[TLV]] (type-length-value) encoded blob holding comprehensive asset information including asset version, current amount, ownership constraints, and complete transfer history traceable back to genesis.\n\n\t\t- Multiple distinct assets can be issued within a single Bitcoin transaction, with each asset maintaining its own independent asset script and Merkle tree structure. This design enables efficient batch issuance while minimizing on-chain footprint and transaction fees.\n\n\t\t- **Asset proofs** form the cryptographic foundation for validating issuance and transfers. Each proof contains the asset script and Merkle path for the recipient's account, enabling independent verification without requiring access to the entire asset history. All asset transactions must maintain an auditable lineage back to their genesis output, with proofs growing linearly with each on-chain transaction.\n\n\t\t- Asset witness data is stored off-chain in distributed repositories called **[[Universes]]**, which serve as decentralized asset registries. Validity is proven through cryptographic lineage verification and cross-checked via a gossip-based synchronization layer, ensuring asset integrity without blockchain bloat.\n\n\n\t- ### Data Structure Innovations\n\n\t\t- **[[Sparse Merkle Tree]]**: Enables efficient, privacy-preserving retrieval and updating of asset data, allowing participants to prove inclusion or non-inclusion of specific assets without revealing the entire tree structure. This design is critical for scalability as asset diversity increases.\n\n\t\t- **[[Merkle-Sum Tree]]**: Ensures cryptographic conservation of asset balances, making inflation mathematically impossible without detection. Every branch in the tree commits to the sum of all leaf values beneath it, enabling instant verification that no assets were created or destroyed during transfers.\n\n\t\t- **[[TLV Encoding]]**: Follows the same type-length-value structure used throughout the Lightning Network ecosystem, ensuring compatibility and allowing for forward-compatible protocol extensions without breaking existing implementations.\n\n\n\t- ### Security and Privacy Features\n\n\t\t- The protocol leverages [[Taproot]]'s privacy enhancements and [[Schnorr signatures]] for efficient, scalable, and private asset script execution. From an external observer's perspective, Taproot Asset transactions are indistinguishable from standard Bitcoin transactions, providing strong privacy guarantees.\n\n\t\t- Asset transfers and cryptographic proofs are only visible to directly involved parties, significantly enhancing transaction privacy compared to transparent blockchain asset protocols. This client-side validation model means that users verify asset ownership proofs locally, without broadcasting sensitive asset information to the entire network.\n\n\t\t- All assets and transactions ultimately inherit Bitcoin's proof-of-work security model, ensuring censorship resistance, immutability, and global accessibility without reliance on trusted third parties or federated consensus mechanisms [Updated 2025].\n\n\n- ## Lightning Network Integration and Off-Chain Transfers\n\n\t- ### Channel Architecture for Multi-Asset Support\n\n\t\t- Taproot Assets can be deposited into [[Lightning Network]] payment channels, enabling **off-chain, instant, and ultra-low-fee transfers** with the same finality guarantees as on-chain Bitcoin transactions. This integration represents a quantum leap in Bitcoin's capability to serve as infrastructure for high-frequency economic activity.\n\n\t\t- Asset transfers over Lightning are cryptographically private to channel participants and appear as standard Lightning payments to intermediate routing nodes. This property enables censorship-resistant asset transfers even when routing through nodes unaware they are facilitating asset movements.\n\n\t\t- The protocol supports **[[atomic swaps]]** between Bitcoin and Taproot Assets, allowing seamless conversion and routing across the Lightning Network infrastructure. When a direct route for a specific asset doesn't exist, the protocol can automatically convert the asset to BTC for routing purposes and atomically swap it back to the target asset at the destination, enabling universal asset connectivity.\n\n\t\t- Lightning channels can simultaneously hold both BTC and multiple Taproot Assets within a single UTXO commitment, dramatically optimizing capital efficiency and on-chain resource usage. This design eliminates the need for separate channels per asset type [Updated 2025].\n\n\n\t- ### Routing and Network Effects\n\n\t\t- Routing fees are paid to Lightning node operators in BTC, creating immediate economic incentives for the existing Lightning infrastructure to support Taproot Assets without requiring fundamental protocol changes. This alignment ensures rapid adoption potential across the existing network of over 15,000+ public Lightning nodes [Updated 2025].\n\n\t\t- The protocol enables **decentralized foreign exchange (FX)** functionality through multi-path payments and atomic swaps. AI agents and automated trading systems can optimize routing paths for cost, speed, and reliability across heterogeneous asset types, creating emergent price discovery mechanisms directly on Lightning.\n\n\t\t- As of 2025, Lightning Network capacity evolution has shifted from pure BTC channel growth to increasing sophistication in multi-asset channel deployment. The integration of [[Tether USDt]] and other stablecoins via Taproot Assets represents a fundamental expansion of Lightning's economic utility beyond Bitcoin-denominated value transfer [Updated 2025].\n\n\n- ## Use Cases and Ecosystem Applications\n\n\t- ### Stablecoins and Fiat-Denominated Assets\n\n\t\t- The issuance of dollar-pegged stablecoins like [[Tether USDt]] on Bitcoin via Taproot Assets enables AI agents, businesses, and individuals to transact in stable-value units while benefiting from Bitcoin's security and Lightning's speed. In January 2025, Tether officially announced USDt rollout over Lightning via Taproot Assets in partnership with Lightning Labs, marking a watershed moment for Bitcoin-native stablecoin adoption [Updated 2025].\n\n\t\t- This development allows [[AI agents]] to maintain stable-value treasury reserves, pay for computational resources in dollar-denominated terms, and engage in economic planning without exposure to Bitcoin's price volatility—critical capabilities for autonomous economic agents operating on extended time horizons.\n\n\n\t- ### NFTs and Digital Collectibles\n\n\t\t- Non-fungible tokens representing unique digital assets, artwork, gaming items, or real-world asset ownership claims can be issued as Taproot Assets with full Lightning Network transferability. This creates instant, global marketplaces for digital collectibles with settlement finality in seconds rather than the minutes or hours required for on-chain Bitcoin transactions.\n\n\n\t- ### Tokenized Securities and Financial Instruments\n\n\t\t- Stocks, bonds, commodities, and derivative financial instruments can be represented as Taproot Assets, enabling 24/7 global trading with Bitcoin-level security. Regulatory compliance can be enforced through programmable asset group keys and multi-signature custody arrangements built into the asset issuance parameters.\n\n\n\t- ### Service Credits and AI Agent Token Economies\n\n\t\t- AI agents can hold and transfer **tokenized AI service credits** (such as API access tokens, compute credits, or inference quota) as Taproot Assets. This enables automated, auditable, and permissionless access to AI services with programmable spending logic enforced cryptographically.\n\n\t\t- Machine learning model providers can issue consumption-based credits as Taproot Assets, allowing AI agents to autonomously purchase, trade, and optimize resource allocation across competing service providers without human intermediation [Updated 2025].\n\n\n- ## Bitcoin-AI Integration and Autonomous Economic Agents\n\n\t- ### AI Agents as Asset Owners\n\n\t\t- [[AI agents]] can directly own and control Taproot Assets using cryptographic private keys, enabling autonomous custody without trusted intermediaries. Programmable spending conditions can be embedded in asset scripts, allowing AI agents to implement sophisticated treasury management strategies, automated rebalancing, and risk management protocols.\n\n\t\t- The deterministic nature of Bitcoin script combined with Taproot's flexibility enables AI agents to prove their asset ownership and spending authority to counterparties without revealing sensitive strategy information or exposing private keys to network observation.\n\n\n\t- ### Autonomous Trading and Market Making\n\n\t\t- AI agents can engage in **autonomous trading** of Taproot Assets including stablecoins and service credits using Lightning's decentralized RFQ (Request for Quote) protocol. This system supports atomic swaps with time-limited price quotes between arbitrary asset pairs and BTC, enabling sophisticated algorithmic trading strategies.\n\n\t\t- As of 2025, platforms like [[Voltage]] and [[Amboss]] have launched yield products for Taproot Assets, allowing AI agents to optimize treasury management by providing liquidity to asset channels in exchange for yield generation. These emerging DeFi primitives operate entirely on Bitcoin's security model without requiring trust in external validators or bridge operators [Updated 2025].\n\n\n\t- ### Integration with L402 and X402 Payment Protocols\n\n\t\t- [[L402 Protocol]] is a Lightning-native authentication and payment protocol enabling pay-per-request API access, ideally suited for AI agent-to-agent and agent-to-service micropayments. AI agents can use L402 to pay for or monetize AI inference, training data access, or compute resources in real-time with settlement finality in milliseconds.\n\n\t\t- With Taproot Assets integration, L402 expands beyond BTC-denominated payments to support dollar-denominated stablecoins or custom service credit tokens. This eliminates exchange rate risk for AI agents operating on fiat-denominated business models while preserving Bitcoin's censorship resistance and global accessibility.\n\n\t\t- [[X402 Protocol]] extends L402's capabilities to support cross-chain and cross-asset payment flows, allowing AI agents to transact seamlessly across Bitcoin mainchain, Lightning Network, and potentially other compatible settlement layers using Taproot Assets as the unifying settlement and authentication token.\n\n\t\t- As AI agent economies mature through 2025 and beyond, L402/X402 combined with Taproot Assets create the foundational infrastructure for autonomous machine-to-machine commerce operating at speeds and scales impossible for human-mediated payment systems [Updated 2025].\n\n\n- ## RGB Protocol Relationship and Smart Contract Capabilities\n\n\t- ### Architectural Similarities and Differences\n\n\t\t- [[RGB Protocol]] is a complementary smart contract and asset issuance system for Bitcoin and Lightning developed by the [[LNP/BP Association]], [[Maxim Orlovsky]], and [[Bitfinex]]. Like Taproot Assets, RGB uses client-side validation and commits asset state to Bitcoin UTXOs, typically using Taproot outputs or OP_RETURN commitments.\n\n\t\t- Both protocols share philosophical alignment on Bitcoin-native asset issuance without requiring Bitcoin consensus changes, off-chain witness data storage for scalability, and Lightning Network integration for instant transfers. However, RGB emphasizes more complex smart contract capabilities while Taproot Assets prioritizes Lightning routing simplicity and developer accessibility.\n\n\t\t- Taproot Assets was architecturally inspired by RGB and maintains conceptual compatibility, though the protocols have evolved different technical approaches to asset representation and validation logic. Some analysts view them as complementary rather than competing, with potential for future interoperability bridges [Updated 2025].\n\n\n\t- ### Smart Contract and Programmability\n\n\t\t- RGB supports complex smart contracts executed entirely client-side, with each wallet validating only contracts relevant to its user. This design enables sophisticated programmable logic including conditional payments, escrow mechanisms, decentralized governance systems, and algorithmic market makers (like [[KaleidoSwap]]) entirely on Bitcoin's security foundation.\n\n\t\t- AI agents can leverage RGB's advanced smart contract capabilities for implementing complex autonomous behaviors: conditional execution based on oracle data, multi-party computation protocols, or sophisticated game-theoretic mechanisms requiring programmable state machines beyond simple asset transfers.\n\n\t\t- The combination of Taproot Assets' Lightning-optimized routing with RGB's advanced contract capabilities may emerge as a powerful architectural pattern: using Taproot Assets for high-frequency payment flows and RGB for complex state transitions requiring richer programmability [Updated 2025].\n\n\n- ## Current Adoption Status and Ecosystem Development (2025)\n\n\t- ### Mainnet Deployments and Production Usage\n\n\t\t- Taproot Assets transitioned from testnet to early mainnet deployments following its v0.2 release in 2023, with significant production adoption accelerating throughout 2024 and 2025. The protocol is now integrated into critical Bitcoin infrastructure including major Lightning implementations and enterprise-grade node management platforms [Updated 2025].\n\n\t\t- Lightning Labs released **Taproot Assets v0.6** in June 2025, introducing major enhancements including asset group keys for simplified management of related asset tranches, improved stablecoin support, and optimizations for decentralized routing across multi-asset channels [Updated 2025].\n\n\t\t- Developer interest and ecosystem experimentation have grown substantially, with increasing numbers of wallet implementations, asset issuance platforms, and Lightning service providers announcing Taproot Assets support throughout 2025 [Updated 2025].\n\n\n\t- ### Key Implementation Projects\n\n\t\t- **[[Joltz Wallet]]**: A notable early wallet implementation supporting full Taproot Assets functionality, enabling users to issue, receive, and transfer assets on both Bitcoin mainchain and Lightning Network. Joltz demonstrates consumer-ready user experiences for multi-asset Bitcoin wallets.\n\n\t\t- **[[Lightning Terminal]]**: Lightning Labs' flagship node management platform integrating Taproot Assets with advanced channel management, liquidity optimization, and routing analytics specifically designed for asset-enabled channels.\n\n\t\t- **[[Universes]]**: The distributed asset registry system serving as the off-chain witness data layer. Multiple Universe servers operated by independent entities ensure asset data availability and verification without centralized control points.\n\n\t\t- **[[Voltage]] and [[Amboss]]**: In November 2025, these leading Lightning infrastructure providers announced partnerships to bring yield generation and sophisticated liquidity management to Bitcoin and stablecoin payments using Taproot Assets. This collaboration enables in-flight atomic exchanges between Bitcoin and stablecoins within payment flows, dramatically expanding Lightning's economic utility [Updated 2025].\n\n\n\t- ### Network Statistics and Growth Metrics\n\n\t\t- While Lightning Network total BTC capacity declined approximately 20% in 2025 (from ~5,000 BTC to ~4,000 BTC), this metric obscures the underlying structural evolution toward multi-asset channels and more efficient capital allocation. The introduction of stablecoin and Taproot Asset channels means Lightning's economic capacity in dollar terms may have actually increased despite declining BTC-denominated measurements [Updated 2025].\n\n\t\t- Stablecoin and asset issuance integration via Taproot Assets is projected to significantly expand Lightning's use cases beyond BTC-denominated payments, potentially catalyzing adoption in markets where dollar-stable value transfer is essential for commercial viability [Updated 2025].\n\n\n- ## Protocol Advantages and Design Philosophy\n\n\t- ### Native Bitcoin Asset Issuance\n\n\t\t- Taproot Assets enables native asset issuance directly on Bitcoin's mainchain with Taproot-level privacy, security, and operational characteristics. Unlike bridged assets or wrapped tokens, Taproot Assets inherit Bitcoin's full security model without introducing additional trust assumptions or federated validator sets.\n\n\t\t- The protocol's design philosophy prioritizes Bitcoin-nativeness: every asset state transition ultimately anchors to Bitcoin's proof-of-work consensus, ensuring that asset security cannot degrade below Bitcoin's baseline even as asset complexity increases.\n\n\n\t- ### Lightning-Fast, Low-Fee Transfers\n\n\t\t- Integration with Lightning Network infrastructure enables sub-second payment finality with fees typically measured in fractions of a cent, regardless of asset type. This performance profile makes Taproot Assets competitive with centralized payment processors while maintaining Bitcoin's censorship resistance and global accessibility.\n\n\t\t- The ability to route payments across heterogeneous asset types using atomic swaps creates emergent liquidity networks where asset holders can transact even without direct counterparties, leveraging the existing Lightning Network's pathfinding and routing infrastructure.\n\n\n\t- ### Scalability Through Efficient Data Structures\n\n\t\t- Sparse Merkle Trees and Merkle-Sum Trees enable scalable asset management that can theoretically support millions of distinct asset types without degrading Bitcoin's base layer performance. The client-side validation model means verification costs remain constant for individual users regardless of global asset diversity.\n\n\t\t- Off-chain witness data storage in Universes ensures that Bitcoin's blockchain does not become bloated with asset-specific metadata, preserving Bitcoin's long-term sustainability as a decentralized settlement layer accessible to node operators with modest hardware resources.\n\n\n- ## Future Directions and AI Integration Opportunities\n\n\t- ### Programmable Asset Groups and Dynamic Issuance\n\n\t\t- Taproot Assets v0.6's introduction of asset group keys enables sophisticated issuance strategies including time-released token vesting, algorithmic supply adjustment, and multi-tranche securities with different rights or restrictions—all enforced cryptographically without smart contract platforms.\n\n\t\t- AI agents managing complex token economies can leverage these capabilities to implement autonomous central banking policies, algorithmic stablecoin management, or dynamic resource allocation across competing service markets.\n\n\n\t- ### Cross-Protocol Integration and Interoperability\n\n\t\t- Potential future integration between Taproot Assets and RGB Protocol could create unified asset ecosystems where simple transfers use Taproot Assets' Lightning-optimized routing while complex smart contract interactions leverage RGB's advanced programmability. This architectural layering mirrors successful design patterns in internet protocols.\n\n\t\t- Bridges to other Bitcoin Layer 2 systems including [[Liquid Network]], [[Lightning Network]] [[submarine swaps]], and emerging [[Bitcoin sidechains]] could expand Taproot Assets' interoperability footprint while maintaining Bitcoin mainchain as the ultimate security anchor.\n\n\n\t- ### AI-Driven Liquidity and Market Making\n\n\t\t- As AI agents increasingly participate in Taproot Asset markets, algorithmic market making, arbitrage, and liquidity provision will likely emerge as autonomous economic behaviors. Machine learning models can optimize routing paths, predict asset demand patterns, and dynamically adjust liquidity allocations across Lightning channels to maximize yield or minimize risk.\n\n\t\t- The combination of high-frequency Lightning payments, programmable Taproot Assets, and AI-driven decision-making could create the first truly autonomous, Bitcoin-native financial markets operating without human intervention at speeds limited only by network latency and cryptographic verification [Updated 2025].\n\n\n- ## Related Protocols and Ecosystem Technologies\n\n\t- [[Bitcoin Protocol]]\n\n\t- [[Lightning Network]]\n\n\t- [[Taproot Upgrade]]\n\n\t- [[Schnorr Signatures]]\n\n\t- [[MAST]]\n\n\t- [[RGB Protocol]]\n\n\t- [[L402 Protocol]]\n\n\t- [[X402 Protocol]]\n\n\t- [[Atomic Swaps]]\n\n\t- [[Sparse Merkle Tree]]\n\n\t- [[Merkle-Sum Tree]]\n\n\t- [[TLV Encoding]]\n\n\t- [[Client-Side Validation]]\n\n\t- [[UTXO Model]]\n\n\t- [[Submarine Swaps]]\n\n\t- [[Liquid Network]]\n\n\t- [[AI Agent Economies]]\n\n\t- [[Machine-to-Machine Payments]]\n\n\t- [[Programmable Assets]]\n\n\t- [[Stablecoins on Bitcoin]]\n\n\t- [[Bitcoin Smart Contracts]]\n\n\t- [[Decentralized Exchange]]\n\n\t- [[Tether USDt]]\n\n\t- [[Lightning Labs]]\n\n\t- [[Joltz Wallet]]\n\n\t- [[Lightning Terminal]]\n\n\t- [[Voltage]]\n\n\t- [[Amboss]]\n\n\t- [[KaleidoSwap]]\n\n\t- [[LNP/BP Association]]\n\n\n- \n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Metaverse platforms continue to evolve with focus on interoperability and open standards\n  - Web3 integration accelerating with decentralised identity and asset ownership\n  - Enterprise adoption growing in virtual collaboration, training, and digital twins\n  - UK companies increasingly active in metaverse development and immersive technologies\n\n- Technical capabilities\n  - Real-time rendering at photorealistic quality levels\n  - Low-latency networking enabling seamless multi-user experiences\n  - AI-driven content generation and procedural world building\n  - Spatial audio and haptics enhancing immersion\n\n- UK and North England context\n  - Manchester: Digital Innovation Factory supports metaverse startups and research\n  - Leeds: Holovis leads in immersive experiences for entertainment and training\n  - Newcastle: University research in spatial computing and interactive systems\n  - Sheffield: Advanced manufacturing using digital twin technology\n\n- Standards and frameworks\n  - Metaverse Standards Forum driving interoperability protocols\n  - WebXR enabling browser-based immersive experiences\n  - glTF and USD for 3D asset interchange\n  - Open Metaverse Interoperability Group defining cross-platform standards\n\n## Metadata\n\n- **Last Updated**: 2025-11-16\n- **Review Status**: Automated remediation with 2025 context\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable\n\n\n## References and Resources\n\n\t- [Taproot Assets Protocol Documentation - Lightning Labs](https://docs.lightning.engineering/the-lightning-network/taproot-assets)\n\n\t- [Taproot Assets GitHub Repository](https://github.com/lightninglabs/taproot-assets)\n\n\t- [RGB Protocol Documentation](https://docs.rgb.info/)\n\n\t- [Bitcoin Magazine: Taproot Assets - Bitcoin as a Medium of Exchange](https://bitcoinmagazine.com/print/taproot-assets-bitcoin-as-a-medium-of-exchange)\n\n\t- [Lightning Network Usage Statistics 2025](https://coinlaw.io/bitcoin-lightning-network-usage-statistics/)\n\n\t- [Voltage and Amboss Partnership Announcement (November 2025)](https://www.prnewswire.com/news-releases/amboss-and-voltage-partner-to-bring-yield-to-bitcoin-and-stablecoin-payments-302614524.html)\n\n\t- [awesome-taproot-assets Repository](https://github.com/22388o/awesome-taproot-assets)\n\n\t- Trust Machines: A Walkthrough of Lightning Labs' Taproot Assets Protocol\n\n\t- Samara AG: What is the Taproot Assets Protocol (TAP)? A Beginner's Guide\n\n\t- Atlas21: RGB vs Taproot Assets - Protocols Compared\n\n\n- ## Original Source Links\n\n\t- [Joltz Wallet](https://wallet.joltz.app/)\n\n\t- [awesome-taproot-assets/README.md at main · 22388o/awesome-taproot-assets](https://github.com/22388o/awesome-taproot-assets/blob/main/README.md)\n\n\t- [Pairing Phrase - Lightning Terminal](https://terminal.lightning.engineering/connect/pair/)\n\n\t- [Lightning Terminal](https://192.168.0.20:8443/)",
  "properties": {
    "id": "taproot-assets-owl-axioms",
    "collapsed": "true",
    "- ontology": "true",
    "- term-id": "mv-276865951985",
    "- preferred-term": "Taproot assets",
    "- source-domain": "metaverse",
    "- status": "active",
    "- public-access": "true",
    "- definition": "A component of the metaverse ecosystem focusing on taproot assets.",
    "- maturity": "mature",
    "- authority-score": "0.85",
    "- owl:class": "mv:TaprootAssets",
    "- owl:physicality": "ConceptualEntity",
    "- owl:role": "Concept",
    "- belongsToDomain": "[[MetaverseDomain]]",
    "- enables": "[[ImmersiveExperience]], [[Presence]], [[SpatialComputing]]",
    "- requires": "[[DisplayTechnology]], [[TrackingSystem]], [[RenderingEngine]]",
    "- bridges-to": "[[HumanComputerInteraction]], [[ComputerVision]], [[Robotics]]",
    "- termID": "BTC-AI-0010",
    "- bitcoinSpecific": "true",
    "- qualityScore": "0.96",
    "- category": "[[Bitcoin Protocol]], [[Layer 2]], [[Asset Issuance]], [[Lightning Network]]",
    "- relatedConcepts": "[[RGB Protocol]], [[L402 Protocol]], [[X402 Protocol]], [[AI Agent Economies]], [[Taproot Upgrade]]",
    "- lastUpdated": "2025-11-14"
  },
  "backlinks": [
    "Digital Objects"
  ],
  "wiki_links": [
    "Maxim Orlovsky",
    "submarine swaps",
    "Stablecoins on Bitcoin",
    "DisplayTechnology",
    "RenderingEngine",
    "Voltage",
    "MAST",
    "Client-Side Validation",
    "HumanComputerInteraction",
    "Merkle-Sum Tree",
    "AI agents",
    "SpatialComputing",
    "RGB Protocol",
    "Decentralized Exchange",
    "Taproot upgrade",
    "TLV",
    "sparse Merkle sum tree",
    "ImmersiveExperience",
    "LNP/BP Association",
    "Universes",
    "X402 Protocol",
    "TrackingSystem",
    "Taproot",
    "Taproot transactions",
    "AI Agent Economies",
    "Taproot Upgrade",
    "Lightning Labs",
    "Bitcoin blockchain",
    "Bitcoin Protocol",
    "Amboss",
    "Presence",
    "KaleidoSwap",
    "MetaverseDomain",
    "Asset Issuance",
    "Schnorr Signatures",
    "Sparse Merkle Tree",
    "Lightning Terminal",
    "Taproot Assets Protocol",
    "atomic swaps",
    "Atomic Swaps",
    "ComputerVision",
    "Lightning Network",
    "Layer 2",
    "Joltz Wallet",
    "TLV Encoding",
    "L402 Protocol",
    "UTXO",
    "Tether USDt",
    "Robotics",
    "Bitcoin sidechains",
    "UTXO Model",
    "Bitfinex",
    "Liquid Network",
    "Bitcoin Smart Contracts",
    "Submarine Swaps",
    "Machine-to-Machine Payments",
    "Programmable Assets",
    "Schnorr signatures"
  ],
  "ontology": {
    "term_id": "mv-276865951985",
    "preferred_term": "Taproot assets",
    "definition": "A component of the metaverse ecosystem focusing on taproot assets.",
    "source_domain": "metaverse",
    "maturity_level": null,
    "authority_score": 0.85
  }
}