{
  "title": "Voting Systems",
  "content": "- ### OntologyBlock\n  id:: bc-0495-voting-systems-ontology\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: BC-0495\n\t- preferred-term:: Voting Systems\n\t- source-domain:: blockchain\n\t- status:: complete\n    - public-access:: true\n\t- authority-score:: 0.82\n\t- definition:: Blockchain-based electoral systems employing cryptographic verification, end-to-end verifiability, and distributed ledger technology to enable secure voting whilst facing critical security challenges identified by MIT research showing vulnerabilities allowing vote alteration, academic consensus of \"nearly universal\" agreement that no technology can adequately secure online public elections, and real-world implementations spanning Voatz (80,000+ votes across 50+ elections), Estonia (50%+ votes cast online), and Moscow (65,000 voters) demonstrating both potential cost reductions from $7-25 to under $0.50 per vote and significant security concerns.\n\t- maturity:: draft\n\t- owl:class:: bc:VotingSystems\n\t- owl:physicality:: ConceptualEntity\n\t- owl:role:: Concept\n\t- belongsToDomain:: [[BlockchainDomain]]\n\t- blockchainRelevance:: High\n\t- lastValidated:: 2025-11-14\n\n\n## Academic Context\n\n- Brief contextual overview\n  - Blockchain-based voting systems leverage cryptographic verification, end-to-end verifiability, and distributed ledger technology to address longstanding concerns about electoral integrity, transparency, and accessibility.\n  - The core academic premise is that decentralisation and cryptographic security can mitigate risks of vote tampering, coercion, and centralised control, but these benefits are counterbalanced by persistent technical and social challenges.\n\n- Key developments and current state\n  - While blockchain voting has been piloted in several jurisdictions globally, academic consensus remains cautious: most researchers agree that no existing technology can fully secure online public elections against all forms of attack, especially when voter devices are untrusted.\n  - The field continues to evolve, with ongoing research into hybrid models, zero-knowledge proofs, and layered security architectures.\n\n- Academic foundations\n  - Foundational work includes studies on cryptographic voting protocols, distributed consensus mechanisms, and formal verification of election systems.\n  - Notable frameworks include the Helios voting system, the Prêt à Voter protocol, and more recent blockchain-specific models such as VoteBox and VoteChain.\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Blockchain voting platforms such as Voatz and Scytl have been used in limited trials, primarily for absentee and overseas voters, but large-scale public elections remain rare.\n  - Estonia continues to operate its Internet voting system (i-Voting), which incorporates blockchain for vote logging, though the system is not fully decentralised and relies on national identity infrastructure.\n  - Moscow and other Russian cities have conducted small-scale blockchain voting pilots, but these have faced criticism over transparency and auditability.\n\n- Notable organisations and platforms\n  - Voatz: Deployed in various US states for military and overseas voters, with reported use in over 50 elections and more than 80,000 votes cast.\n  - Scytl: Provides e-voting solutions in Europe, including blockchain-based components for vote logging and audit trails.\n  - Estonia’s i-Voting: Over 50% of votes in recent national elections have been cast online, with blockchain used for vote storage and integrity checks.\n\n- UK and North England examples where relevant\n  - The UK has not adopted blockchain voting for national or local elections, but several pilot projects and academic studies have explored its feasibility.\n  - In North England, universities in Manchester, Leeds, Newcastle, and Sheffield have participated in research collaborations on secure e-voting, often in partnership with government agencies and tech firms.\n  - Local councils in Greater Manchester and West Yorkshire have trialled digital voting for internal elections and community consultations, though these have not yet incorporated blockchain technology.\n\n- Technical capabilities and limitations\n  - Blockchain voting can provide strong audit trails, tamper-evident logs, and decentralised verification, but it does not solve all security problems.\n  - Key limitations include the vulnerability of voter devices to malware, the risk of denial-of-service attacks, and the difficulty of ensuring voter privacy and coercion resistance.\n  - Cost reductions have been observed in some pilot projects, with estimates suggesting per-vote costs can drop from $7–25 to under $0.50, but these savings are context-dependent and may not scale to large public elections.\n\n- Standards and frameworks\n  - International standards such as ISO/IEC 27001 and NIST guidelines provide general security frameworks for e-voting systems.\n  - The European Union has developed specific guidelines for blockchain-based voting, emphasising transparency, auditability, and voter verifiability.\n\n## Research & Literature\n\n- Key academic papers and sources\n  - Park, S., Specter, M., Narula, N., Rivest, R. L. (2021). Going from bad to worse: from Internet voting to blockchain voting. Journal of Cybersecurity, 7(1), tyaa025. https://doi.org/10.1093/cybsec/tyaa025\n  - Shaikh, A., Adhikari, N., Nazir, A., Shah, A. S., Baig, S., Al Shihi, H. (2025). Blockchain-enhanced electoral integrity: a robust model for secure voting. F1000Research, 14, 223. https://doi.org/10.12688/f1000research.160087.3\n  - Jefferson, D. (2023). The Myth of “Secure” Blockchain Voting. U.S. Vote Foundation. https://www.usvotefoundation.org/blockchain-voting-is-not-a-security-strategy\n  - CoinLaw. (2025). Blockchain in Voting Systems Statistics 2025. https://coinlaw.io/blockchain-in-voting-systems-statistics/\n  - ACM Digital Library. (2025). A Comprehensive Analysis of Blockchain-Based Voting Systems. https://dl.acm.org/doi/10.1145/3723178.3723275\n  - SSRN. (2025). Blockchain-Based E-Voting Systems: A Systematic Literature Review. https://papers.ssrn.com/sol3/papers.cfm?abstract_id=5370817\n\n- Ongoing research directions\n  - Hybrid models combining blockchain with traditional paper ballots\n  - Zero-knowledge proofs for voter privacy\n  - Layer 2 solutions for scalability and performance\n  - Threat modeling and real-world stress-testing of blockchain voting systems\n\n## UK Context\n\n- British contributions and implementations\n  - The UK has been active in research on secure e-voting, with contributions from universities, government agencies, and independent think tanks.\n  - The National Cyber Security Centre (NCSC) has published guidance on the risks and benefits of blockchain voting, emphasising the need for rigorous security testing and public scrutiny.\n\n- North England innovation hubs (if relevant)\n  - Universities in Manchester, Leeds, Newcastle, and Sheffield have established research groups focused on digital democracy and secure voting.\n  - Collaborative projects with local councils and tech firms have explored the use of blockchain for internal elections and community consultations.\n\n- Regional case studies\n  - Greater Manchester Council has trialled digital voting for internal elections, with plans to expand to community consultations.\n  - West Yorkshire Combined Authority has explored the use of blockchain for secure data sharing and audit trails in public services.\n\n## Future Directions\n\n- Emerging trends and developments\n  - Increased use of hybrid models combining blockchain with traditional paper ballots\n  - Greater emphasis on voter privacy and coercion resistance\n  - Development of international standards and best practices for blockchain voting\n\n- Anticipated challenges\n  - Ensuring the security of voter devices\n  - Mitigating the risk of denial-of-service attacks\n  - Building public trust in new voting technologies\n\n- Research priorities\n  - Formal verification of blockchain voting protocols\n  - Real-world stress-testing and threat modeling\n  - Development of user-friendly interfaces for secure voting\n\n## References\n\n1. Park, S., Specter, M., Narula, N., Rivest, R. L. (2021). Going from bad to worse: from Internet voting to blockchain voting. Journal of Cybersecurity, 7(1), tyaa025. https://doi.org/10.1093/cybsec/tyaa025\n2. Shaikh, A., Adhikari, N., Nazir, A., Shah, A. S., Baig, S., Al Shihi, H. (2025). Blockchain-enhanced electoral integrity: a robust model for secure voting. F1000Research, 14, 223. https://doi.org/10.12688/f1000research.160087.3\n3. Jefferson, D. (2023). The Myth of “Secure” Blockchain Voting. U.S. Vote Foundation. https://www.usvotefoundation.org/blockchain-voting-is-not-a-security-strategy\n4. CoinLaw. (2025). Blockchain in Voting Systems Statistics 2025. https://coinlaw.io/blockchain-in-voting-systems-statistics/\n5. ACM Digital Library. (2025). A Comprehensive Analysis of Blockchain-Based Voting Systems. https://dl.acm.org/doi/10.1145/3723178.3723275\n6. SSRN. (2025). Blockchain-Based E-Voting Systems: A Systematic Literature Review. https://papers.ssrn.com/sol3/papers.cfm?abstract_id=5370817\n\n\n## Metadata\n\n\n- **Migration Status**: Ontology block enriched on 2025-11-12\n- **Last Updated**: 2025-11-12\n- **Review Status**: Comprehensive editorial review\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable",
  "properties": {
    "id": "bc-0495-voting-systems-ontology",
    "collapsed": "true",
    "- ontology": "true",
    "- term-id": "BC-0495",
    "- preferred-term": "Voting Systems",
    "- source-domain": "blockchain",
    "- status": "complete",
    "- public-access": "true",
    "- authority-score": "0.82",
    "- definition": "Blockchain-based electoral systems employing cryptographic verification, end-to-end verifiability, and distributed ledger technology to enable secure voting whilst facing critical security challenges identified by MIT research showing vulnerabilities allowing vote alteration, academic consensus of \"nearly universal\" agreement that no technology can adequately secure online public elections, and real-world implementations spanning Voatz (80,000+ votes across 50+ elections), Estonia (50%+ votes cast online), and Moscow (65,000 voters) demonstrating both potential cost reductions from $7-25 to under $0.50 per vote and significant security concerns.",
    "- maturity": "draft",
    "- owl:class": "bc:VotingSystems",
    "- owl:physicality": "ConceptualEntity",
    "- owl:role": "Concept",
    "- belongsToDomain": "[[BlockchainDomain]]",
    "- blockchainRelevance": "High",
    "- lastValidated": "2025-11-14"
  },
  "backlinks": [
    "Governance Token",
    "Decentralized Autonomous Organization (DAO)"
  ],
  "wiki_links": [
    "BlockchainDomain"
  ],
  "ontology": {
    "term_id": "BC-0495",
    "preferred_term": "Voting Systems",
    "definition": "Blockchain-based electoral systems employing cryptographic verification, end-to-end verifiability, and distributed ledger technology to enable secure voting whilst facing critical security challenges identified by MIT research showing vulnerabilities allowing vote alteration, academic consensus of \"nearly universal\" agreement that no technology can adequately secure online public elections, and real-world implementations spanning Voatz (80,000+ votes across 50+ elections), Estonia (50%+ votes cast online), and Moscow (65,000 voters) demonstrating both potential cost reductions from $7-25 to under $0.50 per vote and significant security concerns.",
    "source_domain": "blockchain",
    "maturity_level": null,
    "authority_score": 0.82
  }
}