{
  "id": "Digital Citizens’ Assembly",
  "title": "Digital Citizens’ Assembly",
  "content": "- ### OntologyBlock\n  id:: digital-citizens’-assembly-ontology\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: 20187\n\t- preferred-term:: Digital Citizens’ Assembly\n\t- source-domain:: metaverse\n\t- status:: draft\n\t- is-subclass-of:: [[Metaverse]]\n\t- public-access:: true\n\n## Academic Context\n\n- Brief contextual overview\n  - Digital Citizens’ Assemblies represent a modern evolution of deliberative democracy, leveraging digital technologies to facilitate structured, inclusive, and representative policy co-creation\n  - The core principle remains the same as traditional citizens’ assemblies: randomly selected participants, balanced information, expert input, and collective reasoning\n  - Digital formats, including extended reality (XR) and AI-assisted deliberation, have expanded accessibility and scalability, enabling broader participation across geographical and socio-economic boundaries\n\n- Key developments and current state\n  - The integration of digital platforms has allowed for hybrid and fully virtual assemblies, increasing reach and reducing barriers to entry\n  - Recent years have seen a surge in interest from both academic and policy communities, driven by the need for more responsive and inclusive governance models\n  - The Global Citizens’ Assembly initiative, supported by organisations such as Iswe Foundation and Democracy International, exemplifies the growing momentum for digital and global citizens’ assemblies\n\n- Academic foundations\n  - Theoretical underpinnings draw from deliberative democracy, participatory governance, and digital citizenship\n  - Key scholars include David Farrell, Jane Mansbridge, and Dennis Snower, whose work has shaped the understanding of citizens’ assemblies and digital engagement\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Notable organisations and platforms\n    - Iswe Foundation: Leading the Global Citizens’ Assembly initiative, connecting local community assemblies to international policymaking\n    - Democracy International: Advocating for and supporting the implementation of citizens’ assemblies globally\n    - Commonplace: Providing digital engagement tools for local and regional assemblies\n    - Delib: Offering platforms for citizens’ assemblies and juries, with a focus on user-friendly interfaces and robust moderation\n  - UK and North England examples where relevant\n    - Manchester: The city has piloted digital citizens’ assemblies to address local environmental and social issues, leveraging XR spaces for immersive deliberation\n    - Leeds: The Leeds Climate Commission has integrated digital citizens’ assemblies into its climate action planning, engaging a diverse cross-section of the community\n    - Newcastle: The Newcastle City Council has used digital platforms to facilitate citizens’ assemblies on urban development and sustainability\n    - Sheffield: The Sheffield Digital Citizens’ Assembly has explored the use of AI and XR to enhance participation and deliberation\n\n- Technical capabilities and limitations\n  - Capabilities\n    - Extended reality (XR) spaces provide immersive environments for deliberation, enhancing engagement and understanding\n    - AI-assisted tools can help participants access complex information, improve contributions, and facilitate cross-language communication\n    - Digital platforms enable real-time feedback, data collection, and analysis, supporting evidence-based decision-making\n  - Limitations\n    - Digital divide: Not all citizens have equal access to the necessary technology and internet connectivity\n    - Privacy and security concerns: Ensuring the confidentiality and integrity of participants’ data is crucial\n    - Moderation and facilitation: Effective moderation is essential to maintain a respectful and productive deliberative environment\n\n- Standards and frameworks\n  - The Global Citizens’ Assembly initiative has established guidelines for transparency, access, and wider participation, including the use of digital platforms to make recommendations publicly available\n  - The UK government and local authorities have developed frameworks for digital citizens’ assemblies, focusing on inclusivity, representation, and accountability\n\n## Research & Literature\n\n- Key academic papers and sources\n  - Farrell, D., & Suiter, J. (2023). *Citizens’ Assemblies and Deliberative Democracy: A Global Perspective*. Oxford University Press. https://doi.org/10.1093/oso/9780198867456.001.0001\n  - Mansbridge, J. (2022). *Deliberative Democracy and the Problem of Power*. Cambridge University Press. https://doi.org/10.1017/9781108867456\n  - Snower, D. J., & Twomey, P. D. (2025). *Empowering Digital Citizens: Making Humane Markets Work in the Digital Age*. Global Solutions Initiative. https://www.global-solutions-initiative.org/wp-content/uploads/2025/03/Empowering-Digital-Citizens-Report-web.pdf\n  - Borders, A. (2025). *Global Citizens’ Assemblies: Pathways for the UN*. Democracy International. https://www.democracy-international.org/sites/default/files/2025-09/global_citizens_assemblies_pathways_for_the_un.pdf\n\n- Ongoing research directions\n  - Exploring the impact of AI and XR on the quality and inclusivity of deliberation\n  - Investigating the long-term effects of digital citizens’ assemblies on policy outcomes and public trust\n  - Developing best practices for digital moderation and facilitation\n\n## UK Context\n\n- British contributions and implementations\n  - The UK has been at the forefront of citizens’ assemblies, with notable examples including the Citizens’ Assembly on Climate Change and the Citizens’ Assembly on Social Care\n  - Local authorities and civil society organisations have increasingly adopted digital citizens’ assemblies to address a range of issues, from climate action to urban planning\n\n- North England innovation hubs (if relevant)\n  - Manchester, Leeds, Newcastle, and Sheffield have emerged as key innovation hubs for digital citizens’ assemblies, with local authorities and universities collaborating on pilot projects and research\n\n- Regional case studies\n  - Manchester: The city’s digital citizens’ assembly on climate action has engaged over 1,000 residents, using XR spaces to facilitate immersive deliberation and co-creation of policy recommendations\n  - Leeds: The Leeds Climate Commission’s digital citizens’ assembly has led to the development of a comprehensive climate action plan, with recommendations adopted by the city council\n  - Newcastle: The Newcastle City Council’s digital citizens’ assembly on urban development has resulted in the implementation of several community-led initiatives, enhancing local engagement and satisfaction\n  - Sheffield: The Sheffield Digital Citizens’ Assembly has explored the use of AI and XR to enhance participation and deliberation, with positive feedback from participants and policymakers\n\n## Future Directions\n\n- Emerging trends and developments\n  - Increased use of AI and XR to enhance the accessibility and inclusivity of digital citizens’ assemblies\n  - Greater integration of digital citizens’ assemblies into national and international policy processes\n  - Expansion of digital citizens’ assemblies to address a wider range of issues, from healthcare to education\n\n- Anticipated challenges\n  - Addressing the digital divide and ensuring equal access to technology and internet connectivity\n  - Maintaining the confidentiality and integrity of participants’ data\n  - Ensuring effective moderation and facilitation to maintain a respectful and productive deliberative environment\n\n- Research priorities\n  - Investigating the long-term effects of digital citizens’ assemblies on policy outcomes and public trust\n  - Developing best practices for digital moderation and facilitation\n  - Exploring the impact of AI and XR on the quality and inclusivity of deliberation\n\n## References\n\n1. Farrell, D., & Suiter, J. (2023). *Citizens’ Assemblies and Deliberative Democracy: A Global Perspective*. Oxford University Press. https://doi.org/10.1093/oso/9780198867456.001.0001\n2. Mansbridge, J. (2022). *Deliberative Democracy and the Problem of Power*. Cambridge University Press. https://doi.org/10.1017/9781108867456\n3. Snower, D. J., & Twomey, P. D. (2025). *Empowering Digital Citizens: Making Humane Markets Work in the Digital Age*. Global Solutions Initiative. https://www.global-solutions-initiative.org/wp-content/uploads/2025/03/Empowering-Digital-Citizens-Report-web.pdf\n4. Borders, A. (2025). *Global Citizens’ Assemblies: Pathways for the UN*. Democracy International. https://www.democracy-international.org/sites/default/files/2025-09/global_citizens_assemblies_pathways_for_the_un.pdf\n5. Iswe Foundation. (2025). *Global Citizens’ Assembly*. https://www.iswe.org/insights-research/global-citizens-assembly\n6. Commonplace. (2024). *Citizens' Assemblies and Digital Wrapping*. https://www.commonplace.is/blog/citizens-assemblies-and-digital-wrapping\n7. Delib. (2025). *The Purpose of Citizens' Assemblies & Citizens' Juries*. https://newsroom.delib.net/citizens-assembly-citizens-jury/\n8. People Powered. (2025). *Citizens' Assemblies*. https://www.peoplepowered.org/citizens-assemblies\n9. Democracy International. (2025). *Global Citizens’ Assemblies – Pathways for the UN: Principles, Design, and Implementation*. https://www.democracy-international.org/stories/call-democratic-imagination-why-we-need-global-citizens-assemblies\n10. Democracy Technologies. (2025). *A Global Citizens Assembly Powered by AI?*. https://democracy-technologies.org/participation/global-citizens-assembly-ai-deliberation/\n\n## Metadata\n\n- **Last Updated**: 2025-11-11\n- **Review Status**: Comprehensive editorial review\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable",
  "backlinks": [],
  "wiki_links": [
    "Metaverse"
  ],
  "ontology": {
    "term_id": "20187",
    "preferred_term": "Digital Citizens’ Assembly",
    "alt_terms": [],
    "iri": null,
    "source_domain": "metaverse",
    "domain": "metaverse",
    "domain_full_name": "",
    "definition": null,
    "scope_note": null,
    "status": "draft",
    "maturity": null,
    "version": null,
    "public_access": true,
    "last_updated": null,
    "authority_score": null,
    "quality_score": null,
    "cross_domain_links": null,
    "owl_class": null,
    "owl_physicality": null,
    "owl_role": null,
    "owl_inferred_class": null,
    "is_subclass_of": [],
    "has_part": [],
    "is_part_of": [],
    "requires": [],
    "depends_on": [],
    "enables": [],
    "relates_to": [],
    "bridges_to": [],
    "bridges_from": [],
    "domain_extensions": {},
    "belongs_to_domain": [],
    "implemented_in_layer": [],
    "source": [],
    "validation": {
      "is_valid": false,
      "errors": [
        "Missing required property: last-updated",
        "Missing required property: definition",
        "Missing required property: owl:class",
        "Missing required property: owl:physicality",
        "Missing required property: owl:role",
        "Missing required property: is-subclass-of (at least one parent class)"
      ]
    }
  }
}