{
  "id": "Display Metrology",
  "title": "Display Metrology",
  "content": "- ### OntologyBlock\n  id:: displaymetrology-ontology\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: 20156\n\t- preferred-term:: Display Metrology\n\t- source-domain:: metaverse\n\t- status:: draft\n\t- is-subclass-of:: [[ArtificialIntelligence]]\n\t- public-access:: true\n\n\n\n# Display Metrology Ontology Entry – Revised\n\n## Academic Context\n\n- Display metrology represents the scientific discipline of measuring and quantifying the visual output characteristics of electronic displays[6]\n  - Defined formally by the International Bureau of Weights and Measures (BIPM) as the science of measurement, embracing both experimental and theoretical determinations across any field of science and technology[6]\n  - Encompasses measurement of primary display outputs: brightness, colour, contrast, and other visual qualities through rigorous scientific methodology[6]\n  - Distinguishes between two complementary measurement approaches: Spectral Power Distribution (SPD) for absolute electromagnetic output, and Spectral Sensitivity for human perceptual response accounting for the three cone types in the human eye[6]\n\n## Current Landscape (2025)\n\n- Standards and measurement frameworks\n  - The Information Display Measurements Standard (IDMS) v1.3 was released in May 2025 by the International Committee for Display Metrology (ICDM), part of the Society for Information Display (SID)[1][2]\n  - IDMS v1.3 comprises over 900 pages of display measurement methods and tutorials, representing the culmination of collaborative effort by display metrologists, engineers, physicists, and vision scientists across dozens of organisations[1][2]\n  - The standard encompasses approximately 140 display measurements covering every area of displays, intended for multiple user types from manufacturers to consumers[1][7]\n  - ICDM explicitly does not set compliance values; this responsibility falls to other standards organisations[1][7]\n  - Notable additions in v1.3 include extensive material on camera setup and imaging light devices with moiré reduction techniques, concentric ring imaging for Michelson contrast measurement on near-eye displays, temperature stabilisation protocols for HDR displays, and updated colour metrology content including uniform colour spaces and colour difference equations[2]\n  - New computational resources include code supporting gamut ring analysis for reflective displays and bidirectional scatter distribution function analysis[2]\n\n- Technical capabilities and measurement approaches\n  - Display metrology quantifies visual performance through standardised instrumentation including spectrophotometers, photometers, and imaging systems[6]\n  - Modern measurement frameworks accommodate diverse display technologies from traditional LCD and OLED to emerging near-eye and reflective display systems[1][2]\n  - Measurement protocols address both objective physical characteristics and human perceptual response, recognising that visual perception involves complex cone sensitivity across the electromagnetic spectrum[6]\n\n- UK and North England context\n  - The search results do not identify specific display metrology research centres or implementations within North England or the broader UK context; however, the ICDM's international composition suggests potential participation from British institutions and manufacturers in standards development\n\n## Research & Literature\n\n- Key standards and publications\n  - Society for Information Display (2012, updated 2021, 2023, 2025). *Information Display Measurements Standard (IDMS)* v1.03, v1.1, v1.2, v1.3. International Committee for Display Metrology. Available through SID Standards portal.[1][2]\n  - Kymissis, J. (2025). Statement on IDMS v1.3 release. Society for Information Display. [Referenced in SID announcement][2]\n\n- Foundational measurement science\n  - Bureau International des Poids et Mesures (BIPM). *Metrology: The Science of Measurement*. Formal definition and framework for measurement science across all disciplines.[6]\n  - Radiant Vision Systems. (2025). *Display Metrology: The Science of Quality Measurement*. Technical overview of spectral power distribution and spectral sensitivity in display measurement.[6]\n\n- Emerging research directions\n  - Digitisation of metrology data: BIPM's Forum on Metrology and Digitalization (2025) emphasises the integration of AI, automation, and digital infrastructures with measurement science, requiring adherence to FAIR principles (Findability, Accessibility, Interoperability, Reusability) for measurement data[5]\n  - Diffractive component characterisation: Recent work (2025) addresses measurement and characterisation of diffractive components in display reflection, indicating expansion into optical phenomena previously less systematically addressed[4]\n\n## Future Directions\n\n- Emerging technical frontiers\n  - Expansion of measurement protocols for advanced display technologies, particularly near-eye displays and reflective display systems requiring novel measurement geometries[2]\n  - Integration of artificial intelligence and machine-readable measurement data formats to enable cross-border comparability and seamless integration into digital regulatory frameworks[5]\n  - Development of standardised approaches to temperature-dependent display characterisation, particularly for HDR and high-performance displays[2]\n\n- Research priorities\n  - Harmonisation of digital measurement data formats across international standards bodies to prevent ecosystem fragmentation[5]\n  - Refinement of optical measurement techniques for emerging display technologies that challenge conventional measurement assumptions\n  - Continued evolution of human visual response modelling to account for advances in display technology and viewing conditions\n\n## Notes on Revision\n\nThe original definition conflated display metrology (the science of measurement) with measurement instrumentation. The revised entry clarifies that display metrology is a disciplinary approach encompassing standardised methods, frameworks, and scientific principles—of which instruments are merely tools. The current definition was overly narrow and equipment-focused, whereas display metrology encompasses theoretical foundations, standardisation efforts, and evolving measurement methodologies. The 2025 release of IDMS v1.3 represents a significant development warranting inclusion, though time-sensitive announcements regarding release dates have been contextualised appropriately. UK-specific context remains limited in available literature; this reflects genuine gaps in the search results rather than oversight.\n\n## Metadata\n\n- **Last Updated**: 2025-11-11\n- **Review Status**: Comprehensive editorial review\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable",
  "backlinks": [],
  "wiki_links": [
    "ArtificialIntelligence"
  ],
  "ontology": {
    "term_id": "20156",
    "preferred_term": "Display Metrology",
    "alt_terms": [],
    "iri": null,
    "source_domain": "metaverse",
    "domain": "metaverse",
    "domain_full_name": "",
    "definition": null,
    "scope_note": null,
    "status": "draft",
    "maturity": null,
    "version": null,
    "public_access": true,
    "last_updated": null,
    "authority_score": null,
    "quality_score": null,
    "cross_domain_links": null,
    "owl_class": null,
    "owl_physicality": null,
    "owl_role": null,
    "owl_inferred_class": null,
    "is_subclass_of": [],
    "has_part": [],
    "is_part_of": [],
    "requires": [],
    "depends_on": [],
    "enables": [],
    "relates_to": [],
    "bridges_to": [],
    "bridges_from": [],
    "domain_extensions": {},
    "belongs_to_domain": [],
    "implemented_in_layer": [],
    "source": [],
    "validation": {
      "is_valid": false,
      "errors": [
        "Missing required property: last-updated",
        "Missing required property: definition",
        "Missing required property: owl:class",
        "Missing required property: owl:physicality",
        "Missing required property: owl:role",
        "Missing required property: is-subclass-of (at least one parent class)"
      ]
    }
  }
}