{
  "id": "Fairness Constraints",
  "title": "Fairness Constraints",
  "content": "- ### OntologyBlock\n  id:: fairness-constraints-ontology\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: AI-0382\n\t- preferred-term:: Fairness Constraints\n\t- status:: in\n\t- public-access:: true\n\t- definition:: Fairness Constraints are mathematical formalizations of equitable treatment in AI systems, expressed as conditions that predictions must satisfy relative to protected attributes. These constraints are categorized into three fundamental types based on independence criteria: Independence (demographic parity) requires predictions to be independent of protected attributes (Ŷ ⊥ A), meaning P(Ŷ|A=0) = P(Ŷ|A=1); Separation (equalized odds) requires predictions to be independent of protected attributes conditional on true labels (Ŷ ⊥ A | Y), ensuring equal true positive and false positive rates across groups; and Sufficiency (predictive parity) requires true labels to be independent of protected attributes conditional on predictions (Y ⊥ A | Ŷ), ensuring equal precision and calibration across groups. These constraints formalize fairness concepts like demographic parity, equalized odds, equal opportunity (separation for positive class only), and calibration into optimization problems during model training. However, impossibility theorems (Chouldechova 2017, Kleinberg et al. 2017) prove that when base rates differ between groups, certain combinations of fairness constraints cannot be simultaneously satisfied, necessitating context-dependent tradeoffs. Implementation typically involves constrained optimization with Lagrange multipliers, where accuracy loss is balanced against fairness violations through tunable regularization parameters, as formalized in foundational research by Hardt et al. (2016) and Barocas et al. (2019).\n\t- source:: [[Hardt et al. (2016)]], [[Barocas et al. (2019)]], [[Chouldechova (2017)]]\n\t- maturity:: mature\n\t- owl:class:: aigo:FairnessConstraints\n\t- owl:physicality:: VirtualEntity\n\t- owl:role:: Process\n\t- owl:inferred-class:: aigo:VirtualProcess\n\t- belongsToDomain:: [[AIEthicsDomain]]\n\t- implementedInLayer:: [[ConceptualLayer]]\n\t- #### Relationships\n\t  id:: fairness-constraints-relationships\n\t  collapsed:: true\n\t\t- is-subclass-of:: [[AlgorithmicBias]]\n\n## Fairness Constraints\n\nFairness Constraints refers to fairness constraints are mathematical formalizations of equitable treatment in ai systems, expressed as conditions that predictions must satisfy relative to protected attributes. these constraints are categorised into three fundamental types based on independence criteria: independence (demographic parity) requires predictions to be independent of protected attributes (ŷ ⊥ a), meaning p(ŷ|a=0) = p(ŷ|a=1); separation (equalized odds) requires predictions to be independent of protected attributes conditional on true labels (ŷ ⊥ a | y), ensuring equal true positive and false positive rates across groups; and sufficiency (predictive parity) requires true labels to be independent of protected attributes conditional on predictions (y ⊥ a | ŷ), ensuring equal precision and calibration across groups. these constraints formalize fairness concepts like demographic parity, equalized odds, equal opportunity (separation for positive class only), and calibration into optimization problems during model training. however, impossibility theorems (chouldechova 2017, kleinberg et al. 2017) prove that when base rates differ between groups, certain combinations of fairness constraints cannot be simultaneously satisfied, necessitating context-dependent tradeoffs. implementation typically involves constrained optimization with lagrange multipliers, where accuracy loss is balanced against fairness violations through tunable regularization parameters, as formalized in foundational research by hardt et al. (2016) and barocas et al. (2019).\n\n- Industry adoption and implementations\n\t- Fairness constraints are now routinely incorporated into AI development pipelines across sectors including finance, healthcare, criminal justice, and employment\n\t- Major platforms such as Fairlearn, IBM AI Fairness 360, and Google’s What-If Tool provide accessible frameworks for implementing and auditing fairness constraints\n\t- In the UK, organisations like the Alan Turing Institute and the Centre for Data Ethics and Innovation have published guidance and tools for fairness-aware AI development\n- Notable organisations and platforms\n\t- Fairlearn (Microsoft Research)\n\t- AI Fairness 360 (IBM)\n\t- What-If Tool (Google)\n\t- LangChain, AutoGen, and CrewAI for workflow integration\n- UK and North England examples where relevant\n\t- The Greater Manchester Combined Authority has piloted fairness-aware algorithms in public service delivery, focusing on equitable access to social care and housing\n\t- Leeds City Council has collaborated with local universities to audit AI-driven recruitment tools for bias, ensuring compliance with the Equality Act 2010\n\t- Newcastle University’s Centre for Social Justice and Community Action has developed fairness constraints for predictive policing models, aiming to reduce disproportionate targeting of minority communities\n\t- Sheffield Hallam University’s Advanced Manufacturing Research Centre has explored fairness in AI-driven workforce planning, with a focus on inclusive hiring practices\n- Technical capabilities and limitations\n\t- Modern fairness constraints can enforce various notions of fairness, such as demographic parity, equalised odds, and counterfactual fairness\n\t- However, there are inherent limitations, including trade-offs between fairness and accuracy, the need for sensitive data, and the difficulty of hard-coding nuanced ethical principles\n\t- Some critics argue that technical solutions alone cannot fully address systemic discrimination, and that fairness constraints should be complemented by broader organisational and societal reforms\n- Standards and frameworks\n\t- The UK’s Information Commissioner’s Office (ICO) has issued guidance on AI and data protection, emphasising the importance of fairness in automated decision-making\n\t- The European Union’s AI Act (2024) includes provisions for fairness and non-discrimination, influencing UK regulatory approaches post-Brexit\n\t- Industry standards such as ISO/IEC 23894 (2023) on AI risk management provide a framework for integrating fairness constraints into AI governance\n\n## Technical Details\n\n- **Id**: 0382-fairness-constraints-about\n- **Collapsed**: true\n- **Domain Prefix**: AI\n- **Sequence Number**: 0382\n- **Filename History**: [\"AI-0382-fairness-constraints.md\"]\n- **Public Access**: true\n- **Source Domain**: ai\n- **Status**: in-progress\n- **Last Updated**: 2025-10-29\n- **Maturity**: mature\n- **Source**: [[Hardt et al. (2016)]], [[Barocas et al. (2019)]], [[Chouldechova (2017)]]\n- **Authority Score**: 0.95\n- **Owl:Class**: aigo:FairnessConstraints\n- **Owl:Physicality**: VirtualEntity\n- **Owl:Role**: Process\n- **Owl:Inferred Class**: aigo:VirtualProcess\n- **Belongstodomain**: [[AIEthicsDomain]]\n- **Implementedinlayer**: [[ConceptualLayer]]\n\n## Research & Literature\n\n- Key academic papers and sources\n\t- Dwork, C., Hardt, M., Pitassi, T., Reingold, O., & Zemel, R. (2012). Fairness through awareness. In Proceedings of the 3rd Innovations in Theoretical Computer Science Conference (pp. 214–226). ACM. https://doi.org/10.1145/2090236.2090255\n\t- Hardt, M., Price, E., & Srebro, N. (2016). Equality of opportunity in supervised learning. In Advances in Neural Information Processing Systems (pp. 3315–3323). https://proceedings.neurips.cc/paper/2016/hash/9d2682367c3935defcb1f9e247a97c0d-Abstract.html\n\t- Mehrabi, N., Morstatter, F., Saxena, N., Lerman, K., & Galstyan, A. (2021). A survey on bias and fairness in machine learning. ACM Computing Surveys, 54(6), 1–35. https://doi.org/10.1145/3457607\n\t- Selbst, A. D., Boyd, D., Friedler, S. A., Venkatasubramanian, S., & Vertesi, J. (2019). Fairness and abstraction in sociotechnical systems. In Proceedings of the Conference on Fairness, Accountability, and Transparency (pp. 59–68). ACM. https://doi.org/10.1145/3287560.3287598\n\t- Cowls, J., Tsamados, A., Taddeo, M., & Floridi, L. (2021). The AI fairness paradox: Why fairness can’t be automated. Philosophy & Technology, 34(4), 1087–1107. https://doi.org/10.1007/s13347-021-00458-4\n- Ongoing research directions\n\t- Developing fairness constraints that are robust to distributional shifts and adversarial attacks\n\t- Exploring the intersection of fairness with privacy, transparency, and accountability\n\t- Investigating the role of fairness constraints in generative AI and large language models\n\t- Addressing the challenge of operationalising fairness in real-world, high-stakes decision-making contexts\n\n## UK Context\n\n- British contributions and implementations\n\t- The UK has been at the forefront of AI ethics and fairness research, with institutions such as the Alan Turing Institute, the Ada Lovelace Institute, and the Centre for Data Ethics and Innovation leading the way\n\t- The government’s AI Council has published a national strategy for AI, which includes a strong emphasis on fairness and inclusivity\n\t- The ICO’s guidance on AI and data protection has helped shape best practices for fairness-aware AI development in the UK\n- North England innovation hubs (if relevant)\n\t- Manchester’s Digital Innovation Factory has hosted workshops and hackathons focused on fairness in AI, bringing together academics, industry experts, and community stakeholders\n\t- Leeds has established a Centre for Responsible AI, which collaborates with local businesses and public sector organisations to develop and deploy fairness-aware AI solutions\n\t- Newcastle’s Centre for Social Justice and Community Action has worked with local authorities to audit and improve the fairness of AI-driven public services\n\t- Sheffield’s Advanced Manufacturing Research Centre has explored the use of fairness constraints in workforce planning and recruitment, with a focus on inclusive hiring practices\n- Regional case studies\n\t- The Greater Manchester Combined Authority’s use of fairness-aware algorithms in social care allocation has been cited as a model for other UK cities\n\t- Leeds City Council’s collaboration with the University of Leeds on AI-driven recruitment tools has led to improved diversity and inclusion in local government hiring\n\t- Newcastle University’s work on predictive policing models has informed national debates about the role of fairness constraints in law enforcement\n\n## Future Directions\n\n- Emerging trends and developments\n\t- Increasing use of fairness constraints in generative AI and large language models\n\t- Growing interest in explainable and interpretable fairness constraints\n\t- Development of fairness-aware AI governance frameworks and regulatory standards\n- Anticipated challenges\n\t- Balancing fairness with other desirable properties such as accuracy, efficiency, and privacy\n\t- Addressing the limitations of technical solutions in the face of systemic discrimination\n\t- Ensuring that fairness constraints are accessible and usable by non-expert practitioners\n- Research priorities\n\t- Developing fairness constraints that are robust to distributional shifts and adversarial attacks\n\t- Exploring the intersection of fairness with privacy, transparency, and accountability\n\t- Investigating the role of fairness constraints in real-world, high-stakes decision-making contexts\n\n## References\n\n1. Dwork, C., Hardt, M., Pitassi, T., Reingold, O., & Zemel, R. (2012). Fairness through awareness. In Proceedings of the 3rd Innovations in Theoretical Computer Science Conference (pp. 214–226). ACM. https://doi.org/10.1145/2090236.2090255\n2. Hardt, M., Price, E., & Srebro, N. (2016). Equality of opportunity in supervised learning. In Advances in Neural Information Processing Systems (pp. 3315–3323). https://proceedings.neurips.cc/paper/2016/hash/9d2682367c3935defcb1f9e247a97c0d-Abstract.html\n3. Mehrabi, N., Morstatter, F., Saxena, N., Lerman, K., & Galstyan, A. (2021). A survey on bias and fairness in machine learning. ACM Computing Surveys, 54(6), 1–35. https://doi.org/10.1145/3457607\n4. Selbst, A. D., Boyd, D., Friedler, S. A., Venkatasubramanian, S., & Vertesi, J. (2019). Fairness and abstraction in sociotechnical systems. In Proceedings of the Conference on Fairness, Accountability, and Transparency (pp. 59–68). ACM. https://doi.org/10.1145/3287560.3287598\n5. Cowls, J., Tsamados, A., Taddeo, M., & Floridi, L. (2021). The AI fairness paradox: Why fairness can’t be automated. Philosophy & Technology, 34(4), 1087–1107. https://doi.org/10.1007/s13347-021-00458-4\n6. Information Commissioner’s Office. (2023). Guidance on AI and data protection. https://ico.org.uk/for-organisations/guide-to-data-protection/guide-to-the-general-data-protection-regulation-gdpr/artificial-intelligence/\n7. European Commission. (2024). Proposal for a Regulation on Artificial Intelligence (AI Act). https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:52021PC0206\n8. International Organization for Standardization. (2023). ISO/IEC 23894:2023 Information technology — Artificial intelligence — Guidance on risk management. https://www.iso.org/standard/81234.html\n\n## Metadata\n\n- **Migration Status**: Ontology block enriched on 2025-11-12\n- **Last Updated**: 2025-11-12\n- **Review Status**: Comprehensive editorial review\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable",
  "backlinks": [
    "Loss Function",
    "Safety Laser Scanner"
  ],
  "wiki_links": [
    "AlgorithmicBias",
    "Hardt et al. (2016)",
    "Barocas et al. (2019)",
    "ConceptualLayer",
    "Chouldechova (2017)",
    "AIEthicsDomain"
  ],
  "ontology": {
    "term_id": "AI-0382",
    "preferred_term": "Fairness Constraints",
    "alt_terms": [],
    "iri": "http://narrativegoldmine.com/ai#aigo:FairnessConstraints",
    "source_domain": "ai",
    "domain": "ai",
    "domain_full_name": "Artificial Intelligence",
    "definition": "Fairness Constraints are mathematical formalizations of equitable treatment in AI systems, expressed as conditions that predictions must satisfy relative to protected attributes. These constraints are categorized into three fundamental types based on independence criteria: Independence (demographic parity) requires predictions to be independent of protected attributes (Ŷ ⊥ A), meaning P(Ŷ|A=0) = P(Ŷ|A=1); Separation (equalized odds) requires predictions to be independent of protected attributes conditional on true labels (Ŷ ⊥ A | Y), ensuring equal true positive and false positive rates across groups; and Sufficiency (predictive parity) requires true labels to be independent of protected attributes conditional on predictions (Y ⊥ A | Ŷ), ensuring equal precision and calibration across groups. These constraints formalize fairness concepts like demographic parity, equalized odds, equal opportunity (separation for positive class only), and calibration into optimization problems during model training. However, impossibility theorems (Chouldechova 2017, Kleinberg et al. 2017) prove that when base rates differ between groups, certain combinations of fairness constraints cannot be simultaneously satisfied, necessitating context-dependent tradeoffs. Implementation typically involves constrained optimization with Lagrange multipliers, where accuracy loss is balanced against fairness violations through tunable regularization parameters, as formalized in foundational research by Hardt et al. (2016) and Barocas et al. (2019).",
    "scope_note": null,
    "status": "in",
    "maturity": "mature",
    "version": null,
    "public_access": true,
    "last_updated": "2025-10-29",
    "authority_score": 0.95,
    "quality_score": null,
    "cross_domain_links": null,
    "owl_class": "aigo:FairnessConstraints",
    "owl_physicality": "VirtualEntity",
    "owl_role": "Process",
    "owl_inferred_class": "aigo:VirtualProcess",
    "is_subclass_of": [
      "AlgorithmicBias"
    ],
    "has_part": [],
    "is_part_of": [],
    "requires": [],
    "depends_on": [],
    "enables": [],
    "relates_to": [],
    "bridges_to": [],
    "bridges_from": [],
    "domain_extensions": {},
    "belongs_to_domain": [
      "AIEthicsDomain"
    ],
    "implemented_in_layer": [
      "ConceptualLayer"
    ],
    "source": [
      "Hardt et al. (2016)",
      "Barocas et al. (2019)",
      "Chouldechova (2017)"
    ],
    "validation": {
      "is_valid": false,
      "errors": [
        "owl:class namespace 'aigo' doesn't match source-domain 'ai'"
      ]
    }
  }
}