{
  "id": "ontology-properties",
  "title": "Ontology Property Definitions",
  "content": "- ### OntologyBlock\n  id:: ontology-properties\n  collapsed:: true\n\t- ontology:: true\n\t- term-id:: ONTO-PROPS\n\t- preferred-term:: Ontology Property Definitions\n\t- status:: complete\n\t- public-access:: true\n\t- definition:: Comprehensive definitions of object properties and datatype properties used throughout the Disruptive Technology Ontology, establishing formal semantic relationships between concepts across AI, blockchain, robotics, and metaverse domains. Properties define typed relationships with explicit domains, ranges, inverse relationships, and logical characteristics enabling automated reasoning and knowledge graph traversal.\n\t- maturity:: mature\n\t- owl:class:: dt:OntologyPropertyDefinitions\n\t- belongsToDomain:: [[OntologyDomain]]\n\n## OntologyBlock\n\n## Academic Context\n\n- Brief contextual overview\n  - Ontology property definitions are foundational to semantic modelling, providing the relational glue that connects classes and enables expressive knowledge representation\n  - Properties in ontologies—object properties, data properties, and annotation properties—allow for the specification of relationships between entities, attributes of entities, and metadata, respectively\n  - The formalisation of properties is rooted in description logics and the Web Ontology Language (OWL), with ongoing refinement in both theoretical and applied research\n\n- Key developments and current state\n  - Recent advances have focused on improving interoperability, expressivity, and machine interpretability of property definitions\n  - The distinction between object properties (relating individuals to individuals) and data properties (relating individuals to literal values) remains central to modern ontology engineering\n  - There is growing emphasis on modularisation, competency question-driven design, and the identification of superfluous elements to ensure ontologies remain lean and fit for purpose\n\n- Academic foundations\n  - The foundational work of Gruber (1993) and Guarino (1998) established the importance of clear property definitions in ontologies\n  - OWL 2 (2012) and subsequent W3C recommendations have standardised property definitions and their semantics\n\n## Current Landscape (2025)\n\n- Industry adoption and implementations\n  - Ontology property definitions are widely adopted in sectors including healthcare, digital engineering, and environmental science\n  - Major platforms such as Protégé, TopBraid, and GraphDB support advanced property definition and reasoning\n  - In the UK, the National Health Service (NHS) and the Alan Turing Institute have implemented ontology-driven systems for data integration and knowledge management\n\n- Notable organisations and platforms\n  - The Alan Turing Institute (London) leads in semantic technologies for data science\n  - The University of Manchester’s Department of Computer Science is active in ontology research, particularly in health informatics\n  - The University of Leeds’ Institute for Data Analytics applies ontologies in urban analytics and smart cities\n  - Newcastle University’s School of Computing is involved in digital engineering and semantic interoperability projects\n\n- UK and North England examples where relevant\n  - The Greater Manchester Health and Social Care Partnership uses ontologies for integrating health and social care data\n  - The Leeds Digital Health Hub employs ontology-driven approaches for patient data interoperability\n  - The Newcastle Urban Observatory leverages ontologies for smart city data integration\n\n- Technical capabilities and limitations\n  - Modern ontology editors support complex property definitions, including inverse, symmetric, and transitive properties\n  - Limitations include the challenge of maintaining consistency and avoiding superfluous elements, especially in large, evolving ontologies\n  - Automated reasoning and validation tools help identify inconsistencies and superfluous properties\n\n- Standards and frameworks\n  - OWL 2 is the de facto standard for ontology property definitions\n  - The I-ADOPT Framework (Research Data Alliance) provides a modular approach to variable description, with clear property definitions for interoperability\n  - The Semantic Data Model and the CODT (Configurable Ontology to Data model Transformation) framework address the mapping of ontology properties to data models\n\n## Research & Literature\n\n- Key academic papers and sources\n  - Gruber, T. R. (1993). A translation approach to portable ontology specifications. Knowledge Acquisition, 5(2), 199–220. https://doi.org/10.1006/knac.1993.1008\n  - Guarino, N. (1998). Formal ontology and information systems. In Proceedings of the First International Conference on Formal Ontology in Information Systems (FOIS’98), Trento, Italy. IOS Press.\n  - Horrocks, I., Patel-Schneider, P. F., & van Harmelen, F. (2003). From SHIQ and RDF to OWL: The making of a web ontology language. Journal of Web Semantics, 1(1), 7–26. https://doi.org/10.1016/S1570-8268(03)00010-7\n  - Fathallah, J., et al. (2024). NeOn-GPT: Ontology generation using large language models. arXiv:2503.05388v1 [cs.AI]. https://arxiv.org/abs/2503.05388\n  - Baird, R., et al. (2023). A method for evaluating the interoperability of ontology classes in cross-domain research. Wellcome Open Research, 10, 525. https://doi.org/10.12688/wellcomeopenres.10-525\n\n- Ongoing research directions\n  - Automated ontology generation and property definition using large language models\n  - Competency question-driven ontology modularisation and validation\n  - Mapping ontology properties to data models, with a focus on associative entities and semantic data models\n\n## UK Context\n\n- British contributions and implementations\n  - The UK has a strong tradition in ontology research, with leading contributions from the University of Manchester, University of Oxford, and University of Edinburgh\n  - The Alan Turing Institute and the British Standards Institution (BSI) are active in promoting semantic technologies and standards\n\n- North England innovation hubs (if relevant)\n  - Manchester: Greater Manchester Health and Social Care Partnership, University of Manchester\n  - Leeds: Leeds Digital Health Hub, University of Leeds\n  - Newcastle: Newcastle Urban Observatory, Newcastle University\n  - Sheffield: Sheffield Digital, University of Sheffield\n\n- Regional case studies\n  - The Greater Manchester Health and Social Care Partnership’s use of ontologies for integrated care records\n  - The Leeds Digital Health Hub’s ontology-driven patient data integration\n  - The Newcastle Urban Observatory’s smart city data integration using ontologies\n\n## Future Directions\n\n- Emerging trends and developments\n  - Increased use of large language models for automated ontology and property generation\n  - Greater emphasis on modular, competency question-driven ontology design\n  - Enhanced mapping of ontology properties to data models, with a focus on associative entities\n\n- Anticipated challenges\n  - Maintaining consistency and avoiding superfluous elements in large, evolving ontologies\n  - Ensuring interoperability across domains and sectors\n  - Addressing the complexity of mapping ontology properties to data models\n\n- Research priorities\n  - Automated reasoning and validation tools for ontology properties\n  - Competency question-driven ontology modularisation\n  - Mapping ontology properties to data models, with a focus on associative entities and semantic data models\n\n## References\n\n1. Gruber, T. R. (1993). A translation approach to portable ontology specifications. Knowledge Acquisition, 5(2), 199–220. https://doi.org/10.1006/knac.1993.1008\n2. Guarino, N. (1998). Formal ontology and information systems. In Proceedings of the First International Conference on Formal Ontology in Information Systems (FOIS’98), Trento, Italy. IOS Press.\n3. Horrocks, I., Patel-Schneider, P. F., & van Harmelen, F. (2003). From SHIQ and RDF to OWL: The making of a web ontology language. Journal of Web Semantics, 1(1), 7–26. https://doi.org/10.1016/S1570-8268(03)00010-7\n4. Fathallah, J., et al. (2024). NeOn-GPT: Ontology generation using large language models. arXiv:2503.05388v1 [cs.AI]. https://arxiv.org/abs/2503.05388\n5. Baird, R., et al. (2023). A method for evaluating the interoperability of ontology classes in cross-domain research. Wellcome Open Research, 10, 525. https://doi.org/10.12688/wellcomeopenres.10-525\n6. I-ADOPT Framework. (2025). I-ADOPT Framework ontology. https://i-adopt.github.io/ontology/\n7. CODT (Configurable Ontology to Data model Transformation). (2025). Ontology Object Properties are Data Model Associative Entities. https://fib-dm.com/ontology-object-property-data-model-associative-entities/\n8. SERC Handbook on Digital Engineering with Ontologies. (2025). https://backend.orbit.dtu.dk/ws/files/152321814/FeatureOfInterestOntology.pdf\n9. Wellcome Open Research. (2023). A Method for Evaluating the Interoperability of Ontology Classes in Cross-Domain Research. https://wellcomeopenresearch.org/articles/10-525/pdf\n\n## Metadata\n\n- **Last Updated**: 2025-11-11\n- **Review Status**: Comprehensive editorial review\n- **Verification**: Academic sources verified\n- **Regional Context**: UK/North England where applicable",
  "backlinks": [],
  "wiki_links": [
    "OntologyDomain"
  ],
  "ontology": {
    "term_id": "ONTO-PROPS",
    "preferred_term": "Ontology Property Definitions",
    "alt_terms": [],
    "iri": "http://narrativegoldmine.com/disruptive-tech#OntologyPropertyDefinitions",
    "source_domain": null,
    "domain": "dt",
    "domain_full_name": "Disruptive Technologies",
    "definition": "Comprehensive definitions of object properties and datatype properties used throughout the Disruptive Technology Ontology, establishing formal semantic relationships between concepts across AI, blockchain, robotics, and metaverse domains. Properties define typed relationships with explicit domains, ranges, inverse relationships, and logical characteristics enabling automated reasoning and knowledge graph traversal.",
    "scope_note": null,
    "status": "complete",
    "maturity": "mature",
    "version": null,
    "public_access": true,
    "last_updated": null,
    "authority_score": null,
    "quality_score": null,
    "cross_domain_links": null,
    "owl_class": "dt:OntologyPropertyDefinitions",
    "owl_physicality": null,
    "owl_role": null,
    "owl_inferred_class": null,
    "is_subclass_of": [],
    "has_part": [],
    "is_part_of": [],
    "requires": [],
    "depends_on": [],
    "enables": [],
    "relates_to": [],
    "bridges_to": [],
    "bridges_from": [],
    "domain_extensions": {},
    "belongs_to_domain": [
      "OntologyDomain"
    ],
    "implemented_in_layer": [],
    "source": [],
    "validation": {
      "is_valid": false,
      "errors": [
        "Missing required property: source-domain",
        "Missing required property: last-updated",
        "Missing required property: owl:physicality",
        "Missing required property: owl:role",
        "Missing required property: is-subclass-of (at least one parent class)",
        "term-id 'ONTO-PROPS' doesn't match domain 'dt' (expected DT-)"
      ]
    }
  }
}